[{"data":1,"prerenderedAt":103},["ShallowReactive",2],{"game-subway-surfers-newyork":3,"similar-subway-surfers-newyork":13},{"slug":4,"title":5,"description":6,"image":7,"categories":8,"format":11,"url":12},"subway-surfers-newyork","Subway Surfers Newyork","Subway Surfers hits the Big Apple! Run through the iconic New York City subway system, dodge trains, and surf past famous landmarks. Collect Statue of Liberty tokens to unlock prizes.\n\nThe game captures the hustle and bustle of NYC. Unlock street-smart characters and boards designed for the concrete jungle. Can you make it in New York?","/media/subway-surfers-newyork.webp",[9,10],"arcade","new","html5","https://23azostore.github.io/s8/subway-surfers-newyork/",[14,23,30,38,45,53,60,67,74,81,89,96],{"slug":15,"title":16,"description":17,"image":18,"categories":19,"format":11,"url":22},"drive-mad","Drive Mad","Drive Mad is a compact physics‑based drive across uneven tracks where keeping the vehicle upright is the whole game. Bridges wobble, platforms tilt, and small jumps punish heavy landings. You feather the throttle, tap the brake to settle, and accept that patience solves more problems than speed.\n\nMoment to moment you’re managing weight: lean in before a ramp, lift to avoid a nose‑down crash, and correct mid‑air without oversteering. Levels escalate cleanly, and the best clears feel like tidy puzzles solved by good pacing. It’s playful, readable, and built for quick wins that stack up.","/media/drive-mad.webp",[20,21,10],"driving","popular","https://drive-madgame.github.io/file/",{"slug":24,"title":25,"description":26,"image":27,"categories":28,"format":11,"url":29},"geometry-dash","Geometry Dash","Geometry Dash is a rhythm-based platformer that will test your patience and skills. Jump and fly your way through danger in this rhythm-based action platformer!\n\nThe game features simple one-touch game play with many levels that will keep you entertained for hours. Use practice mode to sharpen your skills and unlock new icons and colors to customize your character.","/media/geometry-dash.webp",[9,21,10],"https://23azostore.github.io/s8/geometry-dash/",{"slug":31,"title":32,"description":33,"image":34,"categories":35,"format":11,"url":37},"brain-test-tricky-puzzles","Brain Test Tricky Puzzles","Brain Test: Tricky Puzzles is a collection of short, lateral‑thinking riddles where the obvious answer is rarely correct. You interact with the scene directly—drag items, combine them, move text, or reveal things hidden off screen—to find the trick that solves the level. The draw is the steady stream of small “aha” moments and the way even simple prompts hide playful solutions. If you’re stuck, read the question carefully, try manipulating the background, and consider whether the answer comes from an object you create rather than one already shown. It’s light, fast, and designed for quick sessions that feel satisfying when a stubborn level finally gives way.","/media/brain-test-tricky-puzzles.webp",[36,21,10],"puzzle","https://23azostore.github.io/s2/brain-test-tricky-puzzles/",{"slug":39,"title":40,"description":41,"image":42,"categories":43,"format":11,"url":44},"12-minibattles","12 MiniBattles","12 MiniBattles captures the joy of couch competition in its purest form: two players, one button each, and a carousel of bite‑size challenges that flip the rules every round. One moment you’re angling a toe‑poke past a frantic goalkeeper, the next you’re timing a leap in an archery duel or baiting a rival tank onto a cliff. The physics are playful but consistent, so the difference between chaos and control is learning the rhythm and trusting your timing.\n\nWhat makes it sticky is the speed. Rounds last seconds, momentum swings fast, and that single well‑timed press can feel like a masterstroke when the crowd erupts. You don’t need to memorize systems or grind unlocks; the fun comes from reading each scenario and improvising under pressure. It’s the kind of game that turns a quiet evening into a tournament where \"best of five\" becomes \"best of twenty\" without anyone noticing—easy to start, hard to stop, and perfectly tuned for laughter, grudge matches, and tiny comebacks that feel huge.","/media/12-minibattles.webp",[9],"https://23azostore.github.io/s2/12-minibattles/",{"slug":46,"title":47,"description":48,"image":49,"categories":50,"format":11,"url":52},"4th-and-goal-2022","4th and Goal 2022","4th and Goal 2022 distills American football into brisk drives and meaningful decisions. The playbook is compact but expressive: inside runs to set a rhythm, option looks that punish over‑pursuit, and timing routes that reward a calm read when a safety bites. On defense, a well‑chosen blitz can flip a possession, while disciplined coverage squeezes windows until a hurried throw invites a takeaway.\n\nModes range from quick games to deeper playoff runs, and the tone stays consistent—intuitive controls, short possessions, and enough tactical space that smart play‑calling tells. Drives hinge on small choices: take the yards and bleed the clock, or push for a dagger before the half; pin them deep with field position, or gamble on fourth down when momentum is yours. Red‑zone snaps carry that familiar knot in the stomach, and touchdowns feel earned rather than scripted. It’s football trimmed to essentials, lively and readable, where a season’s story is written in a handful of clutch plays.","/media/4th-and-goal-2022.webp",[51,10],"sports","https://23azostore.github.io/s2/4th-and-goal-2022/",{"slug":54,"title":55,"description":56,"image":57,"categories":58,"format":11,"url":59},"a-dance-of-fire-and-ice","A Dance of Fire and Ice","A Dance of Fire and Ice is rhythm distilled: one button, perfect timing, and paths that turn music into motion. Two luminous orbs trace angles, gaps, and sudden switches, and your only job is to press exactly on the beat. There’s no generous buffer or off‑beat mercy—calibrate once, breathe, and trust the soundtrack as patterns grow from simple steps to layered syncopation.\n\nEach world introduces an idea and then tests your understanding with playful twists. A time signature change resets your count, a deceptive curve hides a double tap, a quiet bridge asks for focus more than speed. It’s challenging but fair, and when the press lands and the path flows without a stutter, there’s a singular satisfaction in the way sound and motion snap into one. For rhythm‑game devotees, it’s pure signal: clear rules, precise feedback, and the enduring thrill of mastery.","/media/a-dance-of-fire-and-ice.webp",[9],"https://23azostore.github.io/s8/a-dance-of-fire-and-ice/",{"slug":61,"title":62,"description":63,"image":64,"categories":65,"format":11,"url":66},"aqua-thrills","Aqua Thrills","Aqua Thrills is a fast water‑slide racer about simple steering and good timing. You guide a tube down long, winding slides, adjust left and right to hold a line, and bump rivals when you need space. Races are short and forgiving at first, then add tighter curves, faster sections, and hazards that ask for cleaner inputs.\n\nProgress brings new parks, slides, and cosmetic unlocks. The controls stay straightforward, which makes it easy to jump in for a few runs and see improvement quickly. If you enjoy lightweight racing with clear feedback and quick restarts, it scratches that itch well without getting complicated.","/media/aqua-thrills.webp",[9],"https://23azostore.github.io/s2/aqua-thrills/",{"slug":68,"title":69,"description":70,"image":71,"categories":72,"format":11,"url":73},"battle-wheels","Battle Wheels","Battle Wheels is a quick 1v1 arena bout where open‑top cars try to bonk each other on the head. You lurch forward and back to build rhythm, flip for height, and aim to land a clean hit that drains health. Between rounds, simple upgrades to health, damage, and wheels help your car feel sturdier or sharper, and a local two‑player mode turns it into a light, competitive party game. The physics do most of the work—small nudges set up flips, and flips set up roof drops—so the match becomes about timing rather than perfect driving lines. It’s fast, readable, and good for a few rounds at a time.","/media/battle-wheels.webp",[9],"https://i.gamesgo.net/uploads/game/html5/25939/",{"slug":75,"title":76,"description":77,"image":78,"categories":79,"format":11,"url":80},"big-shot-boxing","Big Shot Boxing","Big Shot Boxing is a pared‑down boxing career that hinges on patient timing. Fights use a small set of inputs—jabs, crosses, uppercuts, and blocks—and the rhythm is about stamina, guard openings, and taking the simple shot when it’s there. Outside the ring you pick a trainer, build basic stats, and climb from early cards toward title bouts, with the sense that any match can swing if you lose focus. The pixel look fits the straightforward design, and the loop of train‑fight‑recover makes short sessions feel productive. If you like boxing without complex systems, this offers honest rounds where a few good reads decide the night.","/media/big-shot-boxing.webp",[9],"https://23azostore.github.io/s2/big-shot-boxing/",{"slug":82,"title":83,"description":84,"image":85,"categories":86,"format":11,"url":88},"blumgi-rocket","Blumgi Rocket","Blumgi Rocket is a side‑scrolling platformer built around a rocket‑boosted car. You hold for thrust, enjoy a short slow‑motion window during burns, and use stunts to keep pace through hills, tunnels, and tight gaps. Tracks hide shortcuts and safer lines, so a clean route often matters more than constant speed. New skins arrive as you clear levels, and the handling stays consistent enough that learning one car’s rhythm carries across the set.","/media/blumgi-rocket.webp",[9,87],"originals","https://webglmath.github.io/blumgi-rocket/",{"slug":90,"title":91,"description":92,"image":93,"categories":94,"format":11,"url":95},"blumgi-slime","Blumgi Slime","Blumgi Slime is a jump‑only platformer. Your character can’t walk, so you hold to charge, release to leap, and aim for clean arcs that land on safe ground or the checkered goal. Stages add new colors and obstacle types as you go, but the core stays readable: judge distance, pick a height, and commit. It’s a simple loop that feels good when you string jumps together without hesitation.","/media/blumgi-slime.webp",[9,87],"https://23azostore.github.io/s2/blumgi-slime",{"slug":97,"title":98,"description":99,"image":100,"categories":101,"format":11,"url":102},"boxing-physics-2","Boxing Physics 2","Boxing Physics 2 turns boxing into a simple, ragdoll‑driven duel that’s more about timing than complicated inputs. Matches are short races to five points. You press a single key to punch, jump and lurch all at once, and the wobble of each fighter creates odd angles where a clean hit can land. Rounds change the setup so you’re not always fighting on the same surface, and learning to wait for balance before throwing is the difference between whiffing and scoring. A good approach is to hold a little distance, watch for your opponent to lean forward or lose footing, then tap at that exact moment. If a power‑up appears, use it to extend reach or finish a round from safety. The best wins come from calm reads rather than button mashing, and once you catch the rhythm, comebacks happen fast.","/media/boxing-physics-2.webp",[9],"https://23azostore.github.io/s2/boxing-physics-2/",1765456730235]