[{"data":1,"prerenderedAt":208},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-doodle-jump":40,"similar-doodle-jump":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"doodle-jump","Doodle Jump","/media/doodle-jump.webp",[11,23],"html5","https://23azostore.github.io/s7/doodle-jump/","Doodle Jump is a vertical climb where survival comes from steady timing and small, confident moves. Platforms slide and shift, gaps appear without warning, and hazards punish jumps made a fraction too early. You steer left and right, commit to a route, and learn to favor safe landings over risky leaps that save a second and cost a run.\n\nMoment to moment, it’s about reading what’s two steps ahead: a moving platform that needs a patient approach, a fragile one that buys height but won’t hold twice, a hazard you clear by trusting your jump arc. The rhythm is brisk—quick restarts, visible improvement—and scores rise when you stop chasing miracles and string together clean decisions. It’s straightforward, honest platforming that rewards calm execution.","Play Doodle Jump unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Doodle Jump Pizza Edition, Doodle Jump Fullscreen, Doodle Jump unblocked, arcade games",9.6,10962,"Pizza Edition",[54],"Desktop Web","November 2024",[57,71,85,97,110,123,134,146,159,171,184,196],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":68,"platform":69,"lastUpdated":70},"geometry-dash","Geometry Dash","/media/geometry-dash.webp",[11,26,20],"https://23azostore.github.io/s8/geometry-dash/","Geometry Dash is a rhythm-based platformer that will test your patience and skills. Jump and fly your way through danger in this rhythm-based action platformer!\n\nThe game features simple one-touch game play with many levels that will keep you entertained for hours. Use practice mode to sharpen your skills and unlock new icons and colors to customize your character.","Play Geometry Dash unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Geometry Dash Pizza Edition, Geometry Dash Fullscreen, Geometry Dash unblocked, arcade games",9.5,47094,"Pizza Dev Team",[54],"July 2024",{"slug":72,"title":73,"image":74,"categories":75,"format":45,"url":76,"content":77,"description":78,"keywords":79,"rating":80,"votes":81,"developer":82,"platform":83,"lastUpdated":84},"12-minibattles","12 MiniBattles","/media/12-minibattles.webp",[11,17],"https://23azostore.github.io/s2/12-minibattles/","12 MiniBattles captures the joy of couch competition in its purest form: two players, one button each, and a carousel of bite‑size challenges that flip the rules every round. One moment you’re angling a toe‑poke past a frantic goalkeeper, the next you’re timing a leap in an archery duel or baiting a rival tank onto a cliff. The physics are playful but consistent, so the difference between chaos and control is learning the rhythm and trusting your timing.\n\nWhat makes it sticky is the speed. Rounds last seconds, momentum swings fast, and that single well‑timed press can feel like a masterstroke when the crowd erupts. You don’t need to memorize systems or grind unlocks; the fun comes from reading each scenario and improvising under pressure. It’s the kind of game that turns a quiet evening into a tournament where \"best of five\" becomes \"best of twenty\" without anyone noticing—easy to start, hard to stop, and perfectly tuned for laughter, grudge matches, and tiny comebacks that feel huge.","Play 12 MiniBattles Pizza Edition unblocked in fullscreen. Master this arcade challenge. Free online game - no downloads required!","12 MiniBattles Pizza Edition, 12 MiniBattles Fullscreen, 12 MiniBattles unblocked, arcade games",9.1,31028,"Independent Developer",[54],"January 2023",{"slug":86,"title":87,"image":88,"categories":89,"format":45,"url":90,"content":91,"description":92,"keywords":93,"rating":94,"votes":95,"developer":52,"platform":96,"lastUpdated":84},"a-dance-of-fire-and-ice","A Dance of Fire and Ice","/media/a-dance-of-fire-and-ice.webp",[11],"https://23azostore.github.io/s8/a-dance-of-fire-and-ice/","A Dance of Fire and Ice is rhythm distilled: one button, perfect timing, and paths that turn music into motion. Two luminous orbs trace angles, gaps, and sudden switches, and your only job is to press exactly on the beat. There’s no generous buffer or off‑beat mercy—calibrate once, breathe, and trust the soundtrack as patterns grow from simple steps to layered syncopation.\n\nEach world introduces an idea and then tests your understanding with playful twists. A time signature change resets your count, a deceptive curve hides a double tap, a quiet bridge asks for focus more than speed. It’s challenging but fair, and when the press lands and the path flows without a stutter, there’s a singular satisfaction in the way sound and motion snap into one. For rhythm‑game devotees, it’s pure signal: clear rules, precise feedback, and the enduring thrill of mastery.","Experience A Dance of Fire and Ice Pizza Edition unblocked! Play fullscreen on PizaGame. Fun arcade action. Start playing now!","A Dance of Fire and Ice Pizza Edition, A Dance of Fire and Ice Fullscreen",9.4,30910,[54],{"slug":98,"title":99,"image":100,"categories":101,"format":45,"url":102,"content":103,"description":104,"keywords":105,"rating":106,"votes":107,"developer":52,"platform":108,"lastUpdated":109},"aqua-thrills","Aqua Thrills","/media/aqua-thrills.webp",[11,17],"https://23azostore.github.io/s2/aqua-thrills/","Aqua Thrills is a fast water‑slide racer about simple steering and good timing. You guide a tube down long, winding slides, adjust left and right to hold a line, and bump rivals when you need space. Races are short and forgiving at first, then add tighter curves, faster sections, and hazards that ask for cleaner inputs.\n\nProgress brings new parks, slides, and cosmetic unlocks. The controls stay straightforward, which makes it easy to jump in for a few runs and see improvement quickly. If you enjoy lightweight racing with clear feedback and quick restarts, it scratches that itch well without getting complicated.","Play Aqua Thrills unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Aqua Thrills Pizza Edition, Aqua Thrills Fullscreen, Aqua Thrills unblocked, arcade games",8.5,22681,[54],"March 2023",{"slug":111,"title":112,"image":113,"categories":114,"format":45,"url":115,"content":116,"description":117,"keywords":118,"rating":50,"votes":119,"developer":120,"platform":121,"lastUpdated":122},"battle-wheels","Battle Wheels","/media/battle-wheels.webp",[11,17],"https://htmlxm.github.io/h2/battle-wheels","Battle Wheels is a quick 1v1 arena bout where open‑top cars try to bonk each other on the head. You lurch forward and back to build rhythm, flip for height, and aim to land a clean hit that drains health. Between rounds, simple upgrades to health, damage, and wheels help your car feel sturdier or sharper, and a local two‑player mode turns it into a light, competitive party game. The physics do most of the work—small nudges set up flips, and flips set up roof drops—so the match becomes about timing rather than perfect driving lines. It’s fast, readable, and good for a few rounds at a time.","Play Battle Wheels unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Battle Wheels Pizza Edition, Battle Wheels Fullscreen, Battle Wheels unblocked, arcade games",21224,"Pizza Editione",[54],"June 2024",{"slug":124,"title":125,"image":126,"categories":127,"format":45,"url":128,"content":129,"description":130,"keywords":131,"rating":80,"votes":132,"developer":52,"platform":133,"lastUpdated":55},"big-shot-boxing","Big Shot Boxing","/media/big-shot-boxing.webp",[11,17],"https://23azostore.github.io/s2/big-shot-boxing/","Big Shot Boxing is a pared‑down boxing career that hinges on patient timing. Fights use a small set of inputs—jabs, crosses, uppercuts, and blocks—and the rhythm is about stamina, guard openings, and taking the simple shot when it’s there. Outside the ring you pick a trainer, build basic stats, and climb from early cards toward title bouts, with the sense that any match can swing if you lose focus. The pixel look fits the straightforward design, and the loop of train‑fight‑recover makes short sessions feel productive. If you like boxing without complex systems, this offers honest rounds where a few good reads decide the night.","Big Shot Boxing Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Big Shot Boxing Pizza Edition, Big Shot Boxing Fullscreen, Big Shot Boxing unblocked, arcade games",60113,[54],{"slug":135,"title":136,"image":137,"categories":138,"format":45,"url":139,"content":140,"description":141,"keywords":142,"rating":66,"votes":143,"developer":82,"platform":144,"lastUpdated":145},"blumgi-ball","Blumgi Ball","/media/blumgi-ball.webp",[35,23,17],"https://sudoku-online.github.io/a2/blumgi-ball/","Blumgi Ball blends basketball shots with simple puzzle layouts. You pull back to set power and angle, release to send the ball, and press to teleport next to it so you can chain throws from smarter positions. Levels introduce surfaces, gaps, and tricks that ask for one or two clean shots rather than brute force. As you clear stages, you unlock new characters and learn small habits—teleport before the bounce you want, aim lower when an obstacle steals arc, and keep attempts tight to avoid awkward ricochets. It’s compact, responsive, and satisfying when a planned sequence lands.","Play Blumgi Ball Pizza Edition unblocked in fullscreen. The best sports gameplay. Free online game - no downloads required!","Blumgi Ball Pizza Edition, Blumgi Ball Fullscreen, Blumgi Ball unblocked, sports games",44222,[54],"April 2023",{"slug":147,"title":148,"image":149,"categories":150,"format":45,"url":151,"content":152,"description":153,"keywords":154,"rating":155,"votes":156,"developer":157,"platform":158,"lastUpdated":70},"blumgi-castle","Blumgi Castle","/media/blumgi-castle.webp",[29,23,17],"https://23azostore.github.io/s2/blumgi-castle/","Blumgi Castle is a slingshot skill game about dropping enemies into the water with well‑placed shots and tools. You aim with an indicator, hold to set power, and release to fire bombs or special weapons that can carve platforms, push creatures off edges, or clear cover. There’s room to experiment—bigger blasts, saws, lasers, and other toys reward different approaches—and finishing a level cleanly often comes down to picking one good angle and sticking to it. Progress adds new characters and layouts while keeping controls simple.","Play Blumgi Castle unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Blumgi Castle Pizza Edition, Blumgi Castle Fullscreen, Blumgi Castle unblocked, puzzle games",8.4,29097,"Pizza Games Studio",[54],{"slug":160,"title":161,"image":162,"categories":163,"format":45,"url":164,"content":165,"description":166,"keywords":167,"rating":66,"votes":168,"developer":120,"platform":169,"lastUpdated":170},"blumgi-rocket","Blumgi Rocket","/media/blumgi-rocket.webp",[11,23,17],"https://webglmath.github.io/blumgi-rocket/","Blumgi Rocket is a side‑scrolling platformer built around a rocket‑boosted car. You hold for thrust, enjoy a short slow‑motion window during burns, and use stunts to keep pace through hills, tunnels, and tight gaps. Tracks hide shortcuts and safer lines, so a clean route often matters more than constant speed. New skins arrive as you clear levels, and the handling stays consistent enough that learning one car’s rhythm carries across the set.","Experience Blumgi Rocket Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting arcade game. Start playing now!","Blumgi Rocket Pizza Edition, Blumgi Rocket Fullscreen, Blumgi Rocket unblocked, arcade games",17640,[54],"September 2023",{"slug":172,"title":173,"image":174,"categories":175,"format":45,"url":176,"content":177,"description":178,"keywords":179,"rating":155,"votes":180,"developer":181,"platform":182,"lastUpdated":183},"blumgi-slime","Blumgi Slime","/media/blumgi-slime.webp",[11,23,17],"https://23azostore.github.io/s2/blumgi-slime","Blumgi Slime is a jump‑only platformer. Your character can’t walk, so you hold to charge, release to leap, and aim for clean arcs that land on safe ground or the checkered goal. Stages add new colors and obstacle types as you go, but the core stays readable: judge distance, pick a height, and commit. It’s a simple loop that feels good when you string jumps together without hesitation.","Blumgi Slime Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Blumgi Slime Pizza Edition, Blumgi Slime Fullscreen, Blumgi Slime unblocked, arcade games",13957,"Game Studio",[54],"November 2023",{"slug":185,"title":186,"image":187,"categories":188,"format":45,"url":189,"content":190,"description":191,"keywords":192,"rating":94,"votes":193,"developer":120,"platform":194,"lastUpdated":195},"boxing-physics-2","Boxing Physics 2","/media/boxing-physics-2.webp",[11,17],"https://23azostore.github.io/s2/boxing-physics-2/","Boxing Physics 2 turns boxing into a simple, ragdoll‑driven duel that’s more about timing than complicated inputs. Matches are short races to five points. You press a single key to punch, jump and lurch all at once, and the wobble of each fighter creates odd angles where a clean hit can land. Rounds change the setup so you’re not always fighting on the same surface, and learning to wait for balance before throwing is the difference between whiffing and scoring. A good approach is to hold a little distance, watch for your opponent to lean forward or lose footing, then tap at that exact moment. If a power‑up appears, use it to extend reach or finish a round from safety. The best wins come from calm reads rather than button mashing, and once you catch the rhythm, comebacks happen fast.","Experience Boxing Physics 2 Pizza Edition unblocked! Play fullscreen on PizaGame. Fun arcade action. Start playing now!","Boxing Physics 2 Pizza Edition, Boxing Physics 2 Fullscreen, Boxing Physics 2 unblocked",14571,[54],"May 2024",{"slug":197,"title":198,"image":199,"categories":200,"format":45,"url":201,"content":202,"description":203,"keywords":204,"rating":106,"votes":205,"developer":52,"platform":206,"lastUpdated":207},"boxing-random","Boxing Random","/media/boxing-random.webp",[11,17],"https://23azostore.github.io/s77/boxing-random/","Boxing Random is a one‑button boxing game built on ragdoll movement and changing conditions. Every round shifts something—the footing, outfits, even little twists to how a punch connects—so you adapt as you go and try to be first to five points. Controls stay simple; the challenge is timing. Keep your boxer balanced, wait for the opponent to tilt into range, and press when their guard drops or they overextend. If a rocket punch or special round shows up, use the extra reach but don’t chase wildly, because falling out of rhythm usually costs the point. With a friend beside you it’s easy to trade wins for a long stretch, and most matches are decided by a couple of well‑timed taps.","Boxing Random Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Boxing Random Pizza Edition, Boxing Random Fullscreen, Boxing Random unblocked, arcade games",57106,[54],"May 2023",1766842019391]