[{"data":1,"prerenderedAt":211},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-jumping-shell":40,"similar-jumping-shell":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"puzzle","Puzzle",{"slug":20,"name":21},"shooting","Shooting",{"slug":23,"name":24},"sports","Sports",{"slug":26,"name":27},"strategy","Strategy",{"slug":29,"name":30},"multiplayer","Multiplayer",{"slug":32,"name":33},"new","New",{"slug":35,"name":36},"popular","Popular",{"slug":38,"name":39},"originals","Originals",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"jumping-shell","Jumping Shell","/media/jumping-shell.webp",[17],"html5","https://htmlxm.github.io/h5/jumping-shell","Jumping Shell is a puzzle-platformer where you control a character that can jump out of its shell. Use this unique ability to double jump, squeeze through tight spaces, and solve intricate puzzles.\n\nThe game features challenging levels that require logical thinking and precise timing. Master the mechanics of shelling and unshelling to reach the exit in this clever and engaging game.","Experience Jumping Shell Pizza Edition unblocked! Play fullscreen on PizaGame. The best puzzle gameplay. Start playing now!","Jumping Shell Pizza Edition, Jumping Shell Fullscreen, Jumping Shell unblocked, puzzle games",8.9,21812,"Pizza Dev Team",[54],"Desktop Web","March 2023",[57,71,85,97,110,124,136,149,161,172,186,199],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":68,"platform":69,"lastUpdated":70},"brain-test-tricky-puzzles","Brain Test Tricky Puzzles","/media/brain-test-tricky-puzzles.webp",[17,35,32],"https://23azostore.github.io/s2/brain-test-tricky-puzzles/","Brain Test: Tricky Puzzles is a collection of short, lateral‑thinking riddles where the obvious answer is rarely correct. You interact with the scene directly—drag items, combine them, move text, or reveal things hidden off screen—to find the trick that solves the level. The draw is the steady stream of small “aha” moments and the way even simple prompts hide playful solutions. If you’re stuck, read the question carefully, try manipulating the background, and consider whether the answer comes from an object you create rather than one already shown. It’s light, fast, and designed for quick sessions that feel satisfying when a stubborn level finally gives way.","Brain Test Tricky Puzzles Pizza Edition: Play unblocked fullscreen. Enjoy this top puzzle game without downloads.","Brain Test Tricky Puzzles Pizza Edition, Brain Test Tricky Puzzles Fullscreen",8.4,65174,"Pizza Editione",[54],"June 2024",{"slug":72,"title":73,"image":74,"categories":75,"format":45,"url":76,"content":77,"description":78,"keywords":79,"rating":80,"votes":81,"developer":82,"platform":83,"lastUpdated":84},"arithmetica","Arithmetica","/media/arithmetica.webp",[17],"https://23azostore.github.io/s2/arithmetica/","Arithmetica is a one‑minute sprint of mental math. Equations appear quickly and you tap the correct answer; each fast, correct response adds a sliver of time, and misses waste precious seconds. It’s simple to start and ramps up as your pace increases.\n\nPlayed daily, it’s a tidy way to sharpen arithmetic in short sessions. The loop is honest—speed comes from accuracy—and the timer makes even basic problems feel engaging when you’re chasing a personal best.","Play Arithmetica unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Arithmetica Pizza Edition, Arithmetica Fullscreen, Arithmetica unblocked, puzzle games",9,39465,"Pizza Games Studio",[54],"November 2023",{"slug":86,"title":87,"image":88,"categories":89,"format":45,"url":90,"content":91,"description":92,"keywords":93,"rating":66,"votes":94,"developer":82,"platform":95,"lastUpdated":96},"blumgi-castle","Blumgi Castle","/media/blumgi-castle.webp",[17,38,29],"https://23azostore.github.io/s2/blumgi-castle/","Blumgi Castle is a slingshot skill game about dropping enemies into the water with well‑placed shots and tools. You aim with an indicator, hold to set power, and release to fire bombs or special weapons that can carve platforms, push creatures off edges, or clear cover. There’s room to experiment—bigger blasts, saws, lasers, and other toys reward different approaches—and finishing a level cleanly often comes down to picking one good angle and sticking to it. Progress adds new characters and layouts while keeping controls simple.","Play Blumgi Castle unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Blumgi Castle Pizza Edition, Blumgi Castle Fullscreen, Blumgi Castle unblocked, puzzle games",29097,[54],"July 2024",{"slug":98,"title":99,"image":100,"categories":101,"format":45,"url":102,"content":103,"description":104,"keywords":105,"rating":106,"votes":107,"developer":68,"platform":108,"lastUpdated":109},"hextris","Hextris","/media/hextris.webp",[17],"https://23azostore.github.io/s7/hextris/","Hextris is a fast‑paced puzzle game inspired by Tetris but played on a hexagon. Colored blocks fall from the edges toward the center, and you rotate the hexagon to catch them. Match three or more of the same color to clear them before they stack up and reach the outer limit.\n\nMoment to moment you’re spinning the board left and right, trying to manage incoming blocks from all six sides. The speed increases as you play, forcing you to think faster and prioritize which side needs attention. It’s a hypnotic test of reflexes and pattern recognition that’s hard to put down once you find your rhythm.","Play Hextris unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Hextris Pizza Edition, Hextris Fullscreen, Hextris unblocked, puzzle games, play Hextris",8.5,9410,[54],"August 2024",{"slug":111,"title":112,"image":113,"categories":114,"format":45,"url":115,"content":116,"description":117,"keywords":118,"rating":119,"votes":120,"developer":121,"platform":122,"lastUpdated":123},"impossible-tic-tac-toe","Impossible Tic Tac Toe","/media/impossible-tic-tac-toe.webp",[17],"https://23azostore.github.io/s7/impossible-tic-tac-toe/","Impossible Tic Tac Toe takes the classic pen-and-paper game and ramps up the difficulty to an extreme level. You’ll face off against an AI that anticipates your every move and rarely makes mistakes. It’s a test of strategy and patience as you try to outsmart a computer designed to be unbeatable.\n\nThe game is simple in concept but incredibly challenging to master. If you think you’re a Tic Tac Toe pro, this version will humble you quickly. Can you find a way to break the stalemate and claim victory?","Play Impossible Tic Tac Toe Pizza Edition unblocked in fullscreen. The best puzzle gameplay. Free online game - no downloads required!","Impossible Tic Tac Toe Pizza Edition, Impossible Tic Tac Toe Fullscreen",9.2,17952,"Independent Developer",[54],"October 2023",{"slug":125,"title":126,"image":127,"categories":128,"format":45,"url":129,"content":130,"description":131,"keywords":132,"rating":80,"votes":133,"developer":121,"platform":134,"lastUpdated":135},"maze-path-of-light","Maze Path of Light","/media/maze-path-of-light.webp",[17],"https://23azostore.github.io/s5/maze-path-of-light/","Maze Path of Light is a relaxing puzzle game where you guide a beam of light through intricate mazes. Rotate mirrors and objects to direct the light to the exit and illuminate the path.\n\nThe game features beautiful visuals and soothing music. Challenge your mind with increasingly complex puzzles and find the solution to light up the darkness.","Play Maze Path of Light unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Maze Path of Light Pizza Edition, Maze Path of Light Fullscreen, Maze Path of Light unblocked",24322,[54],"May 2024",{"slug":137,"title":138,"image":139,"categories":140,"format":45,"url":141,"content":142,"description":143,"keywords":144,"rating":145,"votes":146,"developer":147,"platform":148,"lastUpdated":135},"mosaic-puzzle-art","Mosaic Puzzle Art","/media/mosaic-puzzle-art.webp",[17],"https://htmlxm.github.io/h5/mosaic-puzzle-art","Mosaic Puzzle Art is a creative puzzle game where you paint by numbers to reveal beautiful pixel art images. Follow the guide and color the grid to create stunning mosaics.\n\nThe game is relaxing and satisfying, perfect for unwinding after a long day. With hundreds of levels and a variety of themes, Mosaic Puzzle Art offers endless hours of artistic fun.","Play Mosaic Puzzle Art Pizza Edition unblocked in fullscreen. Fun puzzle action. Free online game - no downloads required!","Mosaic Puzzle Art Pizza Edition, Mosaic Puzzle Art Fullscreen, Mosaic Puzzle Art unblocked",9.3,15182,"Pizza Edition",[54],{"slug":150,"title":151,"image":152,"categories":153,"format":45,"url":154,"content":155,"description":156,"keywords":157,"rating":80,"votes":158,"developer":147,"platform":159,"lastUpdated":160},"roly-poly-monsters","Roly-Poly Monsters","/media/roly-poly-monsters.webp",[14,17],"https://23azostore.github.io/s6/roly-poly-monsters/","Roly-Poly Monsters is a gruesome but fun physics puzzle game where your goal is to eliminate all the monsters on the screen. Tap to cut chains, trigger explosions, and use environmental objects to crush, slice, or blow up the monsters.\n\nThe game features increasingly difficult levels that require logical thinking and precise timing. With its dark humor and satisfying gameplay, Roly-Poly Monsters is a blast to play.","Roly-Poly Monsters Pizza Edition: Play unblocked fullscreen. Enjoy this top driving game without downloads.","Roly-Poly Monsters Pizza Edition, Roly-Poly Monsters Fullscreen, Roly-Poly Monsters unblocked",37489,[54],"July 2023",{"slug":162,"title":163,"image":164,"categories":165,"format":45,"url":166,"content":167,"description":168,"keywords":169,"rating":80,"votes":170,"developer":68,"platform":171,"lastUpdated":160},"solitaire","Solitaire","/media/solitaire.webp",[17],"https://23azostore.github.io/s7/solitaire/","Solitaire is the classic card game that has entertained players for generations. Arrange the cards in descending order and alternating colors to clear the tableau and stack them by suit in the foundations.\n\nThe game features a clean interface and smooth animations. Whether you're a beginner or a seasoned pro, Solitaire offers a relaxing and challenging way to pass the time.","Solitaire Pizza Edition: Play unblocked fullscreen. Enjoy this top puzzle game without downloads.","Solitaire Pizza Edition, Solitaire Fullscreen, Solitaire unblocked, puzzle games, play Solitaire",48809,[54],{"slug":173,"title":174,"image":175,"categories":176,"format":45,"url":177,"content":178,"description":179,"keywords":180,"rating":181,"votes":182,"developer":183,"platform":184,"lastUpdated":185},"stack","Stack","/media/stack.webp",[17],"https://23azostore.github.io/s2/stack/","Stack is a simple yet addictive arcade game where you build a tower of blocks as high as possible. Tap to place the moving blocks on top of each other, but be careful—any overhang will be sliced off.\n\nThe game tests your precision and timing as the tower gets taller and the blocks get smaller. Compete for the highest score and see how many blocks you can stack.","Play Stack unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Stack Pizza Edition, Stack Fullscreen, Stack unblocked, puzzle games, play Stack",8.6,39069,"Game Studio",[54],"September 2024",{"slug":187,"title":188,"image":189,"categories":190,"format":45,"url":191,"content":192,"description":193,"keywords":194,"rating":195,"votes":196,"developer":68,"platform":197,"lastUpdated":198},"stack-ball","Stack Ball","/media/stack-ball.webp",[11,17],"https://htmlxm.github.io/h9/stack-ball","Stack Ball is a 3D arcade game where you smash through revolving platforms to reach the bottom. Hold to smash through the colored blocks, but avoid the black ones or your ball will shatter.\n\nThe game features satisfying destruction physics and hundreds of levels. It’s a fun and fast-paced game that is easy to play but hard to master.","Stack Ball Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Stack Ball Pizza Edition, Stack Ball Fullscreen, Stack Ball unblocked, arcade games, play Stack Ball",9.7,65763,[54],"March 2024",{"slug":200,"title":201,"image":202,"categories":203,"format":45,"url":204,"content":205,"description":206,"keywords":207,"rating":208,"votes":209,"developer":68,"platform":210,"lastUpdated":135},"stack-bump-3d","Stack Bump 3D","/media/stack-bump-3d.webp",[11,17,32],"https://23azostore.github.io/s9/stack-bump-3d/","Stack Bump 3D is a casual arcade game where you control a ball and smash through stacks of blocks. Avoid the obstacles and reach the bottom of the tower to complete the level.\n\nThe game features colorful graphics and simple controls. With its relaxing gameplay and satisfying mechanics, Stack Bump 3D is the perfect game to unwind with.","Stack Bump 3D Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Stack Bump 3D Pizza Edition, Stack Bump 3D Fullscreen, Stack Bump 3D unblocked, arcade games",8.7,51516,[54],1766420204675]