[{"data":1,"prerenderedAt":212},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-worlds-hardest-game-2":40,"similar-worlds-hardest-game-2":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"worlds-hardest-game-2","World's Hardest Game 2","/media/worlds-hardest-game-2.webp",[29,23],"html5","https://23azostore.github.io/s/worlds-hardest-game-2/","World's Hardest Game 2 lives up to its name by offering an even tougher challenge than the original. Guide the red square through a maze of moving blue circles and other deadly obstacles.\n\nThe game features 50 new levels that require pixel-perfect precision and split-second timing. It's a test of patience and skill. Can you complete all the levels without losing your mind?","Play World's Hardest Game 2 Pizza Edition unblocked in fullscreen. Master this puzzle challenge. Free online game - no downloads required!","World's Hardest Game 2 Pizza Edition, World's Hardest Game 2 Fullscreen",9.6,32275,"Pizza Editione",[54],"Desktop Web","December 2024",[57,70,84,98,110,122,134,148,160,172,185,198],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":52,"platform":68,"lastUpdated":69},"brain-test-tricky-puzzles","Brain Test Tricky Puzzles","/media/brain-test-tricky-puzzles.webp",[29,26,20],"https://23azostore.github.io/s2/brain-test-tricky-puzzles/","Brain Test: Tricky Puzzles is a collection of short, lateral‑thinking riddles where the obvious answer is rarely correct. You interact with the scene directly—drag items, combine them, move text, or reveal things hidden off screen—to find the trick that solves the level. The draw is the steady stream of small “aha” moments and the way even simple prompts hide playful solutions. If you’re stuck, read the question carefully, try manipulating the background, and consider whether the answer comes from an object you create rather than one already shown. It’s light, fast, and designed for quick sessions that feel satisfying when a stubborn level finally gives way.","Brain Test Tricky Puzzles Pizza Edition: Play unblocked fullscreen. Enjoy this top puzzle game without downloads.","Brain Test Tricky Puzzles Pizza Edition, Brain Test Tricky Puzzles Fullscreen",8.4,65174,[54],"June 2024",{"slug":71,"title":72,"image":73,"categories":74,"format":45,"url":75,"content":76,"description":77,"keywords":78,"rating":79,"votes":80,"developer":81,"platform":82,"lastUpdated":83},"arithmetica","Arithmetica","/media/arithmetica.webp",[29],"https://23azostore.github.io/s2/arithmetica/","Arithmetica is a one‑minute sprint of mental math. Equations appear quickly and you tap the correct answer; each fast, correct response adds a sliver of time, and misses waste precious seconds. It’s simple to start and ramps up as your pace increases.\n\nPlayed daily, it’s a tidy way to sharpen arithmetic in short sessions. The loop is honest—speed comes from accuracy—and the timer makes even basic problems feel engaging when you’re chasing a personal best.","Play Arithmetica unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Arithmetica Pizza Edition, Arithmetica Fullscreen, Arithmetica unblocked, puzzle games",9,39465,"Pizza Games Studio",[54],"November 2023",{"slug":85,"title":86,"image":87,"categories":88,"format":45,"url":89,"content":90,"description":91,"keywords":92,"rating":93,"votes":94,"developer":95,"platform":96,"lastUpdated":97},"blumgi-ball","Blumgi Ball","/media/blumgi-ball.webp",[35,23,17],"https://sudoku-online.github.io/a2/blumgi-ball/","Blumgi Ball blends basketball shots with simple puzzle layouts. You pull back to set power and angle, release to send the ball, and press to teleport next to it so you can chain throws from smarter positions. Levels introduce surfaces, gaps, and tricks that ask for one or two clean shots rather than brute force. As you clear stages, you unlock new characters and learn small habits—teleport before the bounce you want, aim lower when an obstacle steals arc, and keep attempts tight to avoid awkward ricochets. It’s compact, responsive, and satisfying when a planned sequence lands.","Play Blumgi Ball Pizza Edition unblocked in fullscreen. The best sports gameplay. Free online game - no downloads required!","Blumgi Ball Pizza Edition, Blumgi Ball Fullscreen, Blumgi Ball unblocked, sports games",9.5,44222,"Independent Developer",[54],"April 2023",{"slug":99,"title":100,"image":101,"categories":102,"format":45,"url":103,"content":104,"description":105,"keywords":106,"rating":66,"votes":107,"developer":81,"platform":108,"lastUpdated":109},"blumgi-castle","Blumgi Castle","/media/blumgi-castle.webp",[29,23,17],"https://23azostore.github.io/s2/blumgi-castle/","Blumgi Castle is a slingshot skill game about dropping enemies into the water with well‑placed shots and tools. You aim with an indicator, hold to set power, and release to fire bombs or special weapons that can carve platforms, push creatures off edges, or clear cover. There’s room to experiment—bigger blasts, saws, lasers, and other toys reward different approaches—and finishing a level cleanly often comes down to picking one good angle and sticking to it. Progress adds new characters and layouts while keeping controls simple.","Play Blumgi Castle unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Blumgi Castle Pizza Edition, Blumgi Castle Fullscreen, Blumgi Castle unblocked, puzzle games",29097,[54],"July 2024",{"slug":111,"title":112,"image":113,"categories":114,"format":45,"url":115,"content":116,"description":117,"keywords":118,"rating":93,"votes":119,"developer":52,"platform":120,"lastUpdated":121},"blumgi-rocket","Blumgi Rocket","/media/blumgi-rocket.webp",[11,23,17],"https://webglmath.github.io/blumgi-rocket/","Blumgi Rocket is a side‑scrolling platformer built around a rocket‑boosted car. You hold for thrust, enjoy a short slow‑motion window during burns, and use stunts to keep pace through hills, tunnels, and tight gaps. Tracks hide shortcuts and safer lines, so a clean route often matters more than constant speed. New skins arrive as you clear levels, and the handling stays consistent enough that learning one car’s rhythm carries across the set.","Experience Blumgi Rocket Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting arcade game. Start playing now!","Blumgi Rocket Pizza Edition, Blumgi Rocket Fullscreen, Blumgi Rocket unblocked, arcade games",17640,[54],"September 2023",{"slug":123,"title":124,"image":125,"categories":126,"format":45,"url":127,"content":128,"description":129,"keywords":130,"rating":66,"votes":131,"developer":132,"platform":133,"lastUpdated":83},"blumgi-slime","Blumgi Slime","/media/blumgi-slime.webp",[11,23,17],"https://23azostore.github.io/s2/blumgi-slime","Blumgi Slime is a jump‑only platformer. Your character can’t walk, so you hold to charge, release to leap, and aim for clean arcs that land on safe ground or the checkered goal. Stages add new colors and obstacle types as you go, but the core stays readable: judge distance, pick a height, and commit. It’s a simple loop that feels good when you string jumps together without hesitation.","Blumgi Slime Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Blumgi Slime Pizza Edition, Blumgi Slime Fullscreen, Blumgi Slime unblocked, arcade games",13957,"Game Studio",[54],{"slug":135,"title":136,"image":137,"categories":138,"format":45,"url":139,"content":140,"description":141,"keywords":142,"rating":143,"votes":144,"developer":145,"platform":146,"lastUpdated":147},"color-switch","Color Switch","/media/color-switch.webp",[11,23],"https://23azostore.github.io/s8/color-switch/","Color Switch is a tap‑to‑rise game where you pass a bouncing ball through moving shapes only when colors match. Obstacles rotate and shift, forcing you to hold a steady rhythm and wait for a safe opening. It’s clear and readable, and the quick restart makes it easy to turn a small mistake into another attempt without friction.\n\nMoment to moment you’re deciding whether to risk a pass early or let the pattern cycle once more. Pace picks up as layouts demand consecutive clean taps, and patience often beats rushing. The appeal is in the simplicity: one input, reliable rules, and obstacles that always teach you something about timing. It’s a focused, satisfying challenge that shows improvement in minutes.","Play Color Switch Pizza Edition unblocked in fullscreen. Enjoy this exciting arcade game. Free online game - no downloads required!","Color Switch Pizza Edition, Color Switch Fullscreen, Color Switch unblocked, arcade games",9.3,11839,"Pizza Edition",[54],"May 2023",{"slug":149,"title":150,"image":151,"categories":152,"format":45,"url":153,"content":154,"description":155,"keywords":156,"rating":50,"votes":157,"developer":145,"platform":158,"lastUpdated":159},"crossy-road","Crossy Road","/media/crossy-road.webp",[11,23],"https://ubg98.github.io/CrossyRoad/","Crossy Road is a hop‑forward arcade game about looking, waiting, and moving at the right moment. Traffic and rivers form shifting patterns: cars pace in lanes, logs glide at different speeds, and trains cut through on a strict schedule. You dart across when a window opens, pause when it closes, and learn to avoid risky moves that lead to stranded hops.\n\nMoment to moment you’re scanning a few steps ahead and trusting small timings—a quick double hop, a hold to let a lane clear, a step back to avoid a bad sequence. The pace is gentle at first and grows as you survive longer, and the satisfaction comes from making clean, sensible choices. It’s easy to start and tough to master, with runs that tell short stories of near misses and tidy escapes.","Crossy Road Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Crossy Road Pizza Edition, Crossy Road Fullscreen, Crossy Road unblocked, arcade games",32299,[54],"February 2023",{"slug":161,"title":162,"image":163,"categories":164,"format":45,"url":165,"content":166,"description":167,"keywords":168,"rating":50,"votes":169,"developer":145,"platform":170,"lastUpdated":171},"doodle-jump","Doodle Jump","/media/doodle-jump.webp",[11,23],"https://23azostore.github.io/s7/doodle-jump/","Doodle Jump is a vertical climb where survival comes from steady timing and small, confident moves. Platforms slide and shift, gaps appear without warning, and hazards punish jumps made a fraction too early. You steer left and right, commit to a route, and learn to favor safe landings over risky leaps that save a second and cost a run.\n\nMoment to moment, it’s about reading what’s two steps ahead: a moving platform that needs a patient approach, a fragile one that buys height but won’t hold twice, a hazard you clear by trusting your jump arc. The rhythm is brisk—quick restarts, visible improvement—and scores rise when you stop chasing miracles and string together clean decisions. It’s straightforward, honest platforming that rewards calm execution.","Play Doodle Jump unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Doodle Jump Pizza Edition, Doodle Jump Fullscreen, Doodle Jump unblocked, arcade games",10962,[54],"November 2024",{"slug":173,"title":174,"image":175,"categories":176,"format":45,"url":177,"content":178,"description":179,"keywords":180,"rating":181,"votes":182,"developer":52,"platform":183,"lastUpdated":184},"hextris","Hextris","/media/hextris.webp",[29],"https://23azostore.github.io/s7/hextris/","Hextris is a fast‑paced puzzle game inspired by Tetris but played on a hexagon. Colored blocks fall from the edges toward the center, and you rotate the hexagon to catch them. Match three or more of the same color to clear them before they stack up and reach the outer limit.\n\nMoment to moment you’re spinning the board left and right, trying to manage incoming blocks from all six sides. The speed increases as you play, forcing you to think faster and prioritize which side needs attention. It’s a hypnotic test of reflexes and pattern recognition that’s hard to put down once you find your rhythm.","Play Hextris unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Hextris Pizza Edition, Hextris Fullscreen, Hextris unblocked, puzzle games, play Hextris",8.5,9410,[54],"August 2024",{"slug":186,"title":187,"image":188,"categories":189,"format":45,"url":190,"content":191,"description":192,"keywords":193,"rating":194,"votes":195,"developer":95,"platform":196,"lastUpdated":197},"impossible-tic-tac-toe","Impossible Tic Tac Toe","/media/impossible-tic-tac-toe.webp",[29],"https://23azostore.github.io/s7/impossible-tic-tac-toe/","Impossible Tic Tac Toe takes the classic pen-and-paper game and ramps up the difficulty to an extreme level. You’ll face off against an AI that anticipates your every move and rarely makes mistakes. It’s a test of strategy and patience as you try to outsmart a computer designed to be unbeatable.\n\nThe game is simple in concept but incredibly challenging to master. If you think you’re a Tic Tac Toe pro, this version will humble you quickly. Can you find a way to break the stalemate and claim victory?","Play Impossible Tic Tac Toe Pizza Edition unblocked in fullscreen. The best puzzle gameplay. Free online game - no downloads required!","Impossible Tic Tac Toe Pizza Edition, Impossible Tic Tac Toe Fullscreen",9.2,17952,[54],"October 2023",{"slug":199,"title":200,"image":201,"categories":202,"format":45,"url":203,"content":204,"description":205,"keywords":206,"rating":207,"votes":208,"developer":209,"platform":210,"lastUpdated":211},"jumping-shell","Jumping Shell","/media/jumping-shell.webp",[29],"https://htmlxm.github.io/h5/jumping-shell","Jumping Shell is a puzzle-platformer where you control a character that can jump out of its shell. Use this unique ability to double jump, squeeze through tight spaces, and solve intricate puzzles.\n\nThe game features challenging levels that require logical thinking and precise timing. Master the mechanics of shelling and unshelling to reach the exit in this clever and engaging game.","Experience Jumping Shell Pizza Edition unblocked! Play fullscreen on PizaGame. The best puzzle gameplay. Start playing now!","Jumping Shell Pizza Edition, Jumping Shell Fullscreen, Jumping Shell unblocked, puzzle games",8.9,21812,"Pizza Dev Team",[54],"March 2023",1766648316898]