[{"data":1,"prerenderedAt":214},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-swatforce-vs-terrorists":40,"similar-swatforce-vs-terrorists":57},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"keybindings":52,"developer":53,"platform":54,"lastUpdated":56},"swatforce-vs-terrorists","Swatforce vs Terrorists","/media/swatforce-vs-terrorists.webp",[32,5,20],"html5","https://htmlxm.github.io/h3/swatforce-vs-terrorists","Prepare for high-intensity tactical combat in Swatforce vs Terrorists, an action-packed shooter where you lead an elite SWAT team against global threats. The game features over 40 challenging missions that require a mix of fast reflexes and strategic planning. You can unlock and upgrade a massive arsenal of 60 different weapons, ranging from tactical pistols and assault rifles to heavy-duty flamethrowers and defensive turrets. Each level demands a different approach—whether it's holding a defensive line or clearing out enemy strongholds. It's a gritty, engaging experience for fans of military-themed action games.","Swatforce vs Terrorists : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Swatforce vs Terrorists Pizza Edition, Swatforce vs Terrorists Fullscreen, Swatforce vs Terrorists unblocked, arcade games",9.4,31503,"Aim and Shoot: Mouse Left Click\nReload: R\nSwitch Weapons: Number Keys 1-5\nSpecial Action: Space","Playtouch",[55],"Desktop Web","April 2024",[58,71,85,99,112,125,138,151,163,174,186,200],{"slug":59,"title":60,"image":61,"categories":62,"format":45,"url":63,"content":64,"description":65,"keywords":66,"rating":67,"votes":68,"developer":69,"platform":70,"lastUpdated":56},"drive-mad","Drive Mad","/media/drive-mad.webp",[14,26,20],"https://lnahtml.github.io/a77/drive-mad/","Drive Mad is a compact physics‑based drive across uneven tracks where keeping the vehicle upright is the whole game. Bridges wobble, platforms tilt, and small jumps punish heavy landings. You feather the throttle, tap the brake to settle, and accept that patience solves more problems than speed.\n\nMoment to moment you’re managing weight: lean in before a ramp, lift to avoid a nose‑down crash, and correct mid‑air without oversteering. Levels escalate cleanly, and the best clears feel like tidy puzzles solved by good pacing. It’s playful, readable, and built for quick wins that stack up.","Experience Drive Mad Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting driving game. Start playing now!","Drive Mad Pizza Edition, Drive Mad Fullscreen, Drive Mad unblocked, driving games, play Drive Mad",9.6,27092,"Independent Developer",[55],{"slug":72,"title":73,"image":74,"categories":75,"format":45,"url":76,"content":77,"description":78,"keywords":79,"rating":80,"votes":81,"developer":82,"platform":83,"lastUpdated":84},"geometry-dash","Geometry Dash","/media/geometry-dash.webp",[11,26,20],"https://23azostore.github.io/s8/geometry-dash/","Geometry Dash is a rhythm-based platformer that will test your patience and skills. Jump and fly your way through danger in this rhythm-based action platformer!\n\nThe game features simple one-touch game play with many levels that will keep you entertained for hours. Use practice mode to sharpen your skills and unlock new icons and colors to customize your character.","Play Geometry Dash unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Geometry Dash Pizza Edition, Geometry Dash Fullscreen, Geometry Dash unblocked, arcade games",9.5,47094,"Pizza Dev Team",[55],"July 2024",{"slug":86,"title":87,"image":88,"categories":89,"format":45,"url":90,"content":91,"description":92,"keywords":93,"rating":94,"votes":95,"developer":96,"platform":97,"lastUpdated":98},"brain-test-tricky-puzzles","Brain Test Tricky Puzzles","/media/brain-test-tricky-puzzles.webp",[29,26,20],"https://23azostore.github.io/s2/brain-test-tricky-puzzles/","Brain Test: Tricky Puzzles is a collection of short, lateral‑thinking riddles where the obvious answer is rarely correct. You interact with the scene directly—drag items, combine them, move text, or reveal things hidden off screen—to find the trick that solves the level. The draw is the steady stream of small “aha” moments and the way even simple prompts hide playful solutions. If you’re stuck, read the question carefully, try manipulating the background, and consider whether the answer comes from an object you create rather than one already shown. It’s light, fast, and designed for quick sessions that feel satisfying when a stubborn level finally gives way.","Brain Test Tricky Puzzles Pizza Edition: Play unblocked fullscreen. Enjoy this top puzzle game without downloads.","Brain Test Tricky Puzzles Pizza Edition, Brain Test Tricky Puzzles Fullscreen",8.4,65174,"Pizza Editione",[55],"June 2024",{"slug":100,"title":101,"image":102,"categories":103,"format":45,"url":104,"content":105,"description":106,"keywords":107,"rating":108,"votes":109,"developer":96,"platform":110,"lastUpdated":111},"4th-and-goal-2022","4th and Goal 2022","/media/4th-and-goal-2022.webp",[35,20,17],"https://23azostore.github.io/s2/4th-and-goal-2022/","4th and Goal 2022 distills American football into brisk drives and meaningful decisions. The playbook is compact but expressive: inside runs to set a rhythm, option looks that punish over‑pursuit, and timing routes that reward a calm read when a safety bites. On defense, a well‑chosen blitz can flip a possession, while disciplined coverage squeezes windows until a hurried throw invites a takeaway.\n\nModes range from quick games to deeper playoff runs, and the tone stays consistent—intuitive controls, short possessions, and enough tactical space that smart play‑calling tells. Drives hinge on small choices: take the yards and bleed the clock, or push for a dagger before the half; pin them deep with field position, or gamble on fourth down when momentum is yours. Red‑zone snaps carry that familiar knot in the stomach, and touchdowns feel earned rather than scripted. It’s football trimmed to essentials, lively and readable, where a season’s story is written in a handful of clutch plays.","Play 4th and Goal 2022 unblocked: Pizza Edition in full screen. A great sports game to play free online.","4th and Goal 2022 Pizza Edition, 4th and Goal 2022 Fullscreen, 4th and Goal 2022 unblocked",9.2,19856,[55],"April 2023",{"slug":113,"title":114,"image":115,"categories":116,"format":45,"url":117,"content":118,"description":119,"keywords":120,"rating":121,"votes":122,"developer":82,"platform":123,"lastUpdated":124},"burrito-bison","Burrito Bison","/media/burrito-bison.webp",[5],"https://23azostore.github.io/s7/burrito-bison/","Burrito Bison is a launch‑and‑bounce game where distance comes from smart timing and messy collisions. Each run begins with a powerful throw, then you keep speed by slamming into gummy opponents and chaining hits without dropping momentum. Obstacles, gates, and brief slowdowns force you to read the road and decide when to use a heavy slam or save a boost for a cleaner section ahead.\n\nThe loop is short and satisfying: push a little farther, earn currency, and invest in upgrades that make the next attempt more stable. Moment to moment you’re watching arcs, nudging the angle to catch a high‑value target, and choosing whether to burn a special ability to rescue a sagging run. The challenge is consistency rather than perfection, and small improvements add up until long, flowing chains become normal.\n\nIt’s bright and playful, but it rewards attention. Runs feel better when you manage pacing—holding off on a slam to keep a combo alive, or spending at the right time to break through a barrier. Progression isn’t only about raw power; it’s learning to spot good lines and avoiding stalls that kill speed. That mix keeps retries engaging, turning a minute into a series of fun, measurable gains.","Play Burrito Bison unblocked: Pizza Edition in full screen. A great action game to play free online.","Burrito Bison Pizza Edition, Burrito Bison Fullscreen, Burrito Bison unblocked, action games",9,57929,[55],"November 2024",{"slug":126,"title":127,"image":128,"categories":129,"format":45,"url":130,"content":131,"description":132,"keywords":133,"rating":134,"votes":135,"developer":82,"platform":136,"lastUpdated":137},"cannon-strike","Cannon Strike","/media/cannon-strike.webp",[32],"https://htmlxm.github.io/h2/cannon-strike","Cannon Strike is a physics puzzle about firing pellets into a container while the path changes around you. You set angle and timing from a fixed cannon, then watch pellets bounce off surfaces, slip through rotating bars, and settle—if you judged correctly—where you need them. Early levels are forgiving, but later layouts ask for tighter shots and a better sense of how motion will carry after a bounce.\n\nMoment to moment you’re deciding whether to shoot now or wait for a safer alignment. The game respects patience; a clean release is usually better than brute force. Limited ammo or stricter thresholds show up as you progress, which encourages smarter planning rather than rushing. It’s the kind of puzzle where each success feels earned, and small adjustments lead to reliable solutions without trial‑and‑error grind.","Experience Cannon Strike Pizza Edition unblocked! Play fullscreen on PizaGame. Master this shooting challenge. Start playing now!","Cannon Strike Pizza Edition, Cannon Strike Fullscreen, Cannon Strike unblocked, shooting games",8.6,32373,[55],"December 2023",{"slug":139,"title":140,"image":141,"categories":142,"format":45,"url":143,"content":144,"description":145,"keywords":146,"rating":147,"votes":148,"developer":69,"platform":149,"lastUpdated":150},"dreadhead-parkour","Dreadhead Parkour","/media/dreadhead-parkour.webp",[5],"https://htmlxm.github.io/h7/dreadhead-parkour","Dreadhead Parkour is a 2D run built around simple inputs and sharp obstacles. You jump, slide, and adjust in midair to thread gaps, bounce off platforms, and avoid hazards that punish sloppy timing. Levels are short and restart instantly, which puts the focus on learning patterns and carrying clean movement from one challenge to the next.\n\nMoment to moment you’re committing early—jump now to catch the apex—or waiting a beat to let a threat pass. Progress comes from rhythm more than speed, and the satisfaction lives in a perfect section that used to look impossible. It’s approachable, quick, and tuned for those small got it moments.","Experience Dreadhead Parkour Pizza Edition unblocked! Play fullscreen on PizaGame. The best action gameplay. Start playing now!","Dreadhead Parkour Pizza Edition, Dreadhead Parkour Fullscreen, Dreadhead Parkour unblocked",8.8,36475,[55],"November 2023",{"slug":152,"title":153,"image":154,"categories":155,"format":45,"url":156,"content":157,"description":158,"keywords":159,"rating":121,"votes":160,"developer":161,"platform":162,"lastUpdated":111},"free-kick-shooter","Free Kick Shooter","/media/free-kick-shooter.webp",[32,35],"https://23azostore.github.io/s4/free-kick-shooter/","Free Kick Shooter tests your accuracy and precision as you take free kicks from various positions on the field. You have to account for wind direction and the goalkeeper’s movements to curl the ball into the net. As you progress, the challenges get harder with more defenders and tricky angles.\n\nThe game features a simple swipe-to-shoot mechanic that feels satisfying to master. It’s an addictive sports game that lets you live out the fantasy of scoring the winning goal in a high-pressure situation.","Play Free Kick Shooter unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Free Kick Shooter Pizza Edition, Free Kick Shooter Fullscreen, Free Kick Shooter unblocked",55376,"Pizza Edition",[55],{"slug":164,"title":165,"image":166,"categories":167,"format":45,"url":168,"content":169,"description":170,"keywords":171,"rating":134,"votes":172,"developer":96,"platform":173,"lastUpdated":56},"getaway-shootout","Getaway Shootout","/media/getaway-shootout.webp",[32,17],"https://23azostore.github.io/s4/getaway-shootout/","Getaway Shootout is a frantic two-player game where you race to the helicopter to escape. Jump, shoot, and use power-ups to hinder your opponents in a chaotic dash for freedom.\n\nThe game features ragdoll physics and hilarious movement mechanics. Play against the computer or a friend in local multiplayer and see who can make the getaway first.","Getaway Shootout Pizza Edition: Play unblocked fullscreen. Enjoy this top shooting game without downloads.","Getaway Shootout Pizza Edition, Getaway Shootout Fullscreen, Getaway Shootout unblocked",15448,[55],{"slug":175,"title":176,"image":177,"categories":178,"format":45,"url":179,"content":180,"description":181,"keywords":182,"rating":50,"votes":183,"developer":69,"platform":184,"lastUpdated":185},"hammer-2-reloaded","Hammer 2 Reloaded","/media/hammer-2-reloaded.webp",[32],"https://23azostore.github.io/s4/hammer-2-reloaded/","Hammer 2 Reloaded is a third‑person action shooter set in a gritty city. You control a vigilante clearing the streets of bad guys, using guns, melee attacks, and vehicles to get the job done. The action is chaotic and open—you can hijack cars, blow up barrels, and use the environment to take cover.\n\nMoment to moment you’re constantly moving, switching targets, and looking for better weapons or a getaway car. Missions give you specific goals, but the fun often comes from the unscripted mess of a shootout going wrong and you improvising a way out. It’s a sandbox of destruction that doesn’t take itself too seriously.","Experience Hammer 2 Reloaded Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting shooting game. Start playing now!","Hammer 2 Reloaded Pizza Edition, Hammer 2 Reloaded Fullscreen, Hammer 2 Reloaded unblocked",51138,[55],"May 2023",{"slug":187,"title":188,"image":189,"categories":190,"format":45,"url":191,"content":192,"description":193,"keywords":194,"rating":195,"votes":196,"developer":197,"platform":198,"lastUpdated":199},"head-soccer-2023","Head Soccer 2023","/media/head-soccer-2023.webp",[35,20,17],"https://23azostore.github.io/s4/head-soccer-2023/","Head Soccer 2023 updates the classic big‑head formula with fresh players and smoother animations. It’s still 1v1 soccer where you jump, header, and kick to outscore your opponent, but the physics feel tighter and the pace is quicker. You can play solo or against a friend, trading goals and blocks in short matches.\n\nThe appeal is the back‑and‑forth rhythm—you’re always one lucky bounce away from a goal, or one mistake away from conceding. Special shots and power‑ups add variety, but the core game is about timing your jumps to protect your net and catch the other player out of position.","Experience Head Soccer 2023 Pizza Edition unblocked! Play fullscreen on PizaGame. Master this sports challenge. Start playing now!","Head Soccer 2023 Pizza Edition, Head Soccer 2023 Fullscreen, Head Soccer 2023 unblocked",9.7,28634,"Pizza Games Studio",[55],"October 2023",{"slug":201,"title":202,"image":203,"categories":204,"format":45,"url":205,"content":206,"description":207,"keywords":208,"rating":209,"votes":210,"developer":211,"platform":212,"lastUpdated":213},"house-of-hazards","House of Hazards","/media/house-of-hazards.webp",[5,17],"https://23azostore.github.io/s/house-of-hazards/","House of Hazards is a hilarious multiplayer game where completing simple household chores becomes a chaotic challenge. Players take turns trying to finish tasks like making coffee or watering plants, while the others set off traps to stop them. Watch out for falling lamps, flying toast, and slippery floors!\n\nThe game is perfect for playing with friends, offering plenty of laughs as you sabotage each other’s efforts. With its quirky art style and unpredictable gameplay, House of Hazards turns mundane activities into a competitive and entertaining battle for survival.","Play House of Hazards unblocked: Pizza Edition in full screen. A great action game to play free online.","House of Hazards Pizza Edition, House of Hazards Fullscreen, House of Hazards unblocked",8.5,11452,"Game Studio",[55],"August 2024",1766592032982]