[{"data":1,"prerenderedAt":208},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-archery-world-tour":40,"similar-archery-world-tour":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"puzzle","Puzzle",{"slug":20,"name":21},"shooting","Shooting",{"slug":23,"name":24},"sports","Sports",{"slug":26,"name":27},"strategy","Strategy",{"slug":29,"name":30},"multiplayer","Multiplayer",{"slug":32,"name":33},"new","New",{"slug":35,"name":36},"popular","Popular",{"slug":38,"name":39},"originals","Originals",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"archery-world-tour","Archery World Tour","/media/archery-world-tour.webp",[23],"html5","https://23azostore.github.io/s/archery-world-tour/","Archery World Tour focuses on clean, readable shots and small adjustments that matter. You aim at targets across different ranges and account for wind that can push an arrow off line. Later stages add moving and rotating targets or partial cover, so you learn to set power and angle with a bit more care.\n\nOutside the main tour, a balloon challenge mode offers quick practice runs that emphasize judging drift and release timing. The format is straightforward, the feedback is clear, and landing a centered shot is consistently satisfying.","Archery World Tour Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","Archery World Tour Pizza Edition, Archery World Tour Fullscreen, Archery World Tour unblocked",8.9,40059,"Pizza Editione",[54],"Desktop Web","April 2024",[57,70,83,97,109,123,135,147,160,172,185,197],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":52,"platform":68,"lastUpdated":69},"4th-and-goal-2022","4th and Goal 2022","/media/4th-and-goal-2022.webp",[23,32,29],"https://23azostore.github.io/s2/4th-and-goal-2022/","4th and Goal 2022 distills American football into brisk drives and meaningful decisions. The playbook is compact but expressive: inside runs to set a rhythm, option looks that punish over‑pursuit, and timing routes that reward a calm read when a safety bites. On defense, a well‑chosen blitz can flip a possession, while disciplined coverage squeezes windows until a hurried throw invites a takeaway.\n\nModes range from quick games to deeper playoff runs, and the tone stays consistent—intuitive controls, short possessions, and enough tactical space that smart play‑calling tells. Drives hinge on small choices: take the yards and bleed the clock, or push for a dagger before the half; pin them deep with field position, or gamble on fourth down when momentum is yours. Red‑zone snaps carry that familiar knot in the stomach, and touchdowns feel earned rather than scripted. It’s football trimmed to essentials, lively and readable, where a season’s story is written in a handful of clutch plays.","Play 4th and Goal 2022 unblocked: Pizza Edition in full screen. A great sports game to play free online.","4th and Goal 2022 Pizza Edition, 4th and Goal 2022 Fullscreen, 4th and Goal 2022 unblocked",9.2,19856,[54],"April 2023",{"slug":71,"title":72,"image":73,"categories":74,"format":45,"url":75,"content":76,"description":77,"keywords":78,"rating":50,"votes":79,"developer":80,"platform":81,"lastUpdated":82},"8-ball-pool","8 Ball Pool","/media/8-ball-pool.webp",[23,35,29],"https://sudoku-online.github.io/a8/8-ball-pool/","8 Ball Pool turns a familiar barroom duel into a sleek ladder of quick matches and steady progression. Breaks matter—set the rack moving cleanly and you’ll find patterns faster. From there it’s a lesson in touch: soft shots that nurse position, draw that opens angles on the next ball, and the quiet confidence to take a long cut when the table calls for it. Physics are crisp, so a good stroke feels honest, and mistakes teach immediately.\n\nAs your aim improves, the rooms change, stakes rise, and tournaments test whether you can string frames under pressure. Coins unlock cues and venues, but the heart stays in the geometry—finding routes that keep you in control and refusing the hero shot when the safety is wiser. Matches are short enough to fit a break and deep enough to be satisfying, and momentum can flip on a single great pot. It’s pool for the modern moment—accessible in seconds, endlessly replayable, and always nudging you toward cleaner lines.","8 Ball Pool Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","8 Ball Pool Pizza Edition, 8 Ball Pool Fullscreen, 8 Ball Pool unblocked, sports games",10188,"Game Studio",[54],"May 2023",{"slug":84,"title":85,"image":86,"categories":87,"format":45,"url":88,"content":89,"description":90,"keywords":91,"rating":92,"votes":93,"developer":94,"platform":95,"lastUpdated":96},"a-small-world-cup","A Small World Cup","/media/a-small-world-cup.webp",[23,29],"https://23azostore.github.io/s2/a-small-world-cup/","A Small World Cup is soccer reimagined as a ragdoll duel, equal parts slapstick and strategy. You drag to aim a full‑body lunge, release, and your solitary player rockets across the pitch—sometimes threading a perfect shot, sometimes pinwheeling into the post to howls of laughter. The controls are simple, but the timing isn’t; angles off the boards, recovery windows, and feints that bait an over‑commit all matter when a match tightens.\n\nModes capture the tournament mood in miniature, from sudden‑death thrillers to full brackets that fit neatly into a short session. Beneath the chaos is a core of honest competition: the better read wins more often, and a last‑second volley can swing a game from despair to delight. It’s quick, silly, and unexpectedly deep—the kind of game that fills a room with noise, then goes quiet for a heartbeat as the ball arcs toward the net.","Play A Small World Cup Pizza Edition unblocked in fullscreen. Enjoy this exciting sports game. Free online game - no downloads required!","A Small World Cup Pizza Edition, A Small World Cup Fullscreen, A Small World Cup unblocked",8.5,44327,"Independent Developer",[54],"July 2023",{"slug":98,"title":99,"image":100,"categories":101,"format":45,"url":102,"content":103,"description":104,"keywords":105,"rating":50,"votes":106,"developer":107,"platform":108,"lastUpdated":55},"air-hockey-championship-deluxe","Air Hockey Championship Deluxe","/media/air-hockey-championship-deluxe.webp",[23,29],"https://23azostore.github.io/s2/air-hockey-championship-deluxe/","Air Hockey Championship Deluxe trims multiplayer competition down to reflex and geometry. First to seven takes the game, and every face‑off is a lesson in reading rebounds—bank a shot off the boards to open a lane, bait a gap with a soft touch, then meet the return with a clean block that turns defense into attack. Solo play offers steady practice; across the table, two‑player duels swing on a single perfect slap.\n\nUnlockable pucks and tables add personality without getting in the way of what matters: responsive control, brisk points, and that satisfying thunk when a shot rockets home. It’s easy to pick up and hard to truly dominate, the kind of match that starts as a quick break and ends five games later because neither side can bear to leave the last one undecided.","Play Air Hockey Championship Deluxe Pizza Edition unblocked in fullscreen. The best sports gameplay. Free online game - no downloads required!","Air Hockey Championship Deluxe Pizza Edition, Air Hockey Championship Deluxe Fullscreen",35137,"Pizza Dev Team",[54],{"slug":110,"title":111,"image":112,"categories":113,"format":45,"url":114,"content":115,"description":116,"keywords":117,"rating":118,"votes":119,"developer":120,"platform":121,"lastUpdated":122},"athletics-hero","Athletics Hero","/media/athletics-hero.webp",[23],"https://23azostore.github.io/s2/athletics-hero/","Athletics Hero offers a compact set of track‑and‑field events built around timing. The 100m asks for rhythmic inputs to keep speed, javelin rewards a clean release at the right angle, and triple jump leans on measured steps and a controlled final push. Each event explains its prompts clearly and gives immediate feedback when you mistime an action or overpower a throw.\n\nSessions are short, so it’s easy to chase medals and try again. As you improve, the difference between silver and gold usually comes down to one good start or a better release window, which keeps retries focused and satisfying.","Experience Athletics Hero Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting sports game. Start playing now!","Athletics Hero Pizza Edition, Athletics Hero Fullscreen, Athletics Hero unblocked, sports games",9.4,26120,"Pizza Edition",[54],"June 2023",{"slug":124,"title":125,"image":126,"categories":127,"format":45,"url":128,"content":129,"description":130,"keywords":131,"rating":66,"votes":132,"developer":107,"platform":133,"lastUpdated":134},"basket-and-ball","Basket and Ball","/media/basket-and-ball.webp",[23],"https://23azostore.github.io/s2/basket-and-ball/","Basket and Ball is a physics puzzle where you play as the ball. Levels mix trampolines, switches, and hazards like spikes and fire traps, and the goal is always the same—reach the hoop cleanly. You bounce, roll, and use the environment to build height or change direction, sometimes timing an explosion or hardening into stone to cross a tricky section.\n\nIt starts simple and gets more involved as new pieces appear. Stars encourage clean routes, but the core is generous enough for quick progress, and the controls make each retry fast. If you enjoy puzzle‑platformers with consistent rules and clear goals, it’s easy to recommend.","Experience Basket and Ball Pizza Edition unblocked! Play fullscreen on PizaGame. The best sports gameplay. Start playing now!","Basket and Ball Pizza Edition, Basket and Ball Fullscreen, Basket and Ball unblocked, sports games",49048,[54],"March 2024",{"slug":136,"title":137,"image":138,"categories":139,"format":45,"url":140,"content":141,"description":142,"keywords":143,"rating":66,"votes":144,"developer":52,"platform":145,"lastUpdated":146},"basket-bros","Basket Bros","/media/basket-bros.webp",[23,29],"https://23azostore.github.io/s7/basket-bros/","Basket Bros is a side‑view basketball game built for quick matches. You pick a character, hop into 1v1 games, and trade drives, blocks, and jump shots with simple controls and responsive movement. Rounds are short, and a single well‑timed steal can swing momentum fast.\n\nUnlocks add new characters and gear over time, and local play makes it easy to settle a matchup with a friend. It’s light, fast, and focused on action rather than simulation, which suits quick sessions well.","Basket Bros Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","Basket Bros Pizza Edition, Basket Bros Fullscreen, Basket Bros unblocked, sports games",59075,[54],"July 2024",{"slug":148,"title":149,"image":150,"categories":151,"format":45,"url":152,"content":153,"description":154,"keywords":155,"rating":156,"votes":157,"developer":80,"platform":158,"lastUpdated":159},"basket-champs","Basket Champs","/media/basket-champs.webp",[23,29],"https://23azostore.github.io/s2/basket-champs/","Basket Champs is a tournament of set‑piece shots where power and angle do the work. You represent a team, line up attempts as the hoop shifts position, and advance by outscoring rivals through group stages into knockout rounds. If there’s a tie, sudden‑death shots decide the winner.\n\nBecause the setup changes from round to round, small adjustments matter. It’s straightforward to learn, and the pressure ramps naturally as a final approaches.","Basket Champs Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","Basket Champs Pizza Edition, Basket Champs Fullscreen, Basket Champs unblocked, sports games",9.3,32965,[54],"January 2024",{"slug":161,"title":162,"image":163,"categories":164,"format":45,"url":165,"content":166,"description":167,"keywords":168,"rating":169,"votes":170,"developer":107,"platform":171,"lastUpdated":96},"basket-swooshes","Basket Swooshes","/media/basket-swooshes.webp",[23,29],"https://23azostore.github.io/s2/basket-swooshes/","Basket Swooshes focuses on head‑to‑head shooting duels up to eleven points. You set power and angle, watch the arc, and adjust on the fly as the hoop position changes. Matches are quick, and representing different countries adds a bit of flavor without changing the rules.\n\nThe appeal is in consistency and pace. Shots feel fair, improvements are obvious, and the short format makes it easy to play a few rounds back to back.","Play Basket Swooshes unblocked: Pizza Edition in full screen. A great sports game to play free online.","Basket Swooshes Pizza Edition, Basket Swooshes Fullscreen, Basket Swooshes unblocked, sports games",9,59330,[54],{"slug":173,"title":174,"image":175,"categories":176,"format":45,"url":177,"content":178,"description":179,"keywords":180,"rating":181,"votes":182,"developer":94,"platform":183,"lastUpdated":184},"basketball-legends","Basketball Legends","/media/basketball-legends.webp",[23,29],"https://23azostore.github.io/s/basketball-legends/","Basketball Legends is a two‑player arcade take on the sport with simple inputs and exaggerated plays. You choose a duo or go solo, use quick dashes, blocks, and jump shots to create space, and build toward special moves that can break a tight game open. Modes include quick matches and full tournaments, so you can warm up or go for a longer run.\n\nIt’s easy to pick up and rewards timing more than complex inputs. The result feels lively and competitive without getting heavy, which makes it a strong choice for short sessions with a friend.","Play Basketball Legends unblocked: Pizza Edition in full screen. A great sports game to play free online.","Basketball Legends Pizza Edition, Basketball Legends Fullscreen, Basketball Legends unblocked",8.3,13965,[54],"December 2023",{"slug":186,"title":187,"image":188,"categories":189,"format":45,"url":190,"content":191,"description":192,"keywords":193,"rating":194,"votes":195,"developer":94,"platform":196,"lastUpdated":55},"basketball-line","Basketball Line","/media/basketball-line.webp",[23],"https://sudoku-online.github.io/a2/basketball-line/","Basketball Line is a drawing‑based hoops game where you guide each ball into the basket by sketching quick lines in the right place. Balls launch from different angles and heights, so you react to their path, drop a line to redirect the bounce, and adjust on the fly when bombs or other hazards appear. You only have a limited number of lines to use, which keeps the focus on clean solutions rather than scribbling a safety net. As levels progress, timing matters more than it first appears—the best placements steer balls smoothly without stalling, and a small mistake can turn into a miss when the rim moves or an obstacle nudges the ball off course. It’s easy to understand, quick to restart, and satisfying when a neat sketch sends a tricky shot straight through the hoop.","Basketball Line Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","Basketball Line Pizza Edition, Basketball Line Fullscreen, Basketball Line unblocked, sports games",8.4,56691,[54],{"slug":198,"title":199,"image":200,"categories":201,"format":45,"url":202,"content":203,"description":204,"keywords":205,"rating":118,"votes":206,"developer":94,"platform":207,"lastUpdated":82},"basketball-stars","Basketball Stars","/media/basketball-stars.webp",[23,35,29],"https://basketballstarsonline.github.io/file/","Basketball Stars is a fast one‑minute basketball match with simple controls and clear momentum swings. You pick a character, choose a mode, and trade drives, blocks, steals, and jump shots in tight possessions that reward timing more than complex inputs. Modes cover quick games, bracket tournaments, and local two‑player play in 1v1 or 2v2, so it works well for a short break or a longer run. Most of the depth comes from small reads—hold position for a block instead of chasing, dash into space for a clean dunk, or save a special move for the last possession. It’s easy to pick up, lively when played with a friend, and competitive enough to keep rematches coming.","Play Basketball Stars Pizza Edition unblocked in fullscreen. Fun sports action. Free online game - no downloads required!","Basketball Stars Pizza Edition, Basketball Stars Fullscreen, Basketball Stars unblocked",29910,[54],1766242874380]