[{"data":1,"prerenderedAt":207},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-stick-merge":40,"similar-stick-merge":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"stick-merge","Stick Merge","/media/stick-merge.webp",[32,38],"html5","https://htmlxm.github.io/h3/stick-merge","Stick Merge is a casual action game where you merge weapons to create more powerful guns. Take control of a stickman agent and eliminate waves of enemies in fast-paced shootouts.\n\nThe game features a variety of weapons and upgrades. Combine your guns, improve your stats, and become the ultimate stickman warrior in this addictive merge game.","Play Stick Merge Pizza Edition unblocked in fullscreen. Enjoy this exciting shooting game. Free online game - no downloads required!","Stick Merge Pizza Edition, Stick Merge Fullscreen, Stick Merge unblocked, shooting games",8.6,22436,"Pizza Dev Team",[54],"Desktop Web","November 2024",[57,71,83,96,108,121,135,146,159,170,184,196],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":68,"platform":69,"lastUpdated":70},"among-us","Among Us","/media/among-us.webp",[38,26,17],"https://ovo-game.github.io/o/among-us/","Among Us is a social deduction game where a team of crewmates tries to complete simple tasks while one or more impostors work to stop them. Each round plays out in short bursts of movement and discussion: fix a sabotage, finish a task, or report a body and talk through what you’ve seen. Crewmates win by finishing all tasks or voting out the impostors; impostors win by causing enough chaos and eliminating the crew without being caught.\n\nIt’s easy to understand after a few matches and scales well with different group sizes. Maps change the layout of tasks and travel routes, and small settings tweaks can make games faster or more methodical. The appeal is in the stories that form—alibis that don’t add up, quiet players who turn out to be sharp observers, and those tense moments around the emergency button when suspicion swings from one person to another.","Play Among Us Pizza Edition unblocked in fullscreen. Enjoy this exciting strategy game. Free online game - no downloads required!","Among Us Pizza Edition, Among Us Fullscreen, Among Us unblocked, strategy games, play Among Us",9,21669,"Pizza Edition",[54],"September 2024",{"slug":72,"title":73,"image":74,"categories":75,"format":45,"url":76,"content":77,"description":78,"keywords":79,"rating":50,"votes":80,"developer":52,"platform":81,"lastUpdated":82},"cannon-strike","Cannon Strike","/media/cannon-strike.webp",[32],"https://htmlxm.github.io/h2/cannon-strike","Cannon Strike is a physics puzzle about firing pellets into a container while the path changes around you. You set angle and timing from a fixed cannon, then watch pellets bounce off surfaces, slip through rotating bars, and settle—if you judged correctly—where you need them. Early levels are forgiving, but later layouts ask for tighter shots and a better sense of how motion will carry after a bounce.\n\nMoment to moment you’re deciding whether to shoot now or wait for a safer alignment. The game respects patience; a clean release is usually better than brute force. Limited ammo or stricter thresholds show up as you progress, which encourages smarter planning rather than rushing. It’s the kind of puzzle where each success feels earned, and small adjustments lead to reliable solutions without trial‑and‑error grind.","Experience Cannon Strike Pizza Edition unblocked! Play fullscreen on PizaGame. Master this shooting challenge. Start playing now!","Cannon Strike Pizza Edition, Cannon Strike Fullscreen, Cannon Strike unblocked, shooting games",32373,[54],"December 2023",{"slug":84,"title":85,"image":86,"categories":87,"format":45,"url":88,"content":89,"description":90,"keywords":91,"rating":92,"votes":93,"developer":68,"platform":94,"lastUpdated":95},"chicken-merge","Chicken Merge","/media/chicken-merge.webp",[38],"https://23azostore.github.io/s4/chicken-merge/","Chicken Merge mixes idle merging with light defense. You place chickens on slots to shoot approaching targets, then drag identical units together to create stronger ones. Waves escalate gradually, and coins earned during play fund more slots and upgrades, which keep the board feeling busy without demanding constant micromanagement.\n\nThe moment‑to‑moment decisions are simple—merge now for immediate damage or hold pieces to combine later into a bigger tier; reposition a strong unit to cover a weak lane; invest in economy or in firepower. Progress comes in steady steps, and small optimizations turn into noticeable gains. It’s a pleasant loop that works for brief sessions and longer stretches, with clear feedback and enough variety to stay engaging.","Play Chicken Merge Pizza Edition unblocked in fullscreen. Master this strategy challenge. Free online game - no downloads required!","Chicken Merge Pizza Edition, Chicken Merge Fullscreen, Chicken Merge unblocked, strategy games",8.9,58075,[54],"June 2023",{"slug":97,"title":98,"image":99,"categories":100,"format":45,"url":101,"content":102,"description":103,"keywords":104,"rating":66,"votes":105,"developer":68,"platform":106,"lastUpdated":107},"free-kick-shooter","Free Kick Shooter","/media/free-kick-shooter.webp",[32,35],"https://23azostore.github.io/s4/free-kick-shooter/","Free Kick Shooter tests your accuracy and precision as you take free kicks from various positions on the field. You have to account for wind direction and the goalkeeper’s movements to curl the ball into the net. As you progress, the challenges get harder with more defenders and tricky angles.\n\nThe game features a simple swipe-to-shoot mechanic that feels satisfying to master. It’s an addictive sports game that lets you live out the fantasy of scoring the winning goal in a high-pressure situation.","Play Free Kick Shooter unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Free Kick Shooter Pizza Edition, Free Kick Shooter Fullscreen, Free Kick Shooter unblocked",55376,[54],"April 2023",{"slug":109,"title":110,"image":111,"categories":112,"format":45,"url":113,"content":114,"description":115,"keywords":116,"rating":50,"votes":117,"developer":118,"platform":119,"lastUpdated":120},"getaway-shootout","Getaway Shootout","/media/getaway-shootout.webp",[32,17],"https://23azostore.github.io/s4/getaway-shootout/","Getaway Shootout is a frantic two-player game where you race to the helicopter to escape. Jump, shoot, and use power-ups to hinder your opponents in a chaotic dash for freedom.\n\nThe game features ragdoll physics and hilarious movement mechanics. Play against the computer or a friend in local multiplayer and see who can make the getaway first.","Getaway Shootout Pizza Edition: Play unblocked fullscreen. Enjoy this top shooting game without downloads.","Getaway Shootout Pizza Edition, Getaway Shootout Fullscreen, Getaway Shootout unblocked",15448,"Pizza Editione",[54],"April 2024",{"slug":122,"title":123,"image":124,"categories":125,"format":45,"url":126,"content":127,"description":128,"keywords":129,"rating":130,"votes":131,"developer":132,"platform":133,"lastUpdated":134},"hammer-2-reloaded","Hammer 2 Reloaded","/media/hammer-2-reloaded.webp",[32],"https://23azostore.github.io/s4/hammer-2-reloaded/","Hammer 2 Reloaded is a third‑person action shooter set in a gritty city. You control a vigilante clearing the streets of bad guys, using guns, melee attacks, and vehicles to get the job done. The action is chaotic and open—you can hijack cars, blow up barrels, and use the environment to take cover.\n\nMoment to moment you’re constantly moving, switching targets, and looking for better weapons or a getaway car. Missions give you specific goals, but the fun often comes from the unscripted mess of a shootout going wrong and you improvising a way out. It’s a sandbox of destruction that doesn’t take itself too seriously.","Experience Hammer 2 Reloaded Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting shooting game. Start playing now!","Hammer 2 Reloaded Pizza Edition, Hammer 2 Reloaded Fullscreen, Hammer 2 Reloaded unblocked",9.4,51138,"Independent Developer",[54],"May 2023",{"slug":136,"title":137,"image":138,"categories":139,"format":45,"url":140,"content":141,"description":142,"keywords":143,"rating":66,"votes":144,"developer":132,"platform":145,"lastUpdated":70},"masked-forces","Masked Forces","/media/masked-forces.webp",[32,17],"https://23azostore.github.io/s8/masked-forces/","Masked Forces is a tactical first-person shooter where you fight for survival in various game modes. Join a team or go solo in intense battles against other players or AI bots.\n\nThe game features a wide arsenal of weapons, armor, and upgrades. Customize your loadout and use strategy to outsmart your enemies in this fast-paced shooter.","Play Masked Forces unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Masked Forces Pizza Edition, Masked Forces Fullscreen, Masked Forces unblocked, shooting games",55493,[54],{"slug":147,"title":148,"image":149,"categories":150,"format":45,"url":151,"content":152,"description":153,"keywords":154,"rating":155,"votes":156,"developer":118,"platform":157,"lastUpdated":158},"merge-cyber-racers","Merge Cyber Racers","/media/merge-cyber-racers.webp",[14,38],"https://htmlxm.github.io/h5/merge-cyber-racers","Merge Cyber Racers is a futuristic idle game where you merge cars to create faster and more advanced vehicles. Build your fleet of cyber racers and earn money as they race around the track.\n\nThe game combines merging mechanics with racing management. Unlock new cars, upgrade your track, and become a tycoon in the world of cyber racing.","Play Merge Cyber Racers Pizza Edition unblocked in fullscreen. Enjoy this exciting driving game. Free online game - no downloads required!","Merge Cyber Racers Pizza Edition, Merge Cyber Racers Fullscreen, Merge Cyber Racers unblocked",8.8,26795,[54],"July 2024",{"slug":160,"title":161,"image":162,"categories":163,"format":45,"url":164,"content":165,"description":166,"keywords":167,"rating":50,"votes":168,"developer":52,"platform":169,"lastUpdated":120},"merge-round-racers","Merge Round Racers","/media/merge-round-racers.webp",[14,38],"https://htmlxm.github.io/h7/merge-round-racers","Merge Round Racers is an idle merging game where you manage a team of racing cars. Purchase vehicles, merge identical ones to upgrade them, and let them race to earn coins.\n\nThe game features a simple yet addictive loop of buying, merging, and racing. Expand your garage, unlock high-level cars, and maximize your earnings in this fun simulation game.","Experience Merge Round Racers Pizza Edition unblocked! Play fullscreen on PizaGame. The best driving gameplay. Start playing now!","Merge Round Racers Pizza Edition, Merge Round Racers Fullscreen, Merge Round Racers unblocked",35866,[54],{"slug":171,"title":172,"image":173,"categories":174,"format":45,"url":175,"content":176,"description":177,"keywords":178,"rating":179,"votes":180,"developer":181,"platform":182,"lastUpdated":183},"neon-war","Neon War","/media/neon-war.webp",[32,20],"https://fridaynight-funkin.github.io/f5/neon-war/","Neon War is an arcade shooter where you defend your base against waves of neon shapes. Control a cannon, shoot down falling enemies, and upgrade your firepower to survive longer.\n\nThe game features vibrant neon graphics and increasingly difficult levels. Collect coins to unlock new cannons and power-ups. Test your reflexes and strategy in this colorful and addictive defense game.","Play Neon War unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Neon War Pizza Edition, Neon War Fullscreen, Neon War unblocked, shooting games, play Neon War",9.6,58043,"Pizza Games Studio",[54],"January 2024",{"slug":185,"title":186,"image":187,"categories":188,"format":45,"url":189,"content":190,"description":191,"keywords":192,"rating":66,"votes":193,"developer":68,"platform":194,"lastUpdated":195},"paper-io-2","Paper Io 2","/media/paper-io-2.webp",[38,17],"https://htmlxm.github.io/h9/paper-io-2/","Paper.io 2 is a popular multiplayer IO game where you compete to conquer the most territory. Move your character to draw lines and enclose areas to claim them as your own.\n\nThe game requires strategy and quick reflexes. Steal territory from other players, but be careful not to let them cross your trail while you are outside your safe zone. Can you dominate the map and become the king of Paper.io?","Experience Paper Io 2 Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting strategy game. Start playing now!","Paper Io 2 Pizza Edition, Paper Io 2 Fullscreen, Paper Io 2 unblocked, strategy games",54208,[54],"May 2024",{"slug":197,"title":198,"image":199,"categories":200,"format":45,"url":201,"content":202,"description":203,"keywords":204,"rating":66,"votes":205,"developer":132,"platform":206,"lastUpdated":134},"penalty-shooters-2","Penalty Shooters 2","/media/penalty-shooters-2.webp",[32,35],"https://23azostore.github.io/s6/penalty-shooters-2/","Penalty Shooters 2 lets you choose your favorite team and compete in fantasy leagues. Master the art of penalty kicks and goalkeeping to lead your team to victory.\n\nThe game features hundreds of teams from various leagues. Score goals, make spectacular saves, and progress through the tournament bracket to win the championship trophy.","Play Penalty Shooters 2 unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Penalty Shooters 2 Pizza Edition, Penalty Shooters 2 Fullscreen, Penalty Shooters 2 unblocked",39592,[54],1766636490968]