[{"data":1,"prerenderedAt":208},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-boxing-random":40,"similar-boxing-random":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"boxing-random","Boxing Random","/media/boxing-random.webp",[11,17],"html5","https://23azostore.github.io/s77/boxing-random/","Boxing Random is a one‑button boxing game built on ragdoll movement and changing conditions. Every round shifts something—the footing, outfits, even little twists to how a punch connects—so you adapt as you go and try to be first to five points. Controls stay simple; the challenge is timing. Keep your boxer balanced, wait for the opponent to tilt into range, and press when their guard drops or they overextend. If a rocket punch or special round shows up, use the extra reach but don’t chase wildly, because falling out of rhythm usually costs the point. With a friend beside you it’s easy to trade wins for a long stretch, and most matches are decided by a couple of well‑timed taps.","Boxing Random Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Boxing Random Pizza Edition, Boxing Random Fullscreen, Boxing Random unblocked, arcade games",8.5,57106,"Pizza Edition",[54],"Desktop Web","May 2023",[57,71,85,99,112,124,136,148,161,173,184,197],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":68,"platform":69,"lastUpdated":70},"geometry-dash","Geometry Dash","/media/geometry-dash.webp",[11,26,20],"https://23azostore.github.io/s8/geometry-dash/","Geometry Dash is a rhythm-based platformer that will test your patience and skills. Jump and fly your way through danger in this rhythm-based action platformer!\n\nThe game features simple one-touch game play with many levels that will keep you entertained for hours. Use practice mode to sharpen your skills and unlock new icons and colors to customize your character.","Play Geometry Dash unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Geometry Dash Pizza Edition, Geometry Dash Fullscreen, Geometry Dash unblocked, arcade games",9.5,47094,"Pizza Dev Team",[54],"July 2024",{"slug":72,"title":73,"image":74,"categories":75,"format":45,"url":76,"content":77,"description":78,"keywords":79,"rating":80,"votes":81,"developer":82,"platform":83,"lastUpdated":84},"12-minibattles","12 MiniBattles","/media/12-minibattles.webp",[11,17],"https://23azostore.github.io/s2/12-minibattles/","12 MiniBattles captures the joy of couch competition in its purest form: two players, one button each, and a carousel of bite‑size challenges that flip the rules every round. One moment you’re angling a toe‑poke past a frantic goalkeeper, the next you’re timing a leap in an archery duel or baiting a rival tank onto a cliff. The physics are playful but consistent, so the difference between chaos and control is learning the rhythm and trusting your timing.\n\nWhat makes it sticky is the speed. Rounds last seconds, momentum swings fast, and that single well‑timed press can feel like a masterstroke when the crowd erupts. You don’t need to memorize systems or grind unlocks; the fun comes from reading each scenario and improvising under pressure. It’s the kind of game that turns a quiet evening into a tournament where \"best of five\" becomes \"best of twenty\" without anyone noticing—easy to start, hard to stop, and perfectly tuned for laughter, grudge matches, and tiny comebacks that feel huge.","Play 12 MiniBattles Pizza Edition unblocked in fullscreen. Master this arcade challenge. Free online game - no downloads required!","12 MiniBattles Pizza Edition, 12 MiniBattles Fullscreen, 12 MiniBattles unblocked, arcade games",9.1,31028,"Independent Developer",[54],"January 2023",{"slug":86,"title":87,"image":88,"categories":89,"format":45,"url":90,"content":91,"description":92,"keywords":93,"rating":94,"votes":95,"developer":96,"platform":97,"lastUpdated":98},"4th-and-goal-2022","4th and Goal 2022","/media/4th-and-goal-2022.webp",[35,20,17],"https://23azostore.github.io/s2/4th-and-goal-2022/","4th and Goal 2022 distills American football into brisk drives and meaningful decisions. The playbook is compact but expressive: inside runs to set a rhythm, option looks that punish over‑pursuit, and timing routes that reward a calm read when a safety bites. On defense, a well‑chosen blitz can flip a possession, while disciplined coverage squeezes windows until a hurried throw invites a takeaway.\n\nModes range from quick games to deeper playoff runs, and the tone stays consistent—intuitive controls, short possessions, and enough tactical space that smart play‑calling tells. Drives hinge on small choices: take the yards and bleed the clock, or push for a dagger before the half; pin them deep with field position, or gamble on fourth down when momentum is yours. Red‑zone snaps carry that familiar knot in the stomach, and touchdowns feel earned rather than scripted. It’s football trimmed to essentials, lively and readable, where a season’s story is written in a handful of clutch plays.","Play 4th and Goal 2022 unblocked: Pizza Edition in full screen. A great sports game to play free online.","4th and Goal 2022 Pizza Edition, 4th and Goal 2022 Fullscreen, 4th and Goal 2022 unblocked",9.2,19856,"Pizza Editione",[54],"April 2023",{"slug":100,"title":101,"image":102,"categories":103,"format":45,"url":104,"content":105,"description":106,"keywords":107,"rating":108,"votes":109,"developer":110,"platform":111,"lastUpdated":55},"8-ball-pool","8 Ball Pool","/media/8-ball-pool.webp",[35,26,17],"https://sudoku-online.github.io/a8/8-ball-pool/","8 Ball Pool turns a familiar barroom duel into a sleek ladder of quick matches and steady progression. Breaks matter—set the rack moving cleanly and you’ll find patterns faster. From there it’s a lesson in touch: soft shots that nurse position, draw that opens angles on the next ball, and the quiet confidence to take a long cut when the table calls for it. Physics are crisp, so a good stroke feels honest, and mistakes teach immediately.\n\nAs your aim improves, the rooms change, stakes rise, and tournaments test whether you can string frames under pressure. Coins unlock cues and venues, but the heart stays in the geometry—finding routes that keep you in control and refusing the hero shot when the safety is wiser. Matches are short enough to fit a break and deep enough to be satisfying, and momentum can flip on a single great pot. It’s pool for the modern moment—accessible in seconds, endlessly replayable, and always nudging you toward cleaner lines.","8 Ball Pool Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","8 Ball Pool Pizza Edition, 8 Ball Pool Fullscreen, 8 Ball Pool unblocked, sports games",8.9,10188,"Game Studio",[54],{"slug":113,"title":114,"image":115,"categories":116,"format":45,"url":117,"content":118,"description":119,"keywords":120,"rating":121,"votes":122,"developer":52,"platform":123,"lastUpdated":84},"a-dance-of-fire-and-ice","A Dance of Fire and Ice","/media/a-dance-of-fire-and-ice.webp",[11],"https://23azostore.github.io/s8/a-dance-of-fire-and-ice/","A Dance of Fire and Ice is rhythm distilled: one button, perfect timing, and paths that turn music into motion. Two luminous orbs trace angles, gaps, and sudden switches, and your only job is to press exactly on the beat. There’s no generous buffer or off‑beat mercy—calibrate once, breathe, and trust the soundtrack as patterns grow from simple steps to layered syncopation.\n\nEach world introduces an idea and then tests your understanding with playful twists. A time signature change resets your count, a deceptive curve hides a double tap, a quiet bridge asks for focus more than speed. It’s challenging but fair, and when the press lands and the path flows without a stutter, there’s a singular satisfaction in the way sound and motion snap into one. For rhythm‑game devotees, it’s pure signal: clear rules, precise feedback, and the enduring thrill of mastery.","Experience A Dance of Fire and Ice Pizza Edition unblocked! Play fullscreen on PizaGame. Fun arcade action. Start playing now!","A Dance of Fire and Ice Pizza Edition, A Dance of Fire and Ice Fullscreen",9.4,30910,[54],{"slug":125,"title":126,"image":127,"categories":128,"format":45,"url":129,"content":130,"description":131,"keywords":132,"rating":50,"votes":133,"developer":82,"platform":134,"lastUpdated":135},"a-small-world-cup","A Small World Cup","/media/a-small-world-cup.webp",[35,17],"https://23azostore.github.io/s2/a-small-world-cup/","A Small World Cup is soccer reimagined as a ragdoll duel, equal parts slapstick and strategy. You drag to aim a full‑body lunge, release, and your solitary player rockets across the pitch—sometimes threading a perfect shot, sometimes pinwheeling into the post to howls of laughter. The controls are simple, but the timing isn’t; angles off the boards, recovery windows, and feints that bait an over‑commit all matter when a match tightens.\n\nModes capture the tournament mood in miniature, from sudden‑death thrillers to full brackets that fit neatly into a short session. Beneath the chaos is a core of honest competition: the better read wins more often, and a last‑second volley can swing a game from despair to delight. It’s quick, silly, and unexpectedly deep—the kind of game that fills a room with noise, then goes quiet for a heartbeat as the ball arcs toward the net.","Play A Small World Cup Pizza Edition unblocked in fullscreen. Enjoy this exciting sports game. Free online game - no downloads required!","A Small World Cup Pizza Edition, A Small World Cup Fullscreen, A Small World Cup unblocked",44327,[54],"July 2023",{"slug":137,"title":138,"image":139,"categories":140,"format":45,"url":141,"content":142,"description":143,"keywords":144,"rating":108,"votes":145,"developer":68,"platform":146,"lastUpdated":147},"air-hockey-championship-deluxe","Air Hockey Championship Deluxe","/media/air-hockey-championship-deluxe.webp",[35,17],"https://23azostore.github.io/s2/air-hockey-championship-deluxe/","Air Hockey Championship Deluxe trims multiplayer competition down to reflex and geometry. First to seven takes the game, and every face‑off is a lesson in reading rebounds—bank a shot off the boards to open a lane, bait a gap with a soft touch, then meet the return with a clean block that turns defense into attack. Solo play offers steady practice; across the table, two‑player duels swing on a single perfect slap.\n\nUnlockable pucks and tables add personality without getting in the way of what matters: responsive control, brisk points, and that satisfying thunk when a shot rockets home. It’s easy to pick up and hard to truly dominate, the kind of match that starts as a quick break and ends five games later because neither side can bear to leave the last one undecided.","Play Air Hockey Championship Deluxe Pizza Edition unblocked in fullscreen. The best sports gameplay. Free online game - no downloads required!","Air Hockey Championship Deluxe Pizza Edition, Air Hockey Championship Deluxe Fullscreen",35137,[54],"April 2024",{"slug":149,"title":150,"image":151,"categories":152,"format":45,"url":153,"content":154,"description":155,"keywords":156,"rating":157,"votes":158,"developer":52,"platform":159,"lastUpdated":160},"among-us","Among Us","/media/among-us.webp",[38,26,17],"https://ovo-game.github.io/o/among-us/","Among Us is a social deduction game where a team of crewmates tries to complete simple tasks while one or more impostors work to stop them. Each round plays out in short bursts of movement and discussion: fix a sabotage, finish a task, or report a body and talk through what you’ve seen. Crewmates win by finishing all tasks or voting out the impostors; impostors win by causing enough chaos and eliminating the crew without being caught.\n\nIt’s easy to understand after a few matches and scales well with different group sizes. Maps change the layout of tasks and travel routes, and small settings tweaks can make games faster or more methodical. The appeal is in the stories that form—alibis that don’t add up, quiet players who turn out to be sharp observers, and those tense moments around the emergency button when suspicion swings from one person to another.","Play Among Us Pizza Edition unblocked in fullscreen. Enjoy this exciting strategy game. Free online game - no downloads required!","Among Us Pizza Edition, Among Us Fullscreen, Among Us unblocked, strategy games, play Among Us",9,21669,[54],"September 2024",{"slug":162,"title":163,"image":164,"categories":165,"format":45,"url":166,"content":167,"description":168,"keywords":169,"rating":50,"votes":170,"developer":52,"platform":171,"lastUpdated":172},"aqua-thrills","Aqua Thrills","/media/aqua-thrills.webp",[11,17],"https://23azostore.github.io/s2/aqua-thrills/","Aqua Thrills is a fast water‑slide racer about simple steering and good timing. You guide a tube down long, winding slides, adjust left and right to hold a line, and bump rivals when you need space. Races are short and forgiving at first, then add tighter curves, faster sections, and hazards that ask for cleaner inputs.\n\nProgress brings new parks, slides, and cosmetic unlocks. The controls stay straightforward, which makes it easy to jump in for a few runs and see improvement quickly. If you enjoy lightweight racing with clear feedback and quick restarts, it scratches that itch well without getting complicated.","Play Aqua Thrills unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Aqua Thrills Pizza Edition, Aqua Thrills Fullscreen, Aqua Thrills unblocked, arcade games",22681,[54],"March 2023",{"slug":174,"title":175,"image":176,"categories":177,"format":45,"url":178,"content":179,"description":180,"keywords":181,"rating":94,"votes":182,"developer":96,"platform":183,"lastUpdated":70},"basket-bros","Basket Bros","/media/basket-bros.webp",[35,17],"https://23azostore.github.io/s7/basket-bros/","Basket Bros is a side‑view basketball game built for quick matches. You pick a character, hop into 1v1 games, and trade drives, blocks, and jump shots with simple controls and responsive movement. Rounds are short, and a single well‑timed steal can swing momentum fast.\n\nUnlocks add new characters and gear over time, and local play makes it easy to settle a matchup with a friend. It’s light, fast, and focused on action rather than simulation, which suits quick sessions well.","Basket Bros Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","Basket Bros Pizza Edition, Basket Bros Fullscreen, Basket Bros unblocked, sports games",59075,[54],{"slug":185,"title":186,"image":187,"categories":188,"format":45,"url":189,"content":190,"description":191,"keywords":192,"rating":193,"votes":194,"developer":110,"platform":195,"lastUpdated":196},"basket-champs","Basket Champs","/media/basket-champs.webp",[35,17],"https://23azostore.github.io/s2/basket-champs/","Basket Champs is a tournament of set‑piece shots where power and angle do the work. You represent a team, line up attempts as the hoop shifts position, and advance by outscoring rivals through group stages into knockout rounds. If there’s a tie, sudden‑death shots decide the winner.\n\nBecause the setup changes from round to round, small adjustments matter. It’s straightforward to learn, and the pressure ramps naturally as a final approaches.","Basket Champs Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","Basket Champs Pizza Edition, Basket Champs Fullscreen, Basket Champs unblocked, sports games",9.3,32965,[54],"January 2024",{"slug":198,"title":199,"image":200,"categories":201,"format":45,"url":202,"content":203,"description":204,"keywords":205,"rating":157,"votes":206,"developer":68,"platform":207,"lastUpdated":135},"basket-swooshes","Basket Swooshes","/media/basket-swooshes.webp",[35,17],"https://23azostore.github.io/s2/basket-swooshes/","Basket Swooshes focuses on head‑to‑head shooting duels up to eleven points. You set power and angle, watch the arc, and adjust on the fly as the hoop position changes. Matches are quick, and representing different countries adds a bit of flavor without changing the rules.\n\nThe appeal is in consistency and pace. Shots feel fair, improvements are obvious, and the short format makes it easy to play a few rounds back to back.","Play Basket Swooshes unblocked: Pizza Edition in full screen. A great sports game to play free online.","Basket Swooshes Pizza Edition, Basket Swooshes Fullscreen, Basket Swooshes unblocked, sports games",59330,[54],1766842018902]