[{"data":1,"prerenderedAt":228},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"$fu26v6W_Cez6Lym8r-4KmC4wxX1CSVgEfFrHh6PynxVk":37,"$f573GMiDTZDHOmLu9rHGDnkuMLbEHQ1FAZyqFtt0YVEs":49},[4,7,10,13,16,19,22,25,28,31,34],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"puzzle","Puzzle",{"slug":20,"name":21},"shooting","Shooting",{"slug":23,"name":24},"sports","Sports",{"slug":26,"name":27},"strategy","Strategy",{"slug":29,"name":30},"new","New",{"slug":32,"name":33},"popular","Popular",{"slug":35,"name":36},"originals","Originals",[38,39,40,41,42,43,44,45,46,47,48],{"slug":5,"name":6},{"slug":8,"name":9},{"slug":11,"name":12},{"slug":14,"name":15},{"slug":17,"name":18},{"slug":20,"name":21},{"slug":23,"name":24},{"slug":26,"name":27},{"slug":29,"name":30},{"slug":32,"name":33},{"slug":35,"name":36},[50,65,78,90,102,115,127,138,149,162,173,183,193,205,216],{"slug":51,"title":52,"image":53,"categories":54,"format":55,"url":56,"content":57,"description":58,"keywords":59,"rating":60,"votes":61,"developer":62,"platform":63,"lastUpdated":64},"blumgi-ball","Blumgi Ball","/media/blumgi-ball.webp",[23,35],"html5","https://sudoku-online.github.io/a2/blumgi-ball/","Blumgi Ball blends basketball shots with simple puzzle layouts. You pull back to set power and angle, release to send the ball, and press to teleport next to it so you can chain throws from smarter positions. Levels introduce surfaces, gaps, and tricks that ask for one or two clean shots rather than brute force. As you clear stages, you unlock new characters and learn small habits—teleport before the bounce you want, aim lower when an obstacle steals arc, and keep attempts tight to avoid awkward ricochets. It’s compact, responsive, and satisfying when a planned sequence lands.","Play Blumgi Ball Pizza Edition unblocked in fullscreen. The best sports gameplay. Free online game - no downloads required!","Blumgi Ball Pizza Edition, Blumgi Ball Fullscreen, Blumgi Ball unblocked, sports games",9.5,44222,"Independent Developer","Web Browser (HTML5)","April 2023",{"slug":66,"title":67,"image":68,"categories":69,"format":55,"url":70,"content":71,"description":72,"keywords":73,"rating":74,"votes":75,"developer":76,"platform":63,"lastUpdated":77},"blumgi-castle","Blumgi Castle","/media/blumgi-castle.webp",[17,35],"https://23azostore.github.io/s2/blumgi-castle/","Blumgi Castle is a slingshot skill game about dropping enemies into the water with well‑placed shots and tools. You aim with an indicator, hold to set power, and release to fire bombs or special weapons that can carve platforms, push creatures off edges, or clear cover. There’s room to experiment—bigger blasts, saws, lasers, and other toys reward different approaches—and finishing a level cleanly often comes down to picking one good angle and sticking to it. Progress adds new characters and layouts while keeping controls simple.","Play Blumgi Castle unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Blumgi Castle Pizza Edition, Blumgi Castle Fullscreen, Blumgi Castle unblocked, puzzle games",8.4,29097,"Pizza Games Studio","July 2024",{"slug":79,"title":80,"image":81,"categories":82,"format":55,"url":83,"content":84,"description":85,"keywords":86,"rating":60,"votes":87,"developer":88,"platform":63,"lastUpdated":89},"blumgi-rocket","Blumgi Rocket","/media/blumgi-rocket.webp",[11,35],"https://webglmath.github.io/blumgi-rocket/","Blumgi Rocket is a side‑scrolling platformer built around a rocket‑boosted car. You hold for thrust, enjoy a short slow‑motion window during burns, and use stunts to keep pace through hills, tunnels, and tight gaps. Tracks hide shortcuts and safer lines, so a clean route often matters more than constant speed. New skins arrive as you clear levels, and the handling stays consistent enough that learning one car’s rhythm carries across the set.","Experience Blumgi Rocket Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting arcade game. Start playing now!","Blumgi Rocket Pizza Edition, Blumgi Rocket Fullscreen, Blumgi Rocket unblocked, arcade games",17640,"Pizza Editione","September 2023",{"slug":91,"title":92,"image":93,"categories":94,"format":55,"url":95,"content":96,"description":97,"keywords":98,"rating":74,"votes":99,"developer":100,"platform":63,"lastUpdated":101},"blumgi-slime","Blumgi Slime","/media/blumgi-slime.webp",[11,35],"https://23azostore.github.io/s2/blumgi-slime","Blumgi Slime is a jump‑only platformer. Your character can’t walk, so you hold to charge, release to leap, and aim for clean arcs that land on safe ground or the checkered goal. Stages add new colors and obstacle types as you go, but the core stays readable: judge distance, pick a height, and commit. It’s a simple loop that feels good when you string jumps together without hesitation.","Blumgi Slime Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Blumgi Slime Pizza Edition, Blumgi Slime Fullscreen, Blumgi Slime unblocked, arcade games",13957,"Game Studio","November 2023",{"slug":103,"title":104,"image":105,"categories":106,"format":55,"url":107,"content":108,"description":109,"keywords":110,"rating":111,"votes":112,"developer":113,"platform":63,"lastUpdated":114},"color-switch","Color Switch","/media/color-switch.webp",[11,35],"https://23azostore.github.io/s8/color-switch/","Color Switch is a tap‑to‑rise game where you pass a bouncing ball through moving shapes only when colors match. Obstacles rotate and shift, forcing you to hold a steady rhythm and wait for a safe opening. It’s clear and readable, and the quick restart makes it easy to turn a small mistake into another attempt without friction.\n\nMoment to moment you’re deciding whether to risk a pass early or let the pattern cycle once more. Pace picks up as layouts demand consecutive clean taps, and patience often beats rushing. The appeal is in the simplicity: one input, reliable rules, and obstacles that always teach you something about timing. It’s a focused, satisfying challenge that shows improvement in minutes.","Play Color Switch Pizza Edition unblocked in fullscreen. Enjoy this exciting arcade game. Free online game - no downloads required!","Color Switch Pizza Edition, Color Switch Fullscreen, Color Switch unblocked, arcade games",9.3,11839,"Pizza Edition","May 2023",{"slug":116,"title":117,"image":118,"categories":119,"format":55,"url":120,"content":121,"description":122,"keywords":123,"rating":124,"votes":125,"developer":113,"platform":63,"lastUpdated":126},"crossy-road","Crossy Road","/media/crossy-road.webp",[11,35],"https://ubg98.github.io/CrossyRoad/","Crossy Road is a hop‑forward arcade game about looking, waiting, and moving at the right moment. Traffic and rivers form shifting patterns: cars pace in lanes, logs glide at different speeds, and trains cut through on a strict schedule. You dart across when a window opens, pause when it closes, and learn to avoid risky moves that lead to stranded hops.\n\nMoment to moment you’re scanning a few steps ahead and trusting small timings—a quick double hop, a hold to let a lane clear, a step back to avoid a bad sequence. The pace is gentle at first and grows as you survive longer, and the satisfaction comes from making clean, sensible choices. It’s easy to start and tough to master, with runs that tell short stories of near misses and tidy escapes.","Crossy Road Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Crossy Road Pizza Edition, Crossy Road Fullscreen, Crossy Road unblocked, arcade games",9.6,32299,"February 2023",{"slug":128,"title":129,"image":130,"categories":131,"format":55,"url":132,"content":133,"description":134,"keywords":135,"rating":124,"votes":136,"developer":113,"platform":63,"lastUpdated":137},"doodle-jump","Doodle Jump","/media/doodle-jump.webp",[11,35],"https://23azostore.github.io/s7/doodle-jump/","Doodle Jump is a vertical climb where survival comes from steady timing and small, confident moves. Platforms slide and shift, gaps appear without warning, and hazards punish jumps made a fraction too early. You steer left and right, commit to a route, and learn to favor safe landings over risky leaps that save a second and cost a run.\n\nMoment to moment, it’s about reading what’s two steps ahead: a moving platform that needs a patient approach, a fragile one that buys height but won’t hold twice, a hazard you clear by trusting your jump arc. The rhythm is brisk—quick restarts, visible improvement—and scores rise when you stop chasing miracles and string together clean decisions. It’s straightforward, honest platforming that rewards calm execution.","Play Doodle Jump unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Doodle Jump Pizza Edition, Doodle Jump Fullscreen, Doodle Jump unblocked, arcade games",10962,"November 2024",{"slug":139,"title":140,"image":141,"categories":142,"format":55,"url":143,"content":144,"description":145,"keywords":146,"rating":60,"votes":147,"developer":113,"platform":63,"lastUpdated":148},"stick-defenders","Stick Defenders","/media/stick-defenders.webp",[20,35],"https://23azostore.github.io/s6/stick-defenders/","Stick Defenders - Pizza Edition github io Unblocked Games: Play instantly in fullscreen browser, no downloads, no ads. Enjoy games now!","Play Stick Defenders unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Stick Defenders Pizza Edition, Stick Defenders Fullscreen, Stick Defenders unblocked",47787,"August 2023",{"slug":150,"title":151,"image":152,"categories":153,"format":55,"url":154,"content":155,"description":156,"keywords":157,"rating":158,"votes":159,"developer":160,"platform":63,"lastUpdated":161},"stickman-bridge-constructor","Stickman Bridge Constructor","/media/stickman-bridge-constructor.webp",[17,35],"https://23azostore.github.io/s6/stickman-bridge-constructor/","Stickman Bridge Constructor is a puzzle game where you must build bridges to help the stickman cross wide gaps. Use different materials like wood, steel, and cables to create sturdy structures.\n\nThe game tests your engineering skills and problem-solving abilities. Ensure your bridge can support the weight of the stickman and any vehicles. Can you build the perfect bridge and ensure a safe crossing?","Play Stickman Bridge Constructor Pizza Edition unblocked in fullscreen. The best puzzle gameplay. Free online game - no downloads required!","Stickman Bridge Constructor Pizza Edition, Stickman Bridge Constructor Fullscreen",8.9,39146,"Pizza Dev Team","March 2023",{"slug":163,"title":164,"image":165,"categories":166,"format":55,"url":167,"content":168,"description":169,"keywords":170,"rating":171,"votes":172,"developer":113,"platform":63,"lastUpdated":114},"stickman-climb-2","Stickman Climb 2","/media/stickman-climb-2.webp",[11,35],"https://23azostore.github.io/s6/stickman-climb-2/#abc","Stickman Climb 2 is a physics-based platformer where you control a stickman in a pot using a pickaxe to move. Swing your pickaxe to climb obstacles, jump over spikes, and reach the flag at the end of the level.\n\nThe game features challenging levels and funny physics. Play solo or race against a friend in multiplayer mode. Can you master the unique controls and conquer the mountains?","Play Stickman Climb 2 Pizza Edition unblocked in fullscreen. The best arcade gameplay. Free online game - no downloads required!","Stickman Climb 2 Pizza Edition, Stickman Climb 2 Fullscreen, Stickman Climb 2 unblocked",8.8,26412,{"slug":174,"title":175,"image":176,"categories":177,"format":55,"url":178,"content":179,"description":180,"keywords":181,"rating":74,"votes":182,"developer":88,"platform":63,"lastUpdated":148},"stickman-hook","Stickman Hook","/media/stickman-hook.webp",[11,32,35],"https://htmlxm.github.io/h/stickman-hook","Stickman Hook is a skill-based arcade game where you swing through levels like Spiderman. Tap to hook onto points and release to fly through the air.\n\nThe game features hundreds of levels with increasing difficulty. Use momentum and physics to navigate obstacles, bounce off pads, and cross the finish line. Can you master the swing and become the ultimate stickman hooker?","Play Stickman Hook Pizza Edition unblocked in fullscreen. The best arcade gameplay. Free online game - no downloads required!","Stickman Hook Pizza Edition, Stickman Hook Fullscreen, Stickman Hook unblocked, arcade games",35880,{"slug":184,"title":185,"image":186,"categories":187,"format":55,"url":188,"content":189,"description":190,"keywords":191,"rating":60,"votes":192,"developer":62,"platform":63,"lastUpdated":101},"temple-run-2","Temple Run 2","/media/temple-run-2.webp",[11,35],"https://htmlxm.github.io/h8/temple-run-2","Temple Run 2 - Pizza Edition github io Unblocked Games: Play instantly in fullscreen browser, no downloads, no ads. Enjoy various gaming experiences now!","Play Temple Run 2 unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Temple Run 2 Pizza Edition, Temple Run 2 Fullscreen, Temple Run 2 unblocked, arcade games",63170,{"slug":194,"title":195,"image":196,"categories":197,"format":55,"url":198,"content":199,"description":200,"keywords":201,"rating":202,"votes":203,"developer":160,"platform":63,"lastUpdated":204},"the-impossible-quiz","The Impossible Quiz","/media/the-impossible-quiz.webp",[17,35],"https://gswitch3.github.io/g8/the-impossible-quiz/","The Impossible Quiz is a legendary trivia game that tests your lateral thinking. Answer a series of absurd and tricky questions that will challenge your logic and patience.\n\nThe game features unexpected twists and hidden answers. Think outside the box, memorize the solutions, and try to reach the end with your lives intact. Can you beat the impossible?","The Impossible Quiz Pizza Edition: Play unblocked fullscreen. Enjoy this top puzzle game without downloads.","The Impossible Quiz Pizza Edition, The Impossible Quiz Fullscreen, The Impossible Quiz unblocked",8.7,12070,"December 2023",{"slug":206,"title":207,"image":208,"categories":209,"format":55,"url":210,"content":211,"description":212,"keywords":213,"rating":124,"votes":214,"developer":88,"platform":63,"lastUpdated":215},"worlds-hardest-game-2","World's Hardest Game 2","/media/worlds-hardest-game-2.webp",[17,35],"https://23azostore.github.io/s/worlds-hardest-game-2/","World's Hardest Game 2 lives up to its name by offering an even tougher challenge than the original. Guide the red square through a maze of moving blue circles and other deadly obstacles.\n\nThe game features 50 new levels that require pixel-perfect precision and split-second timing. It's a test of patience and skill. Can you complete all the levels without losing your mind?","Play World's Hardest Game 2 Pizza Edition unblocked in fullscreen. Master this puzzle challenge. Free online game - no downloads required!","World's Hardest Game 2 Pizza Edition, World's Hardest Game 2 Fullscreen",32275,"December 2024",{"slug":217,"title":218,"image":219,"categories":220,"format":55,"url":221,"content":222,"description":223,"keywords":224,"rating":225,"votes":226,"developer":88,"platform":63,"lastUpdated":227},"worlds-hardest-game-3","World's Hardest Game 3","/media/worlds-hardest-game-3.webp",[17,35],"https://23azostore.github.io/s/worlds-hardest-game-3/","World's Hardest Game 3 is the third installment in the notoriously difficult series. Navigate through impossible levels filled with enemies and traps designed to make you fail.\n\nThe game introduces new mechanics and level designs that will test even the most seasoned players. With zero margin for error, only the best can reach the end. Are you up for the challenge?","World's Hardest Game 3 Pizza Edition: Play unblocked fullscreen. Enjoy this top puzzle game without downloads.","World's Hardest Game 3 Pizza Edition, World's Hardest Game 3 Fullscreen",9,34046,"June 2024",1766151582809]