[{"data":1,"prerenderedAt":211},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-penalty-kick-online":40,"similar-penalty-kick-online":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"penalty-kick-online","Penalty Kick Online","/media/penalty-kick-online.webp",[35,26,17],"html5","https://23azostore.github.io/s/penalty-kick-online/","Penalty Kick Online is a multiplayer soccer game where you face off against players from around the world in penalty shootouts. Take turns shooting and saving goals to win the match.\n\nThe game features simple swipe controls and realistic physics. Predict your opponent's moves, time your shots perfectly, and climb the leaderboards in this intense soccer showdown.","Play Penalty Kick Online unblocked: Pizza Edition in full screen. A great sports game to play free online.","Penalty Kick Online Pizza Edition, Penalty Kick Online Fullscreen, Penalty Kick Online unblocked",8.4,26900,"Independent Developer",[54],"Desktop Web","March 2024",[57,70,84,97,110,123,137,150,161,175,187,198],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":52,"platform":68,"lastUpdated":69},"drive-mad","Drive Mad","/media/drive-mad.webp",[14,26,20],"https://lnahtml.github.io/a77/drive-mad/","Drive Mad is a compact physics‑based drive across uneven tracks where keeping the vehicle upright is the whole game. Bridges wobble, platforms tilt, and small jumps punish heavy landings. You feather the throttle, tap the brake to settle, and accept that patience solves more problems than speed.\n\nMoment to moment you’re managing weight: lean in before a ramp, lift to avoid a nose‑down crash, and correct mid‑air without oversteering. Levels escalate cleanly, and the best clears feel like tidy puzzles solved by good pacing. It’s playful, readable, and built for quick wins that stack up.","Experience Drive Mad Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting driving game. Start playing now!","Drive Mad Pizza Edition, Drive Mad Fullscreen, Drive Mad unblocked, driving games, play Drive Mad",9.6,27092,[54],"April 2024",{"slug":71,"title":72,"image":73,"categories":74,"format":45,"url":75,"content":76,"description":77,"keywords":78,"rating":79,"votes":80,"developer":81,"platform":82,"lastUpdated":83},"geometry-dash","Geometry Dash","/media/geometry-dash.webp",[11,26,20],"https://23azostore.github.io/s8/geometry-dash/","Geometry Dash is a rhythm-based platformer that will test your patience and skills. Jump and fly your way through danger in this rhythm-based action platformer!\n\nThe game features simple one-touch game play with many levels that will keep you entertained for hours. Use practice mode to sharpen your skills and unlock new icons and colors to customize your character.","Play Geometry Dash unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Geometry Dash Pizza Edition, Geometry Dash Fullscreen, Geometry Dash unblocked, arcade games",9.5,47094,"Pizza Dev Team",[54],"July 2024",{"slug":85,"title":86,"image":87,"categories":88,"format":45,"url":89,"content":90,"description":91,"keywords":92,"rating":50,"votes":93,"developer":94,"platform":95,"lastUpdated":96},"brain-test-tricky-puzzles","Brain Test Tricky Puzzles","/media/brain-test-tricky-puzzles.webp",[29,26,20],"https://23azostore.github.io/s2/brain-test-tricky-puzzles/","Brain Test: Tricky Puzzles is a collection of short, lateral‑thinking riddles where the obvious answer is rarely correct. You interact with the scene directly—drag items, combine them, move text, or reveal things hidden off screen—to find the trick that solves the level. The draw is the steady stream of small “aha” moments and the way even simple prompts hide playful solutions. If you’re stuck, read the question carefully, try manipulating the background, and consider whether the answer comes from an object you create rather than one already shown. It’s light, fast, and designed for quick sessions that feel satisfying when a stubborn level finally gives way.","Brain Test Tricky Puzzles Pizza Edition: Play unblocked fullscreen. Enjoy this top puzzle game without downloads.","Brain Test Tricky Puzzles Pizza Edition, Brain Test Tricky Puzzles Fullscreen",65174,"Pizza Editione",[54],"June 2024",{"slug":98,"title":99,"image":100,"categories":101,"format":45,"url":102,"content":103,"description":104,"keywords":105,"rating":106,"votes":107,"developer":52,"platform":108,"lastUpdated":109},"12-minibattles","12 MiniBattles","/media/12-minibattles.webp",[11,17],"https://23azostore.github.io/s2/12-minibattles/","12 MiniBattles captures the joy of couch competition in its purest form: two players, one button each, and a carousel of bite‑size challenges that flip the rules every round. One moment you’re angling a toe‑poke past a frantic goalkeeper, the next you’re timing a leap in an archery duel or baiting a rival tank onto a cliff. The physics are playful but consistent, so the difference between chaos and control is learning the rhythm and trusting your timing.\n\nWhat makes it sticky is the speed. Rounds last seconds, momentum swings fast, and that single well‑timed press can feel like a masterstroke when the crowd erupts. You don’t need to memorize systems or grind unlocks; the fun comes from reading each scenario and improvising under pressure. It’s the kind of game that turns a quiet evening into a tournament where \"best of five\" becomes \"best of twenty\" without anyone noticing—easy to start, hard to stop, and perfectly tuned for laughter, grudge matches, and tiny comebacks that feel huge.","Play 12 MiniBattles Pizza Edition unblocked in fullscreen. Master this arcade challenge. Free online game - no downloads required!","12 MiniBattles Pizza Edition, 12 MiniBattles Fullscreen, 12 MiniBattles unblocked, arcade games",9.1,31028,[54],"January 2023",{"slug":111,"title":112,"image":113,"categories":114,"format":45,"url":115,"content":116,"description":117,"keywords":118,"rating":119,"votes":120,"developer":94,"platform":121,"lastUpdated":122},"4th-and-goal-2022","4th and Goal 2022","/media/4th-and-goal-2022.webp",[35,20,17],"https://23azostore.github.io/s2/4th-and-goal-2022/","4th and Goal 2022 distills American football into brisk drives and meaningful decisions. The playbook is compact but expressive: inside runs to set a rhythm, option looks that punish over‑pursuit, and timing routes that reward a calm read when a safety bites. On defense, a well‑chosen blitz can flip a possession, while disciplined coverage squeezes windows until a hurried throw invites a takeaway.\n\nModes range from quick games to deeper playoff runs, and the tone stays consistent—intuitive controls, short possessions, and enough tactical space that smart play‑calling tells. Drives hinge on small choices: take the yards and bleed the clock, or push for a dagger before the half; pin them deep with field position, or gamble on fourth down when momentum is yours. Red‑zone snaps carry that familiar knot in the stomach, and touchdowns feel earned rather than scripted. It’s football trimmed to essentials, lively and readable, where a season’s story is written in a handful of clutch plays.","Play 4th and Goal 2022 unblocked: Pizza Edition in full screen. A great sports game to play free online.","4th and Goal 2022 Pizza Edition, 4th and Goal 2022 Fullscreen, 4th and Goal 2022 unblocked",9.2,19856,[54],"April 2023",{"slug":124,"title":125,"image":126,"categories":127,"format":45,"url":128,"content":129,"description":130,"keywords":131,"rating":132,"votes":133,"developer":134,"platform":135,"lastUpdated":136},"8-ball-pool","8 Ball Pool","/media/8-ball-pool.webp",[35,26,17],"https://sudoku-online.github.io/a8/8-ball-pool/","8 Ball Pool turns a familiar barroom duel into a sleek ladder of quick matches and steady progression. Breaks matter—set the rack moving cleanly and you’ll find patterns faster. From there it’s a lesson in touch: soft shots that nurse position, draw that opens angles on the next ball, and the quiet confidence to take a long cut when the table calls for it. Physics are crisp, so a good stroke feels honest, and mistakes teach immediately.\n\nAs your aim improves, the rooms change, stakes rise, and tournaments test whether you can string frames under pressure. Coins unlock cues and venues, but the heart stays in the geometry—finding routes that keep you in control and refusing the hero shot when the safety is wiser. Matches are short enough to fit a break and deep enough to be satisfying, and momentum can flip on a single great pot. It’s pool for the modern moment—accessible in seconds, endlessly replayable, and always nudging you toward cleaner lines.","8 Ball Pool Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","8 Ball Pool Pizza Edition, 8 Ball Pool Fullscreen, 8 Ball Pool unblocked, sports games",8.9,10188,"Game Studio",[54],"May 2023",{"slug":138,"title":139,"image":140,"categories":141,"format":45,"url":142,"content":143,"description":144,"keywords":145,"rating":146,"votes":147,"developer":52,"platform":148,"lastUpdated":149},"a-small-world-cup","A Small World Cup","/media/a-small-world-cup.webp",[35,17],"https://23azostore.github.io/s2/a-small-world-cup/","A Small World Cup is soccer reimagined as a ragdoll duel, equal parts slapstick and strategy. You drag to aim a full‑body lunge, release, and your solitary player rockets across the pitch—sometimes threading a perfect shot, sometimes pinwheeling into the post to howls of laughter. The controls are simple, but the timing isn’t; angles off the boards, recovery windows, and feints that bait an over‑commit all matter when a match tightens.\n\nModes capture the tournament mood in miniature, from sudden‑death thrillers to full brackets that fit neatly into a short session. Beneath the chaos is a core of honest competition: the better read wins more often, and a last‑second volley can swing a game from despair to delight. It’s quick, silly, and unexpectedly deep—the kind of game that fills a room with noise, then goes quiet for a heartbeat as the ball arcs toward the net.","Play A Small World Cup Pizza Edition unblocked in fullscreen. Enjoy this exciting sports game. Free online game - no downloads required!","A Small World Cup Pizza Edition, A Small World Cup Fullscreen, A Small World Cup unblocked",8.5,44327,[54],"July 2023",{"slug":151,"title":152,"image":153,"categories":154,"format":45,"url":155,"content":156,"description":157,"keywords":158,"rating":132,"votes":159,"developer":81,"platform":160,"lastUpdated":69},"air-hockey-championship-deluxe","Air Hockey Championship Deluxe","/media/air-hockey-championship-deluxe.webp",[35,17],"https://23azostore.github.io/s2/air-hockey-championship-deluxe/","Air Hockey Championship Deluxe trims multiplayer competition down to reflex and geometry. First to seven takes the game, and every face‑off is a lesson in reading rebounds—bank a shot off the boards to open a lane, bait a gap with a soft touch, then meet the return with a clean block that turns defense into attack. Solo play offers steady practice; across the table, two‑player duels swing on a single perfect slap.\n\nUnlockable pucks and tables add personality without getting in the way of what matters: responsive control, brisk points, and that satisfying thunk when a shot rockets home. It’s easy to pick up and hard to truly dominate, the kind of match that starts as a quick break and ends five games later because neither side can bear to leave the last one undecided.","Play Air Hockey Championship Deluxe Pizza Edition unblocked in fullscreen. The best sports gameplay. Free online game - no downloads required!","Air Hockey Championship Deluxe Pizza Edition, Air Hockey Championship Deluxe Fullscreen",35137,[54],{"slug":162,"title":163,"image":164,"categories":165,"format":45,"url":166,"content":167,"description":168,"keywords":169,"rating":170,"votes":171,"developer":172,"platform":173,"lastUpdated":174},"among-us","Among Us","/media/among-us.webp",[38,26,17],"https://ovo-game.github.io/o/among-us/","Among Us is a social deduction game where a team of crewmates tries to complete simple tasks while one or more impostors work to stop them. Each round plays out in short bursts of movement and discussion: fix a sabotage, finish a task, or report a body and talk through what you’ve seen. Crewmates win by finishing all tasks or voting out the impostors; impostors win by causing enough chaos and eliminating the crew without being caught.\n\nIt’s easy to understand after a few matches and scales well with different group sizes. Maps change the layout of tasks and travel routes, and small settings tweaks can make games faster or more methodical. The appeal is in the stories that form—alibis that don’t add up, quiet players who turn out to be sharp observers, and those tense moments around the emergency button when suspicion swings from one person to another.","Play Among Us Pizza Edition unblocked in fullscreen. Enjoy this exciting strategy game. Free online game - no downloads required!","Among Us Pizza Edition, Among Us Fullscreen, Among Us unblocked, strategy games, play Among Us",9,21669,"Pizza Edition",[54],"September 2024",{"slug":176,"title":177,"image":178,"categories":179,"format":45,"url":180,"content":181,"description":182,"keywords":183,"rating":146,"votes":184,"developer":172,"platform":185,"lastUpdated":186},"aqua-thrills","Aqua Thrills","/media/aqua-thrills.webp",[11,17],"https://23azostore.github.io/s2/aqua-thrills/","Aqua Thrills is a fast water‑slide racer about simple steering and good timing. You guide a tube down long, winding slides, adjust left and right to hold a line, and bump rivals when you need space. Races are short and forgiving at first, then add tighter curves, faster sections, and hazards that ask for cleaner inputs.\n\nProgress brings new parks, slides, and cosmetic unlocks. The controls stay straightforward, which makes it easy to jump in for a few runs and see improvement quickly. If you enjoy lightweight racing with clear feedback and quick restarts, it scratches that itch well without getting complicated.","Play Aqua Thrills unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Aqua Thrills Pizza Edition, Aqua Thrills Fullscreen, Aqua Thrills unblocked, arcade games",22681,[54],"March 2023",{"slug":188,"title":189,"image":190,"categories":191,"format":45,"url":192,"content":193,"description":194,"keywords":195,"rating":132,"votes":196,"developer":94,"platform":197,"lastUpdated":69},"archery-world-tour","Archery World Tour","/media/archery-world-tour.webp",[35],"https://23azostore.github.io/s/archery-world-tour/","Archery World Tour focuses on clean, readable shots and small adjustments that matter. You aim at targets across different ranges and account for wind that can push an arrow off line. Later stages add moving and rotating targets or partial cover, so you learn to set power and angle with a bit more care.\n\nOutside the main tour, a balloon challenge mode offers quick practice runs that emphasize judging drift and release timing. The format is straightforward, the feedback is clear, and landing a centered shot is consistently satisfying.","Archery World Tour Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","Archery World Tour Pizza Edition, Archery World Tour Fullscreen, Archery World Tour unblocked",40059,[54],{"slug":199,"title":200,"image":201,"categories":202,"format":45,"url":203,"content":204,"description":205,"keywords":206,"rating":207,"votes":208,"developer":172,"platform":209,"lastUpdated":210},"athletics-hero","Athletics Hero","/media/athletics-hero.webp",[35],"https://23azostore.github.io/s2/athletics-hero/","Athletics Hero offers a compact set of track‑and‑field events built around timing. The 100m asks for rhythmic inputs to keep speed, javelin rewards a clean release at the right angle, and triple jump leans on measured steps and a controlled final push. Each event explains its prompts clearly and gives immediate feedback when you mistime an action or overpower a throw.\n\nSessions are short, so it’s easy to chase medals and try again. As you improve, the difference between silver and gold usually comes down to one good start or a better release window, which keeps retries focused and satisfying.","Experience Athletics Hero Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting sports game. Start playing now!","Athletics Hero Pizza Edition, Athletics Hero Fullscreen, Athletics Hero unblocked, sports games",9.4,26120,[54],"June 2023",1766850284897]