[{"data":1,"prerenderedAt":179},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-chicken-merge":40,"similar-chicken-merge":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"chicken-merge","Chicken Merge","/media/chicken-merge.webp",[38],"html5","https://23azostore.github.io/s4/chicken-merge/","Chicken Merge mixes idle merging with light defense. You place chickens on slots to shoot approaching targets, then drag identical units together to create stronger ones. Waves escalate gradually, and coins earned during play fund more slots and upgrades, which keep the board feeling busy without demanding constant micromanagement.\n\nThe moment‑to‑moment decisions are simple—merge now for immediate damage or hold pieces to combine later into a bigger tier; reposition a strong unit to cover a weak lane; invest in economy or in firepower. Progress comes in steady steps, and small optimizations turn into noticeable gains. It’s a pleasant loop that works for brief sessions and longer stretches, with clear feedback and enough variety to stay engaging.","Play Chicken Merge Pizza Edition unblocked in fullscreen. Master this strategy challenge. Free online game - no downloads required!","Chicken Merge Pizza Edition, Chicken Merge Fullscreen, Chicken Merge unblocked, strategy games",8.9,58075,"Pizza Edition",[54],"Desktop Web","June 2023",[57,70,84,98,110,123,135,149,164],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":52,"platform":68,"lastUpdated":69},"among-us","Among Us","/media/among-us.webp",[38,26,17],"https://ovo-game.github.io/o/among-us/","Among Us is a social deduction game where a team of crewmates tries to complete simple tasks while one or more impostors work to stop them. Each round plays out in short bursts of movement and discussion: fix a sabotage, finish a task, or report a body and talk through what you’ve seen. Crewmates win by finishing all tasks or voting out the impostors; impostors win by causing enough chaos and eliminating the crew without being caught.\n\nIt’s easy to understand after a few matches and scales well with different group sizes. Maps change the layout of tasks and travel routes, and small settings tweaks can make games faster or more methodical. The appeal is in the stories that form—alibis that don’t add up, quiet players who turn out to be sharp observers, and those tense moments around the emergency button when suspicion swings from one person to another.","Play Among Us Pizza Edition unblocked in fullscreen. Enjoy this exciting strategy game. Free online game - no downloads required!","Among Us Pizza Edition, Among Us Fullscreen, Among Us unblocked, strategy games, play Among Us",9,21669,[54],"September 2024",{"slug":71,"title":72,"image":73,"categories":74,"format":45,"url":75,"content":76,"description":77,"keywords":78,"rating":79,"votes":80,"developer":81,"platform":82,"lastUpdated":83},"merge-cyber-racers","Merge Cyber Racers","/media/merge-cyber-racers.webp",[14,38],"https://htmlxm.github.io/h5/merge-cyber-racers","Merge Cyber Racers is a futuristic idle game where you merge cars to create faster and more advanced vehicles. Build your fleet of cyber racers and earn money as they race around the track.\n\nThe game combines merging mechanics with racing management. Unlock new cars, upgrade your track, and become a tycoon in the world of cyber racing.","Play Merge Cyber Racers Pizza Edition unblocked in fullscreen. Enjoy this exciting driving game. Free online game - no downloads required!","Merge Cyber Racers Pizza Edition, Merge Cyber Racers Fullscreen, Merge Cyber Racers unblocked",8.8,26795,"Pizza Editione",[54],"July 2024",{"slug":85,"title":86,"image":87,"categories":88,"format":45,"url":89,"content":90,"description":91,"keywords":92,"rating":93,"votes":94,"developer":95,"platform":96,"lastUpdated":97},"merge-round-racers","Merge Round Racers","/media/merge-round-racers.webp",[14,38],"https://htmlxm.github.io/h7/merge-round-racers","Merge Round Racers is an idle merging game where you manage a team of racing cars. Purchase vehicles, merge identical ones to upgrade them, and let them race to earn coins.\n\nThe game features a simple yet addictive loop of buying, merging, and racing. Expand your garage, unlock high-level cars, and maximize your earnings in this fun simulation game.","Experience Merge Round Racers Pizza Edition unblocked! Play fullscreen on PizaGame. The best driving gameplay. Start playing now!","Merge Round Racers Pizza Edition, Merge Round Racers Fullscreen, Merge Round Racers unblocked",8.6,35866,"Pizza Dev Team",[54],"April 2024",{"slug":99,"title":100,"image":101,"categories":102,"format":45,"url":103,"content":104,"description":105,"keywords":106,"rating":66,"votes":107,"developer":52,"platform":108,"lastUpdated":109},"paper-io-2","Paper Io 2","/media/paper-io-2.webp",[38,17],"https://htmlxm.github.io/h9/paper-io-2/","Paper.io 2 is a popular multiplayer IO game where you compete to conquer the most territory. Move your character to draw lines and enclose areas to claim them as your own.\n\nThe game requires strategy and quick reflexes. Steal territory from other players, but be careful not to let them cross your trail while you are outside your safe zone. Can you dominate the map and become the king of Paper.io?","Experience Paper Io 2 Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting strategy game. Start playing now!","Paper Io 2 Pizza Edition, Paper Io 2 Fullscreen, Paper Io 2 unblocked, strategy games",54208,[54],"May 2024",{"slug":111,"title":112,"image":113,"categories":114,"format":45,"url":115,"content":116,"description":117,"keywords":118,"rating":119,"votes":120,"developer":81,"platform":121,"lastUpdated":122},"master-chess","Master Chess","/media/master-chess.webp",[29,38,17],"https://htmlxm.github.io/h7/master-chess/","Master Chess is a classic board game that tests your strategic thinking and foresight. Play against the computer or a friend in this timeless battle of wits.\n\nThe game features multiple difficulty levels and a clean interface. Whether you're a beginner learning the moves or a grandmaster looking for a challenge, Master Chess offers a rewarding experience.","Play Master Chess unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Master Chess Pizza Edition, Master Chess Fullscreen, Master Chess unblocked, puzzle games",9.7,10722,[54],"July 2023",{"slug":124,"title":125,"image":126,"categories":127,"format":45,"url":128,"content":129,"description":130,"keywords":131,"rating":93,"votes":132,"developer":95,"platform":133,"lastUpdated":134},"stick-merge","Stick Merge","/media/stick-merge.webp",[32,38],"https://htmlxm.github.io/h3/stick-merge","Stick Merge is a casual action game where you merge weapons to create more powerful guns. Take control of a stickman agent and eliminate waves of enemies in fast-paced shootouts.\n\nThe game features a variety of weapons and upgrades. Combine your guns, improve your stats, and become the ultimate stickman warrior in this addictive merge game.","Play Stick Merge Pizza Edition unblocked in fullscreen. Enjoy this exciting shooting game. Free online game - no downloads required!","Stick Merge Pizza Edition, Stick Merge Fullscreen, Stick Merge unblocked, shooting games",22436,[54],"November 2024",{"slug":136,"title":137,"image":138,"categories":139,"format":45,"url":140,"content":141,"description":142,"keywords":143,"rating":50,"votes":144,"developer":145,"keybindings":146,"platform":147,"lastUpdated":148},"minecraft-188","Minecraft 1.8.8","/media/minecraft-188.webp",[8,38,17,20],"https://htmlxm.github.io/h7/minecraft-1.8.8","Step into the ultimate sandbox experience with Minecraft 1.8.8, often celebrated as one of the most stable and classic versions of the game. Whether you are building massive structures in Creative Mode or fighting to survive the night in Survival Mode, this version offers the core Minecraft experience with classic combat mechanics and world generation. Explore infinite biomes, mine deep for diamonds, and craft tools to shape the world around you. This web-optimized version allows you to jump straight into the blocky adventure without any downloads.","Minecraft 1.8.8 : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Minecraft 1.8.8 Pizza Edition, Minecraft 1.8.8 Fullscreen, Minecraft 1.8.8 unblocked, arcade games",37468,"Mojang Studios","WASD: Move\nSpace: Jump\nShift: Sneak\nLeft Click: Mine/Attack\nRight Click: Place Block/Use Item\nE: Open Inventory\nQ: Drop Item\n1-9: Hotbar Slots",[54],"February 2025",{"slug":150,"title":151,"image":152,"categories":153,"format":45,"url":154,"content":155,"description":156,"keywords":157,"rating":158,"votes":159,"developer":160,"keybindings":161,"platform":162,"lastUpdated":163},"tank-trouble-2","Tank Trouble 2","/media/tank-trouble-2.webp",[32,17,38,20],"https://htmlxm.github.io/h8/tank-trouble-2","Tank Trouble 2 is an addictive maze-based tank battle game that thrives on chaos and precision. Face off against the clever Laika bot or challenge up to two friends in intense local multiplayer matches. The objective is simple: navigate the maze and shoot your opponents. However, be careful—your bullets bounce off walls and can just as easily take you out as they do your enemies! With simple graphics and fast-paced gameplay, it's the perfect title for quick, competitive fun.","Tank Trouble 2 : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Tank Trouble 2 Pizza Edition, Tank Trouble 2 Fullscreen, Tank Trouble 2 unblocked, arcade games",8.5,76822,"MadPurav","Player 1: ESDF to move, Q to shoot\nPlayer 2: Arrow Keys to move, M to shoot\nPlayer 3: Mouse to move and click to shoot",[54],"January 2025",{"slug":165,"title":166,"image":167,"categories":168,"format":45,"url":169,"content":170,"description":171,"keywords":172,"rating":173,"votes":174,"keybindings":175,"developer":176,"platform":177,"lastUpdated":178},"bitlife","Bitlife","/media/bitlife.webp",[38,8,20],"https://htmlxm.github.io/h/bitlife","BitLife is a text-based life simulator that allows you to live a thousand lives in one. Starting from birth, every choice you make—from working hard in school and finding a dream job to committing daring heists or finding true love—dictates your character's unique story. The game is packed with dark humor and unpredictable scenarios; one day you might be a famous movie star, and the next, you could be fleeing from the law. With deep RPG mechanics including health, happiness, smarts, and looks, BitLife challenges you to balance your stats while navigating the complexities of adulthood. It's a fascinating 'what-if' machine that offers endless replayability and hilarious outcomes.","BitLife : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Bitlife Pizza Edition, Bitlife Fullscreen, Bitlife unblocked, arcade games",9.5,49252,"Mouse: Click to make choices; Keyboard: Enter to confirm selections","Candywriter, LLC",[54],"September 2025",1766592030338]