[{"data":1,"prerenderedAt":59},["ShallowReactive",2],{"game-chicken-merge":3,"similar-chicken-merge":12},{"slug":4,"title":5,"description":6,"image":7,"categories":8,"format":10,"url":11},"chicken-merge","Chicken Merge","Chicken Merge mixes idle merging with light defense. You place chickens on slots to shoot approaching targets, then drag identical units together to create stronger ones. Waves escalate gradually, and coins earned during play fund more slots and upgrades, which keep the board feeling busy without demanding constant micromanagement.\n\nThe moment‑to‑moment decisions are simple—merge now for immediate damage or hold pieces to combine later into a bigger tier; reposition a strong unit to cover a weak lane; invest in economy or in firepower. Progress comes in steady steps, and small optimizations turn into noticeable gains. It’s a pleasant loop that works for brief sessions and longer stretches, with clear feedback and enough variety to stay engaging.","/media/chicken-merge.webp",[9],"strategy","html5","https://23azostore.github.io/s4/chicken-merge/",[13,21,29,36,43,51],{"slug":14,"title":15,"description":16,"image":17,"categories":18,"format":10,"url":20},"among-us","Among Us","Among Us is a social deduction game where a team of crewmates tries to complete simple tasks while one or more impostors work to stop them. Each round plays out in short bursts of movement and discussion: fix a sabotage, finish a task, or report a body and talk through what you’ve seen. Crewmates win by finishing all tasks or voting out the impostors; impostors win by causing enough chaos and eliminating the crew without being caught.\n\nIt’s easy to understand after a few matches and scales well with different group sizes. Maps change the layout of tasks and travel routes, and small settings tweaks can make games faster or more methodical. The appeal is in the stories that form—alibis that don’t add up, quiet players who turn out to be sharp observers, and those tense moments around the emergency button when suspicion swings from one person to another.","/media/among-us.webp",[9,19],"popular","https://amongusplay.online/",{"slug":22,"title":23,"description":24,"image":25,"categories":26,"format":10,"url":28},"merge-cyber-racers","Merge Cyber Racers","Merge Cyber Racers is a futuristic idle game where you merge cars to create faster and more advanced vehicles. Build your fleet of cyber racers and earn money as they race around the track.\n\nThe game combines merging mechanics with racing management. Unlock new cars, upgrade your track, and become a tycoon in the world of cyber racing.","/media/merge-cyber-racers.webp",[27,9],"driving","https://8fat.com/iframe/Merge-Cyber-Racers",{"slug":30,"title":31,"description":32,"image":33,"categories":34,"format":10,"url":35},"merge-round-racers","Merge Round Racers","Merge Round Racers is an idle merging game where you manage a team of racing cars. Purchase vehicles, merge identical ones to upgrade them, and let them race to earn coins.\n\nThe game features a simple yet addictive loop of buying, merging, and racing. Expand your garage, unlock high-level cars, and maximize your earnings in this fun simulation game.","/media/merge-round-racers.webp",[27,9],"https://g.vseigru.net/9/igra-sliyanie-koltsevye-gonki/",{"slug":37,"title":38,"description":39,"image":40,"categories":41,"format":10,"url":42},"paper-io-2","Paper Io 2","Paper.io 2 is a popular multiplayer IO game where you compete to conquer the most territory. Move your character to draw lines and enclose areas to claim them as your own.\n\nThe game requires strategy and quick reflexes. Steal territory from other players, but be careful not to let them cross your trail while you are outside your safe zone. Can you dominate the map and become the king of Paper.io?","/media/paper-io-2.webp",[9],"https://htmlxm.github.io/h9/paper-io-2/",{"slug":44,"title":45,"description":46,"image":47,"categories":48,"format":10,"url":50},"master-chess","Master Chess","Master Chess is a classic board game that tests your strategic thinking and foresight. Play against the computer or a friend in this timeless battle of wits.\n\nThe game features multiple difficulty levels and a clean interface. Whether you're a beginner learning the moves or a grandmaster looking for a challenge, Master Chess offers a rewarding experience.","/media/master-chess.webp",[49,9],"puzzle","https://htmlxm.github.io/h7/master-chess/",{"slug":52,"title":53,"description":54,"image":55,"categories":56,"format":10,"url":58},"stick-merge","Stick Merge","Stick Merge is a casual action game where you merge weapons to create more powerful guns. Take control of a stickman agent and eliminate waves of enemies in fast-paced shootouts.\n\nThe game features a variety of weapons and upgrades. Combine your guns, improve your stats, and become the ultimate stickman warrior in this addictive merge game.","/media/stick-merge.webp",[57,9],"shooting","https://ext.minijuegosgratis.com/stick-merge/index.html",1765458184656]