[{"data":1,"prerenderedAt":204},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"$fu26v6W_Cez6Lym8r-4KmC4wxX1CSVgEfFrHh6PynxVk":37,"$fiC1uLRpkHJIzLfXLQ1QIxL0erKqQK4WQLbTmNsupRmc":49},[4,7,10,13,16,19,22,25,28,31,34],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"puzzle","Puzzle",{"slug":20,"name":21},"shooting","Shooting",{"slug":23,"name":24},"sports","Sports",{"slug":26,"name":27},"strategy","Strategy",{"slug":29,"name":30},"new","New",{"slug":32,"name":33},"popular","Popular",{"slug":35,"name":36},"originals","Originals",[38,39,40,41,42,43,44,45,46,47,48],{"slug":5,"name":6},{"slug":8,"name":9},{"slug":11,"name":12},{"slug":14,"name":15},{"slug":17,"name":18},{"slug":20,"name":21},{"slug":23,"name":24},{"slug":26,"name":27},{"slug":29,"name":30},{"slug":32,"name":33},{"slug":35,"name":36},[50,60,69,78,87,96,105,114,123,132,141,150,159,168,177,186,195],{"slug":51,"title":52,"image":53,"categories":54,"format":55,"url":56,"content":57,"description":58,"keywords":59},"cannon-strike","Cannon Strike","/media/cannon-strike.webp",[20],"html5","https://gamaverse.com/c/f/g/cannon-strike/","Cannon Strike is a physics puzzle about firing pellets into a container while the path changes around you. You set angle and timing from a fixed cannon, then watch pellets bounce off surfaces, slip through rotating bars, and settle—if you judged correctly—where you need them. Early levels are forgiving, but later layouts ask for tighter shots and a better sense of how motion will carry after a bounce.\n\nMoment to moment you’re deciding whether to shoot now or wait for a safer alignment. The game respects patience; a clean release is usually better than brute force. Limited ammo or stricter thresholds show up as you progress, which encourages smarter planning rather than rushing. It’s the kind of puzzle where each success feels earned, and small adjustments lead to reliable solutions without trial‑and‑error grind.","Experience Cannon Strike Pizza Edition unblocked! Play fullscreen on PizaGame. Master this shooting challenge. Start playing now!","Cannon Strike Pizza Edition, Cannon Strike Fullscreen, Cannon Strike unblocked, shooting games",{"slug":61,"title":62,"image":63,"categories":64,"format":55,"url":65,"content":66,"description":67,"keywords":68},"free-kick-shooter","Free Kick Shooter","/media/free-kick-shooter.webp",[20,23],"https://23azostore.github.io/s4/free-kick-shooter/","Free Kick Shooter tests your accuracy and precision as you take free kicks from various positions on the field. You have to account for wind direction and the goalkeeper’s movements to curl the ball into the net. As you progress, the challenges get harder with more defenders and tricky angles.\n\nThe game features a simple swipe-to-shoot mechanic that feels satisfying to master. It’s an addictive sports game that lets you live out the fantasy of scoring the winning goal in a high-pressure situation.","Play Free Kick Shooter unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Free Kick Shooter Pizza Edition, Free Kick Shooter Fullscreen, Free Kick Shooter unblocked",{"slug":70,"title":71,"image":72,"categories":73,"format":55,"url":74,"content":75,"description":76,"keywords":77},"getaway-shootout","Getaway Shootout","/media/getaway-shootout.webp",[20],"https://23azostore.github.io/s4/getaway-shootout/","Getaway Shootout is a frantic two-player game where you race to the helicopter to escape. Jump, shoot, and use power-ups to hinder your opponents in a chaotic dash for freedom.\n\nThe game features ragdoll physics and hilarious movement mechanics. Play against the computer or a friend in local multiplayer and see who can make the getaway first.","Getaway Shootout Pizza Edition: Play unblocked fullscreen. Enjoy this top shooting game without downloads.","Getaway Shootout Pizza Edition, Getaway Shootout Fullscreen, Getaway Shootout unblocked",{"slug":79,"title":80,"image":81,"categories":82,"format":55,"url":83,"content":84,"description":85,"keywords":86},"hammer-2-reloaded","Hammer 2 Reloaded","/media/hammer-2-reloaded.webp",[20],"https://23azostore.github.io/s4/hammer-2-reloaded/","Hammer 2 Reloaded is a third‑person action shooter set in a gritty city. You control a vigilante clearing the streets of bad guys, using guns, melee attacks, and vehicles to get the job done. The action is chaotic and open—you can hijack cars, blow up barrels, and use the environment to take cover.\n\nMoment to moment you’re constantly moving, switching targets, and looking for better weapons or a getaway car. Missions give you specific goals, but the fun often comes from the unscripted mess of a shootout going wrong and you improvising a way out. It’s a sandbox of destruction that doesn’t take itself too seriously.","Experience Hammer 2 Reloaded Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting shooting game. Start playing now!","Hammer 2 Reloaded Pizza Edition, Hammer 2 Reloaded Fullscreen, Hammer 2 Reloaded unblocked",{"slug":88,"title":89,"image":90,"categories":91,"format":55,"url":92,"content":93,"description":94,"keywords":95},"masked-forces","Masked Forces","/media/masked-forces.webp",[20],"https://23azostore.github.io/s8/masked-forces/","Masked Forces is a tactical first-person shooter where you fight for survival in various game modes. Join a team or go solo in intense battles against other players or AI bots.\n\nThe game features a wide arsenal of weapons, armor, and upgrades. Customize your loadout and use strategy to outsmart your enemies in this fast-paced shooter.","Play Masked Forces unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Masked Forces Pizza Edition, Masked Forces Fullscreen, Masked Forces unblocked, shooting games",{"slug":97,"title":98,"image":99,"categories":100,"format":55,"url":101,"content":102,"description":103,"keywords":104},"neon-war","Neon War","/media/neon-war.webp",[20,29],"https://unblocked-games.s3.amazonaws.com/games/2024/q/7/neon-war/index.html","Neon War is an arcade shooter where you defend your base against waves of neon shapes. Control a cannon, shoot down falling enemies, and upgrade your firepower to survive longer.\n\nThe game features vibrant neon graphics and increasingly difficult levels. Collect coins to unlock new cannons and power-ups. Test your reflexes and strategy in this colorful and addictive defense game.","Play Neon War unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Neon War Pizza Edition, Neon War Fullscreen, Neon War unblocked, shooting games, play Neon War",{"slug":106,"title":107,"image":108,"categories":109,"format":55,"url":110,"content":111,"description":112,"keywords":113},"penalty-shooters-2","Penalty Shooters 2","/media/penalty-shooters-2.webp",[20,23],"https://23azostore.github.io/s6/penalty-shooters-2/","Penalty Shooters 2 lets you choose your favorite team and compete in fantasy leagues. Master the art of penalty kicks and goalkeeping to lead your team to victory.\n\nThe game features hundreds of teams from various leagues. Score goals, make spectacular saves, and progress through the tournament bracket to win the championship trophy.","Play Penalty Shooters 2 unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Penalty Shooters 2 Pizza Edition, Penalty Shooters 2 Fullscreen, Penalty Shooters 2 unblocked",{"slug":115,"title":116,"image":117,"categories":118,"format":55,"url":119,"content":120,"description":121,"keywords":122},"pixwars-2","PixWars 2","/media/pixwars-2.webp",[20],"https://23azostore.github.io/s6/pixwars-2/","PixWars 2 is a multiplayer shooter set in a blocky pixel world. Join a room and fight against other players and hordes of zombies. Choose from a variety of weapons and vehicles to dominate the battlefield.\n\nThe game features a large map to explore, different character skins, and intense combat action. Survive the zombie apocalypse and the enemy fire to be the last one standing.","Play PixWars 2 unblocked: Pizza Edition in full screen. A great shooting game to play free online.","PixWars 2 Pizza Edition, PixWars 2 Fullscreen, PixWars 2 unblocked, shooting games, play PixWars 2",{"slug":124,"title":125,"image":126,"categories":127,"format":55,"url":128,"content":129,"description":130,"keywords":131},"raft-wars","Raft Wars","/media/raft-wars.webp",[20],"https://webglmath.github.io/raft-wars/","Raft Wars - Pizza Edition github io Unblocked Games: Play instantly in fullscreen browser, no downloads, no ads. Enjoy various gaming experiences now!","Experience Raft Wars Pizza Edition unblocked! Play fullscreen on PizaGame. Master this shooting challenge. Start playing now!","Raft Wars Pizza Edition, Raft Wars Fullscreen, Raft Wars unblocked, shooting games, play Raft Wars",{"slug":133,"title":134,"image":135,"categories":136,"format":55,"url":137,"content":138,"description":139,"keywords":140},"rooftop-snipers","Rooftop Snipers","/media/rooftop-snipers.webp",[20,32],"https://rooftop-snipers.github.io/file/","Rooftop Snipers is a chaotic two-player shooting game where you must shoot your opponent off the roof. Jump and shoot to avoid getting hit while trying to land a shot on your enemy.\n\nThe game features simple one-button controls and ragdoll physics, leading to hilarious and unpredictable battles. Play against the AI or a friend in this fast-paced and addictive sniper duel.","Play Rooftop Snipers Pizza Edition unblocked in fullscreen. Enjoy this exciting shooting game. Free online game - no downloads required!","Rooftop Snipers Pizza Edition, Rooftop Snipers Fullscreen, Rooftop Snipers unblocked",{"slug":142,"title":143,"image":144,"categories":145,"format":55,"url":146,"content":147,"description":148,"keywords":149},"rooftop-snipers-2","Rooftop Snipers 2","/media/rooftop-snipers-2.webp",[20],"https://htmlxm.github.io/h6/rooftop-snipers-2/","Rooftop Snipers 2 is the sequel to the popular shooting game, bringing more chaos and excitement to the rooftops. Dual against your friends or the AI with new weapons, skins, and game modes.\n\nThe game retains the simple controls and ragdoll physics of the original but adds more variety and challenges. Can you master the art of rooftop sniping and become the ultimate champion?","Play Rooftop Snipers 2 Pizza Edition unblocked in fullscreen. Fun shooting action. Free online game - no downloads required!","Rooftop Snipers 2 Pizza Edition, Rooftop Snipers 2 Fullscreen, Rooftop Snipers 2 unblocked",{"slug":151,"title":152,"image":153,"categories":154,"format":55,"url":155,"content":156,"description":157,"keywords":158},"stick-defenders","Stick Defenders","/media/stick-defenders.webp",[20,35],"https://23azostore.github.io/s6/stick-defenders/","Stick Defenders - Pizza Edition github io Unblocked Games: Play instantly in fullscreen browser, no downloads, no ads. Enjoy games now!","Play Stick Defenders unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Stick Defenders Pizza Edition, Stick Defenders Fullscreen, Stick Defenders unblocked",{"slug":160,"title":161,"image":162,"categories":163,"format":55,"url":164,"content":165,"description":166,"keywords":167},"stick-merge","Stick Merge","/media/stick-merge.webp",[20,26],"https://ext.minijuegosgratis.com/stick-merge/index.html","Stick Merge is a casual action game where you merge weapons to create more powerful guns. Take control of a stickman agent and eliminate waves of enemies in fast-paced shootouts.\n\nThe game features a variety of weapons and upgrades. Combine your guns, improve your stats, and become the ultimate stickman warrior in this addictive merge game.","Play Stick Merge Pizza Edition unblocked in fullscreen. Enjoy this exciting shooting game. Free online game - no downloads required!","Stick Merge Pizza Edition, Stick Merge Fullscreen, Stick Merge unblocked, shooting games",{"slug":169,"title":170,"image":171,"categories":172,"format":55,"url":173,"content":174,"description":175,"keywords":176},"stupid-zombies","Stupid Zombies","/media/stupid-zombies.webp",[20],"https://23azostore.github.io/s3/stupid-zombies/","Stupid Zombies is a puzzle-shooter game where you use ricocheting bullets to eliminate all the zombies in each level. Aim carefully and use the environment to your advantage to save ammo.\n\nThe game features hundreds of levels with clever layouts. One shot can kill multiple zombies if you plan your angle right. Use your brain to defeat the brainless hordes.","Play Stupid Zombies unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Stupid Zombies Pizza Edition, Stupid Zombies Fullscreen, Stupid Zombies unblocked, shooting games",{"slug":178,"title":179,"image":180,"categories":181,"format":55,"url":182,"content":183,"description":184,"keywords":185},"temple-of-boom","Temple of Boom","/media/temple-of-boom.webp",[20],"https://ubg77.github.io/fix/temple-of-boom/","Temple of Boom is an explosive platform shooter where you must survive waves of enemies in ancient temples. Play alone or with a friend in local co-op mode.\n\nThe game features a variety of weapons, from pistols to bazookas. Jump, shoot, and dodge your way through three different temples. Can you defeat the monsters and survive the Temple of Boom?","Temple of Boom Pizza Edition: Play unblocked fullscreen. Enjoy this top shooting game without downloads.","Temple of Boom Pizza Edition, Temple of Boom Fullscreen, Temple of Boom unblocked, shooting games",{"slug":187,"title":188,"image":189,"categories":190,"format":55,"url":191,"content":192,"description":193,"keywords":194},"zombie-derby-pixel-survival","Zombie Derby Pixel Survival","/media/zombie-derby-pixel-survival.webp",[20],"https://23azostore.github.io/s3/zombie-derby-pixel-survival/","Play Zombie Derby Pixel Survival on The Pizza Edition! Show your talent, compete with top players, and enjoy free, non-stop fun without downloading. Now!","Zombie Derby Pixel Survival Pizza Edition: Play unblocked fullscreen. Enjoy this top shooting game without downloads.","Zombie Derby Pixel Survival Pizza Edition, Zombie Derby Pixel Survival Fullscreen",{"slug":196,"title":197,"image":189,"categories":198,"format":199,"url":200,"content":201,"description":202,"keywords":203},"rocky-and-bullwinkle-3-4","\"Rocky & Bullwinkle\" 3/4",[20],"flash","http://uploads.ungrounded.net/609000/609932_segment_3.swf","Long-Lost episodes of Jay Ward's classic cartoon!\n\nIn September, 1962, then sixteen-year-old Oliver Stone submitted a script to his favorite cartoon, \"The Bullwinkle Show.\" Although unsolicited, show creator Jay Ward was so impressed with the young man's efforts, he bought the story for a paltry sum and immediately put it on the production schedule for airing in the fall of 1963. The episodes were eventually produced by the show's Mexico-based animation house, Val-Mar Studios.\n\nAlready nervous about the story's violent content, after the horrific events of November 22, 1963, both NBC and sponsor General Mills were so mortified by the coincidental similarities of the plot of the episodes and the assassination of President Kennedy in Dallas Texas, they ordered the story pulled from broadcast before it aired. All prints were believed destroyed. Ward asked Stone for his money back.\n\nThe extravagant cost of the whole debacle (nearly twenty dollars) ultimately led to the cancellation of \"The Bullwinkle Show.\"\n\nIn 2008 the films were rediscovered in the evidence files of the Warren Commission in the National Archives. Originally mislabeled \"Kennedy Stag Films,\" the lost cartoons had been overlooked for decades by researchers.\n\nThe four battered film canisters were found between the back of a file cabinet and the wall of a neglected storage room. The footage was badly damaged and deteriorated, and the soundtrack distorted, but the historical significance is undeniable...\n\nThese treasures of animation have now been de-classified and RESTORED so that they can be enjoyed by a new generation!\n\nThis film is a not-for-profit fan-made project and is intended as a parody. No copyright ownership of characters implied or intended.","Experience \"Rocky & Bullwinkle\" 3/4 Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting shooting game. Start playing now!","\"Rocky & Bullwinkle\" 3/4 Pizza Edition, \"Rocky & Bullwinkle\" 3/4 Fullscreen",1765480725050]