[{"data":1,"prerenderedAt":271},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"$fe-_jOqVrlOkbwPf6Xy1Oojmw9OUG8FspkDRr4RlPcFA":40,"$fu26v6W_Cez6Lym8r-4KmC4wxX1CSVgEfFrHh6PynxVk":258},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"puzzle","Puzzle",{"slug":20,"name":21},"shooting","Shooting",{"slug":23,"name":24},"sports","Sports",{"slug":26,"name":27},"strategy","Strategy",{"slug":29,"name":30},"multiplayer","Multiplayer",{"slug":32,"name":33},"new","New",{"slug":35,"name":36},"popular","Popular",{"slug":38,"name":39},"originals","Originals",[41,57,71,85,99,113,125,138,150,162,174,187,200,212,224,235,246],{"slug":42,"title":43,"image":44,"categories":45,"format":46,"url":47,"content":48,"description":49,"keywords":50,"rating":51,"votes":52,"developer":53,"platform":54,"lastUpdated":56},"drive-mad","Drive Mad","/media/drive-mad.webp",[14,35,32],"html5","https://lnahtml.github.io/a77/drive-mad/","Drive Mad is a compact physics‑based drive across uneven tracks where keeping the vehicle upright is the whole game. Bridges wobble, platforms tilt, and small jumps punish heavy landings. You feather the throttle, tap the brake to settle, and accept that patience solves more problems than speed.\n\nMoment to moment you’re managing weight: lean in before a ramp, lift to avoid a nose‑down crash, and correct mid‑air without oversteering. Levels escalate cleanly, and the best clears feel like tidy puzzles solved by good pacing. It’s playful, readable, and built for quick wins that stack up.","Experience Drive Mad Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting driving game. Start playing now!","Drive Mad Pizza Edition, Drive Mad Fullscreen, Drive Mad unblocked, driving games, play Drive Mad",9.6,27092,"Independent Developer",[55],"Desktop Web","April 2024",{"slug":58,"title":59,"image":60,"categories":61,"format":46,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":68,"platform":69,"lastUpdated":70},"geometry-dash","Geometry Dash","/media/geometry-dash.webp",[11,35,32],"https://23azostore.github.io/s8/geometry-dash/","Geometry Dash is a rhythm-based platformer that will test your patience and skills. Jump and fly your way through danger in this rhythm-based action platformer!\n\nThe game features simple one-touch game play with many levels that will keep you entertained for hours. Use practice mode to sharpen your skills and unlock new icons and colors to customize your character.","Play Geometry Dash unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Geometry Dash Pizza Edition, Geometry Dash Fullscreen, Geometry Dash unblocked, arcade games",9.5,47094,"Pizza Dev Team",[55],"July 2024",{"slug":72,"title":73,"image":74,"categories":75,"format":46,"url":76,"content":77,"description":78,"keywords":79,"rating":80,"votes":81,"developer":82,"platform":83,"lastUpdated":84},"brain-test-tricky-puzzles","Brain Test Tricky Puzzles","/media/brain-test-tricky-puzzles.webp",[17,35,32],"https://23azostore.github.io/s2/brain-test-tricky-puzzles/","Brain Test: Tricky Puzzles is a collection of short, lateral‑thinking riddles where the obvious answer is rarely correct. You interact with the scene directly—drag items, combine them, move text, or reveal things hidden off screen—to find the trick that solves the level. The draw is the steady stream of small “aha” moments and the way even simple prompts hide playful solutions. If you’re stuck, read the question carefully, try manipulating the background, and consider whether the answer comes from an object you create rather than one already shown. It’s light, fast, and designed for quick sessions that feel satisfying when a stubborn level finally gives way.","Brain Test Tricky Puzzles Pizza Edition: Play unblocked fullscreen. Enjoy this top puzzle game without downloads.","Brain Test Tricky Puzzles Pizza Edition, Brain Test Tricky Puzzles Fullscreen",8.4,65174,"Pizza Editione",[55],"June 2024",{"slug":86,"title":87,"image":88,"categories":89,"format":46,"url":90,"content":91,"description":92,"keywords":93,"rating":94,"votes":95,"developer":96,"platform":97,"lastUpdated":98},"8-ball-pool","8 Ball Pool","/media/8-ball-pool.webp",[23,35,29],"https://sudoku-online.github.io/a8/8-ball-pool/","8 Ball Pool turns a familiar barroom duel into a sleek ladder of quick matches and steady progression. Breaks matter—set the rack moving cleanly and you’ll find patterns faster. From there it’s a lesson in touch: soft shots that nurse position, draw that opens angles on the next ball, and the quiet confidence to take a long cut when the table calls for it. Physics are crisp, so a good stroke feels honest, and mistakes teach immediately.\n\nAs your aim improves, the rooms change, stakes rise, and tournaments test whether you can string frames under pressure. Coins unlock cues and venues, but the heart stays in the geometry—finding routes that keep you in control and refusing the hero shot when the safety is wiser. Matches are short enough to fit a break and deep enough to be satisfying, and momentum can flip on a single great pot. It’s pool for the modern moment—accessible in seconds, endlessly replayable, and always nudging you toward cleaner lines.","8 Ball Pool Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","8 Ball Pool Pizza Edition, 8 Ball Pool Fullscreen, 8 Ball Pool unblocked, sports games",8.9,10188,"Game Studio",[55],"May 2023",{"slug":100,"title":101,"image":102,"categories":103,"format":46,"url":104,"content":105,"description":106,"keywords":107,"rating":108,"votes":109,"developer":110,"platform":111,"lastUpdated":112},"among-us","Among Us","/media/among-us.webp",[26,35,29],"https://ovo-game.github.io/o/among-us/","Among Us is a social deduction game where a team of crewmates tries to complete simple tasks while one or more impostors work to stop them. Each round plays out in short bursts of movement and discussion: fix a sabotage, finish a task, or report a body and talk through what you’ve seen. Crewmates win by finishing all tasks or voting out the impostors; impostors win by causing enough chaos and eliminating the crew without being caught.\n\nIt’s easy to understand after a few matches and scales well with different group sizes. Maps change the layout of tasks and travel routes, and small settings tweaks can make games faster or more methodical. The appeal is in the stories that form—alibis that don’t add up, quiet players who turn out to be sharp observers, and those tense moments around the emergency button when suspicion swings from one person to another.","Play Among Us Pizza Edition unblocked in fullscreen. Enjoy this exciting strategy game. Free online game - no downloads required!","Among Us Pizza Edition, Among Us Fullscreen, Among Us unblocked, strategy games, play Among Us",9,21669,"Pizza Edition",[55],"September 2024",{"slug":114,"title":115,"image":116,"categories":117,"format":46,"url":118,"content":119,"description":120,"keywords":121,"rating":122,"votes":123,"developer":53,"platform":124,"lastUpdated":98},"basketball-stars","Basketball Stars","/media/basketball-stars.webp",[23,35,29],"https://basketballstarsonline.github.io/file/","Basketball Stars is a fast one‑minute basketball match with simple controls and clear momentum swings. You pick a character, choose a mode, and trade drives, blocks, steals, and jump shots in tight possessions that reward timing more than complex inputs. Modes cover quick games, bracket tournaments, and local two‑player play in 1v1 or 2v2, so it works well for a short break or a longer run. Most of the depth comes from small reads—hold position for a block instead of chasing, dash into space for a clean dunk, or save a special move for the last possession. It’s easy to pick up, lively when played with a friend, and competitive enough to keep rematches coming.","Play Basketball Stars Pizza Edition unblocked in fullscreen. Fun sports action. Free online game - no downloads required!","Basketball Stars Pizza Edition, Basketball Stars Fullscreen, Basketball Stars unblocked",9.4,29910,[55],{"slug":126,"title":127,"image":128,"categories":129,"format":46,"url":130,"content":131,"description":132,"keywords":133,"rating":134,"votes":135,"developer":110,"platform":136,"lastUpdated":137},"cookie-clicker","Cookie Clicker","/media/cookie-clicker.webp",[11,35],"https://23azostore.github.io/s/cookie-clicker/","Cookie Clicker is an incremental game about turning simple clicks into ever‑larger numbers. You start by making cookies manually, then buy upgrades and buildings that produce them automatically. Over time the rate climbs, new options unlock, and strategic choices—what to buy next, when to save, how to balance short‑term gains with long‑term multipliers—shape your progress.\n\nThe moment to moment play alternates between active bursts and quieter planning. It’s easy to slip into a rhythm of setting goals, reaching them, and choosing the next target. The humor is dry and the systems transparent, which helps the numbers feel satisfying rather than abstract. If you enjoy watching a plan compound into bigger results, this serves that loop well without demanding constant attention.","Experience Cookie Clicker Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting arcade game. Start playing now!","Cookie Clicker Pizza Edition, Cookie Clicker Fullscreen, Cookie Clicker unblocked, arcade games",9.7,9474,[55],"June 2023",{"slug":139,"title":140,"image":141,"categories":142,"format":46,"url":143,"content":144,"description":145,"keywords":146,"rating":147,"votes":148,"developer":110,"platform":149,"lastUpdated":56},"drift-hunters","Drift Hunters","/media/drift-hunters.webp",[14,35],"https://drift-hunters-online.github.io/file/","Drift Hunters is a 3D driving game centered on controlled slides rather than racing lines. Long corners invite you to set a drift early, balance throttle and counter‑steer, and hold angle without spinning. Points accrue when you keep slides stable and string them together, so the best runs look smooth rather than wild.\n\nMoment to moment you’re reading grip and correcting gently—add gas to sustain, ease off when angle grows, and straighten cleanly before a new section. Progression gives you room to try quicker setups and refine handling, and practice turns consistent laps into flowing sessions. It’s a satisfying space to chase better control.","Play Drift Hunters unblocked: Pizza Edition in full screen. A great driving game to play free online.","Drift Hunters Pizza Edition, Drift Hunters Fullscreen, Drift Hunters unblocked, driving games",9.1,20831,[55],{"slug":151,"title":152,"image":153,"categories":154,"format":46,"url":155,"content":156,"description":157,"keywords":158,"rating":80,"votes":159,"developer":53,"platform":160,"lastUpdated":161},"football-legends","Football Legends","/media/football-legends.webp",[23,35,29],"https://soccerlegends.github.io/soccer-legends/","Football Legends lets you play as famous soccer stars in intense 1-on-1 or 2-on-2 matches. You can choose from a variety of game modes, including tournament and quick match, and use special abilities like power shots and teleportation to outscore your opponent.\n\nThe controls are easy to pick up, but mastering the timing of your jumps and shots is key to winning. Whether you’re playing solo or with a friend, Football Legends offers fast-paced arcade soccer action with a touch of humor.","Play Football Legends unblocked: Pizza Edition in full screen. A great sports game to play free online.","Football Legends Pizza Edition, Football Legends Fullscreen, Football Legends unblocked",29034,[55],"February 2023",{"slug":163,"title":164,"image":165,"categories":166,"format":46,"url":167,"content":168,"description":169,"keywords":170,"rating":80,"votes":171,"developer":53,"platform":172,"lastUpdated":173},"penalty-kick-online","Penalty Kick Online","/media/penalty-kick-online.webp",[23,35,29],"https://23azostore.github.io/s/penalty-kick-online/","Penalty Kick Online is a multiplayer soccer game where you face off against players from around the world in penalty shootouts. Take turns shooting and saving goals to win the match.\n\nThe game features simple swipe controls and realistic physics. Predict your opponent's moves, time your shots perfectly, and climb the leaderboards in this intense soccer showdown.","Play Penalty Kick Online unblocked: Pizza Edition in full screen. A great sports game to play free online.","Penalty Kick Online Pizza Edition, Penalty Kick Online Fullscreen, Penalty Kick Online unblocked",26900,[55],"March 2024",{"slug":175,"title":176,"image":177,"categories":178,"format":46,"url":179,"content":180,"description":181,"keywords":182,"rating":122,"votes":183,"developer":184,"platform":185,"lastUpdated":186},"retro-bowl","Retro Bowl","/media/retro-bowl.webp",[23,35],"https://amhooman.github.io/website/games/retrobowl/game.html","Play Retro Bowl on Pizza Edition. Experience the thrill of American football in this retro-style sports game with no ads or downloads.","Retro Bowl Pizza Edition: Play unblocked fullscreen. Enjoy this top sports game without downloads.","Retro Bowl Pizza Edition, Retro Bowl Fullscreen, Retro Bowl unblocked, sports games, play Retro Bowl",43568,"Pizza Games Studio",[55],"October 2024",{"slug":188,"title":189,"image":190,"categories":191,"format":46,"url":192,"content":193,"description":194,"keywords":195,"rating":196,"votes":197,"developer":53,"platform":198,"lastUpdated":199},"rooftop-snipers","Rooftop Snipers","/media/rooftop-snipers.webp",[20,35,29],"https://rooftop-snipers.github.io/file/","Rooftop Snipers is a chaotic two-player shooting game where you must shoot your opponent off the roof. Jump and shoot to avoid getting hit while trying to land a shot on your enemy.\n\nThe game features simple one-button controls and ragdoll physics, leading to hilarious and unpredictable battles. Play against the AI or a friend in this fast-paced and addictive sniper duel.","Play Rooftop Snipers Pizza Edition unblocked in fullscreen. Enjoy this exciting shooting game. Free online game - no downloads required!","Rooftop Snipers Pizza Edition, Rooftop Snipers Fullscreen, Rooftop Snipers unblocked",8.5,17278,[55],"May 2024",{"slug":201,"title":202,"image":203,"categories":204,"format":46,"url":205,"content":206,"description":207,"keywords":208,"rating":147,"votes":209,"developer":53,"platform":210,"lastUpdated":211},"slope","Slope","/media/slope.webp",[11,35],"https://slope-game.github.io/rungame/slope-racing-3d/","Slope is the ultimate speed run game where you control a ball rolling down a never-ending 3D slope. Avoid obstacles and red blocks as you speed up, testing your reflexes to the limit.\n\nThe game features simple controls but increasing difficulty, making it a true test of skill. Compete for the highest score on the leaderboard and see how long you can survive the dizzying descent.","Play Slope Pizza Edition unblocked in fullscreen. Enjoy this exciting arcade game. Free online game - no downloads required!","Slope Pizza Edition, Slope Fullscreen, Slope unblocked, arcade games, play Slope",51843,[55],"January 2024",{"slug":213,"title":214,"image":215,"categories":216,"format":46,"url":217,"content":218,"description":219,"keywords":220,"rating":80,"votes":221,"developer":82,"platform":222,"lastUpdated":223},"stickman-hook","Stickman Hook","/media/stickman-hook.webp",[11,35,38],"https://htmlxm.github.io/h/stickman-hook","Stickman Hook is a skill-based arcade game where you swing through levels like Spiderman. Tap to hook onto points and release to fly through the air.\n\nThe game features hundreds of levels with increasing difficulty. Use momentum and physics to navigate obstacles, bounce off pads, and cross the finish line. Can you master the swing and become the ultimate stickman hooker?","Play Stickman Hook Pizza Edition unblocked in fullscreen. The best arcade gameplay. Free online game - no downloads required!","Stickman Hook Pizza Edition, Stickman Hook Fullscreen, Stickman Hook unblocked, arcade games",35880,[55],"August 2023",{"slug":225,"title":226,"image":227,"categories":228,"format":46,"url":229,"content":230,"description":231,"keywords":232,"rating":66,"votes":233,"developer":184,"platform":234,"lastUpdated":98},"subway-surfers","Subway Surfers","/media/subway-surfers.webp",[11,35],"https://23azostore.github.io/s8/subway-surfers-san-francisco/","Subway Surfers is the legendary endless runner where you play as Jake, Tricky, and Fresh, escaping from the grumpy Inspector and his dog. Dash as fast as you can, dodge the oncoming trains, and surf the subways!\n\nThe game features vibrant HD graphics and lightning-fast swipe acrobatics. Collect coins, power-ups, and unlock cool characters and boards. Join the most daring chase and see how far you can run in this world-famous game.","Subway Surfers Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Subway Surfers Pizza Edition, Subway Surfers Fullscreen, Subway Surfers unblocked, arcade games",38970,[55],{"slug":236,"title":237,"image":238,"categories":239,"format":46,"url":240,"content":241,"description":242,"keywords":243,"rating":66,"votes":244,"developer":184,"platform":245,"lastUpdated":211},"tunnel-rush","Tunnel Rush","/media/tunnel-rush.webp",[11,35],"https://23azostore.github.io/s/tunnel-rush/","Tunnel Rush is a fast-paced dodging game where you speed through a colorful, ever-changing tunnel. React quickly to avoid obstacles and gaps that appear in your path.\n\nThe game tests your reflexes and concentration. As you progress, the speed increases and the obstacles become more complex. How far can you go inside the tunnel?","Tunnel Rush Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Tunnel Rush Pizza Edition, Tunnel Rush Fullscreen, Tunnel Rush unblocked, arcade games",14313,[55],{"slug":247,"title":248,"image":249,"categories":250,"format":46,"url":251,"content":252,"description":253,"keywords":254,"keybindings":255,"rating":134,"votes":256,"developer":82,"platform":257,"lastUpdated":173},"escaperoad","Escape Road","/media/escaperoad.webp",[32,14,35],"https://escaperoadx.github.io/escaperoad/index.html","Escape Road is a fast-paced arcade driving game set in a distinctive Minecraft-inspired blocky world. You control a car racing through cubic roads and pixelated city layouts while being relentlessly chased by the police. Block-shaped buildings, vehicles, and environments give the game a playful visual style that contrasts with the intense pressure of the pursuit.\nGameplay is focused on quick reactions and clean driving. Traffic fills the narrow roads, sharp turns appear without warning, and a single mistake can end the run. There are no complicated mechanics—your survival depends entirely on how well you steer, avoid obstacles, and use the blocky road layout to shake off the police.\nAs the chase continues, the difficulty steadily increases, demanding sharper reflexes and better control. With instant restarts, simple controls, and short, adrenaline-filled sessions, Escape Road is easy to jump into but hard to put down. The combination of tense arcade driving and a familiar voxel-style aesthetic makes it appealing to both casual players and fans of Minecraft-like visuals.","Escape Road is a high-speed arcade driving game where you escape the police in a Minecraft-style blocky world.","escape road,minecraft style driving game,blocky police chase game","Arrow Keys / WASD – Control the car\nUp Arrow / W – Accelerate\nLeft Arrow / A – Turn left\nRight Arrow / D – Turn right",25852,[55],[259,260,261,262,263,264,265,266,267,268,269,270],{"slug":5,"name":6},{"slug":8,"name":9},{"slug":11,"name":12},{"slug":14,"name":15},{"slug":17,"name":18},{"slug":20,"name":21},{"slug":23,"name":24},{"slug":26,"name":27},{"slug":29,"name":30},{"slug":32,"name":33},{"slug":35,"name":36},{"slug":38,"name":39},1766420202413]