[{"data":1,"prerenderedAt":208},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-jelly-truck":40,"similar-jelly-truck":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"jelly-truck","Jelly Truck","/media/jelly-truck.webp",[14],"html5","https://gswitch3.github.io/g/jelly-truck/","Jelly Truck is a unique driving game where everything in the world, including your vehicle, is made of jelly. You must navigate through squishy landscapes, overcoming obstacles that deform and bounce under your wheels. The physics are wobbly and unpredictable, making every level a fun challenge.\n\nYou’ll need to balance speed with careful maneuvering to avoid getting stuck or flipping over. The vibrant, gelatinous world is full of surprises, and the satisfying physics make Jelly Truck a joy to play for anyone who loves unconventional driving games.","Jelly Truck Pizza Edition: Play unblocked fullscreen. Enjoy this top driving game without downloads.","Jelly Truck Pizza Edition, Jelly Truck Fullscreen, Jelly Truck unblocked, driving games",8.5,18628,"Game Studio",[54],"Desktop Web","January 2023",[57,71,84,95,109,122,134,147,160,172,184,196],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":66,"votes":67,"developer":68,"platform":69,"lastUpdated":70},"drive-mad","Drive Mad","/media/drive-mad.webp",[14,26,20],"https://lnahtml.github.io/a77/drive-mad/","Drive Mad is a compact physics‑based drive across uneven tracks where keeping the vehicle upright is the whole game. Bridges wobble, platforms tilt, and small jumps punish heavy landings. You feather the throttle, tap the brake to settle, and accept that patience solves more problems than speed.\n\nMoment to moment you’re managing weight: lean in before a ramp, lift to avoid a nose‑down crash, and correct mid‑air without oversteering. Levels escalate cleanly, and the best clears feel like tidy puzzles solved by good pacing. It’s playful, readable, and built for quick wins that stack up.","Experience Drive Mad Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting driving game. Start playing now!","Drive Mad Pizza Edition, Drive Mad Fullscreen, Drive Mad unblocked, driving games, play Drive Mad",9.6,27092,"Independent Developer",[54],"April 2024",{"slug":72,"title":73,"image":74,"categories":75,"format":45,"url":76,"content":77,"description":78,"keywords":79,"rating":50,"votes":80,"developer":81,"platform":82,"lastUpdated":83},"3d-car-simulator","3d Car Simulator","/media/3d-car-simulator.webp",[8,14],"https://23azostore.github.io/s2/3d-car-simulator/","3D Car Simulator is a relaxed driving playground built around feel. Three open maps—city streets, desert stretches, and quieter outskirts—give you room to experiment with a rally car’s eager turn‑in, the weighty authority of a police cruiser, or the charm of an older machine that wants a gentler hand. Without checkpoints or lap times pushing you along, it becomes about learning the language of each car: when to breathe off the throttle, how much steering the surface will accept, and the little taps of brakes that settle a chassis before a fast corner.\n\nIts strength is in the immediacy. Swap vehicles on a whim, change the camera to reframe the road, and try another line the moment an idea strikes. Drifts begin as happy accidents and become repeatable when you catch the balance point; straightaways invite the siren and a sprint; alleyways test precision as much as pace. It’s a simple, inviting stage that turns a spare five minutes into a satisfying session and rewards curiosity with those quiet \"I’ve got it\" moments that every driver chases.","3d Car Simulator Pizza Edition: Play unblocked fullscreen. Enjoy this top adventure game without downloads.","3d Car Simulator Pizza Edition, 3d Car Simulator Fullscreen, 3d Car Simulator unblocked",20456,"Pizza Editione",[54],"November 2024",{"slug":85,"title":86,"image":87,"categories":88,"format":45,"url":89,"content":90,"description":91,"keywords":92,"rating":50,"votes":93,"developer":81,"platform":94,"lastUpdated":83},"3d-moto-simulator-2","3D Moto Simulator 2","/media/3d-moto-simulator-2.webp",[8,14],"https://23azostore.github.io/s2/3d-moto-simulator-2/","3D Moto Simulator 2 is a free‑roam bike sandbox that respects the pleasure of riding for its own sake. Three bikes—nimble trials, dirt‑ready cross, and a siren‑lit police motorcycle—each bring their own character, and the maps match them with space to breathe: desert edges for open throttle, city grids for flowing corners, and off‑road pockets for playful detours. The controls are clear and responsive, so you can lean smoothly into arcs, tap the handbrake for a tight rotation, and fire a burst of nitro when a straight line begs you to.\n\nThere’s no pressure to chase a leaderboard. Instead, the game invites small goals: chain a sequence of turns without lifting, hop a median cleanly, climb a ridge and watch the skyline fall behind. Over time, those little challenges add up to muscle memory, and the ride starts to feel like a conversation between bike and road. It’s an easy game to slip into and a hard one to leave, perfect for quick sessions that somehow stretch into longer rides.","Play 3D Moto Simulator 2 Pizza Edition unblocked in fullscreen. Enjoy this exciting adventure game. Free online game - no downloads required!","3D Moto Simulator 2 Pizza Edition, 3D Moto Simulator 2 Fullscreen, 3D Moto Simulator 2 unblocked",23562,[54],{"slug":96,"title":97,"image":98,"categories":99,"format":45,"url":100,"content":101,"description":102,"keywords":103,"rating":104,"votes":105,"developer":106,"platform":107,"lastUpdated":108},"4x4-drive-offroad","4x4 Drive Offroad","/media/4x4-drive-offroad.webp",[14],"https://gswitch3.github.io/g7/4x4-drive-offroad/","4x4 Drive Offroad is a slow‑burn celebration of traction and patience. Heavy SUVs and trucks invite you to pick lines carefully—nose up to a ledge, let the tires find a bite, and ease the throttle until weight shifts just enough to carry over. Long climbs reward composure more than power, and muddy patches punish an overeager foot with spin where a feathered touch would glide.\n\nIt’s a game of scouting and adjusting. Change the camera to make sense of a ridge, back off and angle for a safer approach, or commit when you feel the chassis settle and know the truck will hold. Repairs keep the loop generous, so experimentation never stalls, and with each crest, confidence grows. The result is a calm, methodical kind of driving where success feels earned—those quiet moments when the wheels bite, the slope gives way, and the hillside you doubted becomes another story you’re proud to tell.","Play 4x4 Drive Offroad Pizza Edition unblocked in fullscreen. The best driving gameplay. Free online game - no downloads required!","4x4 Drive Offroad Pizza Edition, 4x4 Drive Offroad Fullscreen, 4x4 Drive Offroad unblocked",8.4,18687,"Pizza Games Studio",[54],"May 2023",{"slug":110,"title":111,"image":112,"categories":113,"format":45,"url":114,"content":115,"description":116,"keywords":117,"rating":118,"votes":119,"developer":68,"platform":120,"lastUpdated":121},"adventure-drivers","Adventure Drivers","/media/adventure-drivers.webp",[14],"https://gswitch3.github.io/g7/adventure-drivers/","Adventure Drivers turns a string of island tracks into an arcade‑leaning chase for first place. You begin in a sturdy van and earn your way into faster machines as jumps grow wilder and shortcuts more tempting. Ramps, collapsing bridges, and explosive surprises layer the lanes, so races become a conversation between risk and reward: save a boost for the final climb, commit to an outer ledge for a bold pass, or time a flip to squeeze extra momentum when every second counts.\n\nVehicles feel tough, encouraging fearless landings and aggressive lines, while upgrades nudge you toward a build that matches your style—top speed for clear air, handling for tricky segments, armor when the course fights back. It’s bright, punchy, and satisfying, the kind of racing where each heat tells a small story of guts and timing, and a perfect jump can turn a middling lap into a win.","Adventure Drivers Pizza Edition: Play unblocked fullscreen. Enjoy this top driving game without downloads.","Adventure Drivers Pizza Edition, Adventure Drivers Fullscreen, Adventure Drivers unblocked",9.3,61994,[54],"October 2024",{"slug":123,"title":124,"image":125,"categories":126,"format":45,"url":127,"content":128,"description":129,"keywords":130,"rating":118,"votes":131,"developer":132,"platform":133,"lastUpdated":70},"blocky-cars","Blocky Cars","/media/blocky-cars.webp",[14,17],"https://23azostore.github.io/s2/blocky-cars/","Blocky Cars covers the arcade side of driving with chunky vehicles and simple tracks. Races and challenges ask for clean lines, careful speed on hills, and quick reactions when traffic or obstacles appear. Coins let you unlock new vehicles or tweak performance, and short levels make it easy to chase a better run without a long reset. It’s not a simulator; the appeal is in clear controls, readable physics, and the satisfaction of threading a blocky car through a course a little cleaner each time.","Play Blocky Cars Pizza Edition unblocked in fullscreen. Enjoy this exciting driving game. Free online game - no downloads required!","Blocky Cars Pizza Edition, Blocky Cars Fullscreen, Blocky Cars unblocked, driving games",37323,"Pizza Dev Team",[54],{"slug":135,"title":136,"image":137,"categories":138,"format":45,"url":139,"content":140,"description":141,"keywords":142,"rating":143,"votes":144,"developer":81,"platform":145,"lastUpdated":146},"brain-for-monster-truck","Brain for Monster Truck","/media/brain-for-monster-truck.webp",[14],"https://gswitch3.github.io/g2/brain-for-monster-truck/","Brain for Monster Truck mixes drawing and driving. You sketch a road segment, drive a little, and extend the line as needed to bring your truck to the flag without losing the crate in the bed. Stars sit on awkward paths, so smooth slopes and low angles matter more than speed. It’s often better to build short ramps, move, erase, and redraw than to commit to one steep climb. When you have to drop down, land flat and give the cargo time to settle before continuing. There’s no timer pushing you, and progress saves level by level, so patient routes beat risky ones. After a few stages the basics click: draw gently, avoid bumps, protect the crate, and collect all three stars on a clean run.","Brain for Monster Truck Pizza Edition: Play unblocked fullscreen. Enjoy this top driving game without downloads.","Brain for Monster Truck Pizza Edition, Brain for Monster Truck Fullscreen",9,55975,[54],"July 2024",{"slug":148,"title":149,"image":150,"categories":151,"format":45,"url":152,"content":153,"description":154,"keywords":155,"rating":156,"votes":157,"developer":132,"platform":158,"lastUpdated":159},"bumper-cars-soccer","Bumper Cars Soccer","/media/bumper-cars-soccer.webp",[14,35,17],"https://23azostore.github.io/s2/bumper-cars-soccer/","Bumper Cars Soccer turns a small arena into a knockabout football match with toy‑car physics. You nudge, bump, and angle the car to push a giant ball toward the goal, and quick momentum changes make simple plays—cutting inside, shielding with the bumper, timing a tap at the near post—feel rewarding. Holding position matters: wait for the ball to roll across your front, then accelerate through it rather than chasing from behind. With two players, agree who defends and who presses to avoid both cars crowding the same lane.","Play Bumper Cars Soccer unblocked: Pizza Edition in full screen. A great driving game to play free online.","Bumper Cars Soccer Pizza Edition, Bumper Cars Soccer Fullscreen, Bumper Cars Soccer unblocked",8.9,26141,[54],"July 2023",{"slug":161,"title":162,"image":163,"categories":164,"format":45,"url":165,"content":166,"description":167,"keywords":168,"rating":169,"votes":170,"developer":68,"platform":171,"lastUpdated":159},"burnout-drift-seaport-max","Burnout Drift Seaport Max","/media/burnout-drift-seaport-max.webp",[14],"https://23azostore.github.io/s2/burnout-drift-seaport-max/","Burnout Drift Seaport Max is a high-octane drifting game set in a busy seaport. Customize your car, tune your engine, and hit the asphalt to perform amazing drifts.\n\nThe game features realistic physics and stunning graphics. Compete against the clock or just enjoy the freedom of drifting in a detailed 3D environment.","Burnout Drift Seaport Max Pizza Edition: Play unblocked fullscreen. Enjoy this top driving game without downloads.","Burnout Drift Seaport Max Pizza Edition, Burnout Drift Seaport Max Fullscreen",8.6,50827,[54],{"slug":173,"title":174,"image":175,"categories":176,"format":45,"url":177,"content":178,"description":179,"keywords":180,"rating":118,"votes":181,"developer":132,"platform":182,"lastUpdated":183},"car-climb-racing","Car Climb Racing","/media/car-climb-racing.webp",[14],"https://23azostore.github.io/s7/car-climb-racing/","Car Climb Racing is a side‑view drive up uneven hills where throttle control matters more than raw speed. The terrain throws steep slopes, short gaps, and awkward landings at you, and tipping the car is a constant threat. Feathering the gas, easing off before a crest, and using a brief brake to settle weight turn messy segments into clean progress.\n\nCoins collected along the way feed upgrades that change the feel: a stronger engine helps on long climbs, better suspension keeps you stable after jumps. Runs are short, restarts are quick, and the typical challenge is stringing several tricky sections together without a flip. It’s a calm, methodical kind of racing where learning a route pays off, and a careful pace often beats a reckless sprint.","Car Climb Racing Pizza Edition: Play unblocked fullscreen. Enjoy this top driving game without downloads.","Car Climb Racing Pizza Edition, Car Climb Racing Fullscreen, Car Climb Racing unblocked",10005,[54],"May 2024",{"slug":185,"title":186,"image":187,"categories":188,"format":45,"url":189,"content":190,"description":191,"keywords":192,"rating":156,"votes":193,"developer":132,"platform":194,"lastUpdated":195},"car-rush","Car Rush","/media/car-rush.webp",[14],"https://23azostore.github.io/s/car-rush/","Car Rush is a forward‑view arcade drive through light traffic and gentle curves, built to deliver speed without complexity. You squeeze through gaps, commit to an overtake, and adjust your line when a slower car blocks the lane. Checkpoints and time extensions keep the run alive if you’re efficient, so reading the road matters as much as holding the throttle.\n\nMoment to moment you’re looking ahead for patterns—two cars offset just enough for a clean pass, or a wide corner that rewards a later move. The pacing is steady and forgiving at first, then pushes reaction time as speed rises. It’s the kind of game that makes quick sessions satisfying: clear feedback, simple rules, and plenty of chances to improve a run by one or two better decisions.","Play Car Rush Pizza Edition unblocked in fullscreen. Fun driving action. Free online game - no downloads required!","Car Rush Pizza Edition, Car Rush Fullscreen, Car Rush unblocked, driving games, play Car Rush",41993,[54],"September 2023",{"slug":197,"title":198,"image":199,"categories":200,"format":45,"url":201,"content":202,"description":203,"keywords":204,"rating":156,"votes":205,"developer":52,"platform":206,"lastUpdated":207},"cars-thief","Cars Thief","/media/cars-thief.webp",[14],"https://23azostore.github.io/s4/cars-thief-tank-edition/","Cars Thief is a small, open‑city driving playground focused on grabbing whatever vehicle you find and taking it for a spin. The map offers broad streets, tighter alleys, and ramps or obstacles that invite experimentation. Each vehicle handles differently, so there’s a quiet pleasure in swapping from a compact car to something heavier and noticing how turns, braking, and acceleration change.\n\nMoment to moment you’re choosing where to go—cruise a long avenue, thread through side streets, or test a jump when you spot an opportunity. The goals are light and the pace is relaxed, which lets you treat the city like a sandbox for practicing control. It’s about curiosity and feel rather than strict objectives, and it’s easy to spend a few minutes just chasing a cleaner line or a more confident landing.","Cars Thief Pizza Edition: Play unblocked fullscreen. Enjoy this top driving game without downloads.","Cars Thief Pizza Edition, Cars Thief Fullscreen, Cars Thief unblocked, driving games",29638,[54],"April 2023",1766636664315]