[{"data":1,"prerenderedAt":103},["ShallowReactive",2],{"game-neon-war":3,"similar-neon-war":13},{"slug":4,"title":5,"description":6,"image":7,"categories":8,"format":11,"url":12},"neon-war","Neon War","Neon War is an arcade shooter where you defend your base against waves of neon shapes. Control a cannon, shoot down falling enemies, and upgrade your firepower to survive longer.\n\nThe game features vibrant neon graphics and increasingly difficult levels. Collect coins to unlock new cannons and power-ups. Test your reflexes and strategy in this colorful and addictive defense game.","/media/neon-war.webp",[9,10],"shooting","new","html5","https://unblocked-games.s3.amazonaws.com/games/2024/q/7/neon-war/index.html",[14,23,31,39,47,54,61,68,75,82,89,96],{"slug":15,"title":16,"description":17,"image":18,"categories":19,"format":11,"url":22},"drive-mad","Drive Mad","Drive Mad is a compact physics‑based drive across uneven tracks where keeping the vehicle upright is the whole game. Bridges wobble, platforms tilt, and small jumps punish heavy landings. You feather the throttle, tap the brake to settle, and accept that patience solves more problems than speed.\n\nMoment to moment you’re managing weight: lean in before a ramp, lift to avoid a nose‑down crash, and correct mid‑air without oversteering. Levels escalate cleanly, and the best clears feel like tidy puzzles solved by good pacing. It’s playful, readable, and built for quick wins that stack up.","/media/drive-mad.webp",[20,21,10],"driving","popular","https://drive-madgame.github.io/file/",{"slug":24,"title":25,"description":26,"image":27,"categories":28,"format":11,"url":30},"geometry-dash","Geometry Dash","Geometry Dash is a rhythm-based platformer that will test your patience and skills. Jump and fly your way through danger in this rhythm-based action platformer!\n\nThe game features simple one-touch game play with many levels that will keep you entertained for hours. Use practice mode to sharpen your skills and unlock new icons and colors to customize your character.","/media/geometry-dash.webp",[29,21,10],"arcade","https://23azostore.github.io/s8/geometry-dash/",{"slug":32,"title":33,"description":34,"image":35,"categories":36,"format":11,"url":38},"brain-test-tricky-puzzles","Brain Test Tricky Puzzles","Brain Test: Tricky Puzzles is a collection of short, lateral‑thinking riddles where the obvious answer is rarely correct. You interact with the scene directly—drag items, combine them, move text, or reveal things hidden off screen—to find the trick that solves the level. The draw is the steady stream of small “aha” moments and the way even simple prompts hide playful solutions. If you’re stuck, read the question carefully, try manipulating the background, and consider whether the answer comes from an object you create rather than one already shown. It’s light, fast, and designed for quick sessions that feel satisfying when a stubborn level finally gives way.","/media/brain-test-tricky-puzzles.webp",[37,21,10],"puzzle","https://23azostore.github.io/s2/brain-test-tricky-puzzles/",{"slug":40,"title":41,"description":42,"image":43,"categories":44,"format":11,"url":46},"4th-and-goal-2022","4th and Goal 2022","4th and Goal 2022 distills American football into brisk drives and meaningful decisions. The playbook is compact but expressive: inside runs to set a rhythm, option looks that punish over‑pursuit, and timing routes that reward a calm read when a safety bites. On defense, a well‑chosen blitz can flip a possession, while disciplined coverage squeezes windows until a hurried throw invites a takeaway.\n\nModes range from quick games to deeper playoff runs, and the tone stays consistent—intuitive controls, short possessions, and enough tactical space that smart play‑calling tells. Drives hinge on small choices: take the yards and bleed the clock, or push for a dagger before the half; pin them deep with field position, or gamble on fourth down when momentum is yours. Red‑zone snaps carry that familiar knot in the stomach, and touchdowns feel earned rather than scripted. It’s football trimmed to essentials, lively and readable, where a season’s story is written in a handful of clutch plays.","/media/4th-and-goal-2022.webp",[45,10],"sports","https://23azostore.github.io/s2/4th-and-goal-2022/",{"slug":48,"title":49,"description":50,"image":51,"categories":52,"format":11,"url":53},"cannon-strike","Cannon Strike","Cannon Strike is a physics puzzle about firing pellets into a container while the path changes around you. You set angle and timing from a fixed cannon, then watch pellets bounce off surfaces, slip through rotating bars, and settle—if you judged correctly—where you need them. Early levels are forgiving, but later layouts ask for tighter shots and a better sense of how motion will carry after a bounce.\n\nMoment to moment you’re deciding whether to shoot now or wait for a safer alignment. The game respects patience; a clean release is usually better than brute force. Limited ammo or stricter thresholds show up as you progress, which encourages smarter planning rather than rushing. It’s the kind of puzzle where each success feels earned, and small adjustments lead to reliable solutions without trial‑and‑error grind.","/media/cannon-strike.webp",[9],"https://gamaverse.com/c/f/g/cannon-strike/",{"slug":55,"title":56,"description":57,"image":58,"categories":59,"format":11,"url":60},"free-kick-shooter","Free Kick Shooter","Free Kick Shooter tests your accuracy and precision as you take free kicks from various positions on the field. You have to account for wind direction and the goalkeeper’s movements to curl the ball into the net. As you progress, the challenges get harder with more defenders and tricky angles.\n\nThe game features a simple swipe-to-shoot mechanic that feels satisfying to master. It’s an addictive sports game that lets you live out the fantasy of scoring the winning goal in a high-pressure situation.","/media/free-kick-shooter.webp",[9,45],"https://23azostore.github.io/s4/free-kick-shooter/",{"slug":62,"title":63,"description":64,"image":65,"categories":66,"format":11,"url":67},"getaway-shootout","Getaway Shootout","Getaway Shootout is a frantic two-player game where you race to the helicopter to escape. Jump, shoot, and use power-ups to hinder your opponents in a chaotic dash for freedom.\n\nThe game features ragdoll physics and hilarious movement mechanics. Play against the computer or a friend in local multiplayer and see who can make the getaway first.","/media/getaway-shootout.webp",[9],"https://23azostore.github.io/s4/getaway-shootout/",{"slug":69,"title":70,"description":71,"image":72,"categories":73,"format":11,"url":74},"hammer-2-reloaded","Hammer 2 Reloaded","Hammer 2 Reloaded is a third‑person action shooter set in a gritty city. You control a vigilante clearing the streets of bad guys, using guns, melee attacks, and vehicles to get the job done. The action is chaotic and open—you can hijack cars, blow up barrels, and use the environment to take cover.\n\nMoment to moment you’re constantly moving, switching targets, and looking for better weapons or a getaway car. Missions give you specific goals, but the fun often comes from the unscripted mess of a shootout going wrong and you improvising a way out. It’s a sandbox of destruction that doesn’t take itself too seriously.","/media/hammer-2-reloaded.webp",[9],"https://23azostore.github.io/s4/hammer-2-reloaded/",{"slug":76,"title":77,"description":78,"image":79,"categories":80,"format":11,"url":81},"head-soccer-2023","Head Soccer 2023","Head Soccer 2023 updates the classic big‑head formula with fresh players and smoother animations. It’s still 1v1 soccer where you jump, header, and kick to outscore your opponent, but the physics feel tighter and the pace is quicker. You can play solo or against a friend, trading goals and blocks in short matches.\n\nThe appeal is the back‑and‑forth rhythm—you’re always one lucky bounce away from a goal, or one mistake away from conceding. Special shots and power‑ups add variety, but the core game is about timing your jumps to protect your net and catch the other player out of position.","/media/head-soccer-2023.webp",[45,10],"https://23azostore.github.io/s4/head-soccer-2023/",{"slug":83,"title":84,"description":85,"image":86,"categories":87,"format":11,"url":88},"idle-digging-tycoon","Idle Digging Tycoon","Idle Digging Tycoon puts you in charge of a mining operation where your goal is to dig deep and uncover hidden treasures. You manage a team of workers, upgrading their tools and stamina to increase efficiency. As you dig deeper, you’ll find gold, diamonds, and ancient artifacts that can be sold for profit.\n\nThe game features a satisfying progression system, allowing you to build structures and expand your business empire. It’s a perfect idle game for those who enjoy watching their efforts compound into massive rewards, even while they’re away.","/media/idle-digging-tycoon.webp",[29,10],"https://data.gameonl.com/4ef75be8-bf0a-4fdf-aa1a-5a01589fea5a/index.html?noads=true",{"slug":90,"title":91,"description":92,"image":93,"categories":94,"format":11,"url":95},"idle-lumber-inc","Idle Lumber Inc","Idle Lumber Inc challenges you to build and manage your own lumber empire. Start by chopping down trees and processing logs, then reinvest your earnings to hire more workers and upgrade your machinery. The goal is to streamline production and maximize profits as you expand your operations.\n\nYou’ll also need to manage resources sustainably, planting new trees to ensure a steady supply of timber. With its colorful graphics and addictive gameplay loop, Idle Lumber Inc offers a rewarding simulation experience for aspiring tycoons.","/media/idle-lumber-inc.webp",[29,10],"https://23azostore.github.io/s5/idle-lumber-inc/",{"slug":97,"title":98,"description":99,"image":100,"categories":101,"format":11,"url":102},"masked-forces","Masked Forces","Masked Forces is a tactical first-person shooter where you fight for survival in various game modes. Join a team or go solo in intense battles against other players or AI bots.\n\nThe game features a wide arsenal of weapons, armor, and upgrades. Customize your loadout and use strategy to outsmart your enemies in this fast-paced shooter.","/media/masked-forces.webp",[9],"https://23azostore.github.io/s8/masked-forces/",1765458183804]