[{"data":1,"prerenderedAt":210},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"game-stick-defenders":40,"similar-stick-defenders":56},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",{"slug":41,"title":42,"image":43,"categories":44,"format":45,"url":46,"content":47,"description":48,"keywords":49,"rating":50,"votes":51,"developer":52,"platform":53,"lastUpdated":55},"stick-defenders","Stick Defenders","/media/stick-defenders.webp",[32,23],"html5","https://23azostore.github.io/s6/stick-defenders/","Stick Defenders - Pizza Edition github io Unblocked Games: Play instantly in fullscreen browser, no downloads, no ads. Enjoy games now!","Play Stick Defenders unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Stick Defenders Pizza Edition, Stick Defenders Fullscreen, Stick Defenders unblocked",9.5,47787,"Pizza Edition",[54],"Desktop Web","August 2023",[57,70,84,97,110,124,137,150,162,174,186,198],{"slug":58,"title":59,"image":60,"categories":61,"format":45,"url":62,"content":63,"description":64,"keywords":65,"rating":50,"votes":66,"developer":67,"platform":68,"lastUpdated":69},"blumgi-ball","Blumgi Ball","/media/blumgi-ball.webp",[35,23,17],"https://sudoku-online.github.io/a2/blumgi-ball/","Blumgi Ball blends basketball shots with simple puzzle layouts. You pull back to set power and angle, release to send the ball, and press to teleport next to it so you can chain throws from smarter positions. Levels introduce surfaces, gaps, and tricks that ask for one or two clean shots rather than brute force. As you clear stages, you unlock new characters and learn small habits—teleport before the bounce you want, aim lower when an obstacle steals arc, and keep attempts tight to avoid awkward ricochets. It’s compact, responsive, and satisfying when a planned sequence lands.","Play Blumgi Ball Pizza Edition unblocked in fullscreen. The best sports gameplay. Free online game - no downloads required!","Blumgi Ball Pizza Edition, Blumgi Ball Fullscreen, Blumgi Ball unblocked, sports games",44222,"Independent Developer",[54],"April 2023",{"slug":71,"title":72,"image":73,"categories":74,"format":45,"url":75,"content":76,"description":77,"keywords":78,"rating":79,"votes":80,"developer":81,"platform":82,"lastUpdated":83},"blumgi-castle","Blumgi Castle","/media/blumgi-castle.webp",[29,23,17],"https://23azostore.github.io/s2/blumgi-castle/","Blumgi Castle is a slingshot skill game about dropping enemies into the water with well‑placed shots and tools. You aim with an indicator, hold to set power, and release to fire bombs or special weapons that can carve platforms, push creatures off edges, or clear cover. There’s room to experiment—bigger blasts, saws, lasers, and other toys reward different approaches—and finishing a level cleanly often comes down to picking one good angle and sticking to it. Progress adds new characters and layouts while keeping controls simple.","Play Blumgi Castle unblocked: Pizza Edition in full screen. A great puzzle game to play free online.","Blumgi Castle Pizza Edition, Blumgi Castle Fullscreen, Blumgi Castle unblocked, puzzle games",8.4,29097,"Pizza Games Studio",[54],"July 2024",{"slug":85,"title":86,"image":87,"categories":88,"format":45,"url":89,"content":90,"description":91,"keywords":92,"rating":50,"votes":93,"developer":94,"platform":95,"lastUpdated":96},"blumgi-rocket","Blumgi Rocket","/media/blumgi-rocket.webp",[11,23,17],"https://webglmath.github.io/blumgi-rocket/","Blumgi Rocket is a side‑scrolling platformer built around a rocket‑boosted car. You hold for thrust, enjoy a short slow‑motion window during burns, and use stunts to keep pace through hills, tunnels, and tight gaps. Tracks hide shortcuts and safer lines, so a clean route often matters more than constant speed. New skins arrive as you clear levels, and the handling stays consistent enough that learning one car’s rhythm carries across the set.","Experience Blumgi Rocket Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting arcade game. Start playing now!","Blumgi Rocket Pizza Edition, Blumgi Rocket Fullscreen, Blumgi Rocket unblocked, arcade games",17640,"Pizza Editione",[54],"September 2023",{"slug":98,"title":99,"image":100,"categories":101,"format":45,"url":102,"content":103,"description":104,"keywords":105,"rating":79,"votes":106,"developer":107,"platform":108,"lastUpdated":109},"blumgi-slime","Blumgi Slime","/media/blumgi-slime.webp",[11,23,17],"https://23azostore.github.io/s2/blumgi-slime","Blumgi Slime is a jump‑only platformer. Your character can’t walk, so you hold to charge, release to leap, and aim for clean arcs that land on safe ground or the checkered goal. Stages add new colors and obstacle types as you go, but the core stays readable: judge distance, pick a height, and commit. It’s a simple loop that feels good when you string jumps together without hesitation.","Blumgi Slime Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Blumgi Slime Pizza Edition, Blumgi Slime Fullscreen, Blumgi Slime unblocked, arcade games",13957,"Game Studio",[54],"November 2023",{"slug":111,"title":112,"image":113,"categories":114,"format":45,"url":115,"content":116,"description":117,"keywords":118,"rating":119,"votes":120,"developer":121,"platform":122,"lastUpdated":123},"cannon-strike","Cannon Strike","/media/cannon-strike.webp",[32],"https://htmlxm.github.io/h2/cannon-strike","Cannon Strike is a physics puzzle about firing pellets into a container while the path changes around you. You set angle and timing from a fixed cannon, then watch pellets bounce off surfaces, slip through rotating bars, and settle—if you judged correctly—where you need them. Early levels are forgiving, but later layouts ask for tighter shots and a better sense of how motion will carry after a bounce.\n\nMoment to moment you’re deciding whether to shoot now or wait for a safer alignment. The game respects patience; a clean release is usually better than brute force. Limited ammo or stricter thresholds show up as you progress, which encourages smarter planning rather than rushing. It’s the kind of puzzle where each success feels earned, and small adjustments lead to reliable solutions without trial‑and‑error grind.","Experience Cannon Strike Pizza Edition unblocked! Play fullscreen on PizaGame. Master this shooting challenge. Start playing now!","Cannon Strike Pizza Edition, Cannon Strike Fullscreen, Cannon Strike unblocked, shooting games",8.6,32373,"Pizza Dev Team",[54],"December 2023",{"slug":125,"title":126,"image":127,"categories":128,"format":45,"url":129,"content":130,"description":131,"keywords":132,"rating":133,"votes":134,"developer":52,"platform":135,"lastUpdated":136},"color-switch","Color Switch","/media/color-switch.webp",[11,23],"https://23azostore.github.io/s8/color-switch/","Color Switch is a tap‑to‑rise game where you pass a bouncing ball through moving shapes only when colors match. Obstacles rotate and shift, forcing you to hold a steady rhythm and wait for a safe opening. It’s clear and readable, and the quick restart makes it easy to turn a small mistake into another attempt without friction.\n\nMoment to moment you’re deciding whether to risk a pass early or let the pattern cycle once more. Pace picks up as layouts demand consecutive clean taps, and patience often beats rushing. The appeal is in the simplicity: one input, reliable rules, and obstacles that always teach you something about timing. It’s a focused, satisfying challenge that shows improvement in minutes.","Play Color Switch Pizza Edition unblocked in fullscreen. Enjoy this exciting arcade game. Free online game - no downloads required!","Color Switch Pizza Edition, Color Switch Fullscreen, Color Switch unblocked, arcade games",9.3,11839,[54],"May 2023",{"slug":138,"title":139,"image":140,"categories":141,"format":45,"url":142,"content":143,"description":144,"keywords":145,"rating":146,"votes":147,"developer":52,"platform":148,"lastUpdated":149},"crossy-road","Crossy Road","/media/crossy-road.webp",[11,23],"https://ubg98.github.io/CrossyRoad/","Crossy Road is a hop‑forward arcade game about looking, waiting, and moving at the right moment. Traffic and rivers form shifting patterns: cars pace in lanes, logs glide at different speeds, and trains cut through on a strict schedule. You dart across when a window opens, pause when it closes, and learn to avoid risky moves that lead to stranded hops.\n\nMoment to moment you’re scanning a few steps ahead and trusting small timings—a quick double hop, a hold to let a lane clear, a step back to avoid a bad sequence. The pace is gentle at first and grows as you survive longer, and the satisfaction comes from making clean, sensible choices. It’s easy to start and tough to master, with runs that tell short stories of near misses and tidy escapes.","Crossy Road Pizza Edition: Play unblocked fullscreen. Enjoy this top arcade game without downloads.","Crossy Road Pizza Edition, Crossy Road Fullscreen, Crossy Road unblocked, arcade games",9.6,32299,[54],"February 2023",{"slug":151,"title":152,"image":153,"categories":154,"format":45,"url":155,"content":156,"description":157,"keywords":158,"rating":146,"votes":159,"developer":52,"platform":160,"lastUpdated":161},"doodle-jump","Doodle Jump","/media/doodle-jump.webp",[11,23],"https://23azostore.github.io/s7/doodle-jump/","Doodle Jump is a vertical climb where survival comes from steady timing and small, confident moves. Platforms slide and shift, gaps appear without warning, and hazards punish jumps made a fraction too early. You steer left and right, commit to a route, and learn to favor safe landings over risky leaps that save a second and cost a run.\n\nMoment to moment, it’s about reading what’s two steps ahead: a moving platform that needs a patient approach, a fragile one that buys height but won’t hold twice, a hazard you clear by trusting your jump arc. The rhythm is brisk—quick restarts, visible improvement—and scores rise when you stop chasing miracles and string together clean decisions. It’s straightforward, honest platforming that rewards calm execution.","Play Doodle Jump unblocked: Pizza Edition in full screen. A great arcade game to play free online.","Doodle Jump Pizza Edition, Doodle Jump Fullscreen, Doodle Jump unblocked, arcade games",10962,[54],"November 2024",{"slug":163,"title":164,"image":165,"categories":166,"format":45,"url":167,"content":168,"description":169,"keywords":170,"rating":171,"votes":172,"developer":52,"platform":173,"lastUpdated":69},"free-kick-shooter","Free Kick Shooter","/media/free-kick-shooter.webp",[32,35],"https://23azostore.github.io/s4/free-kick-shooter/","Free Kick Shooter tests your accuracy and precision as you take free kicks from various positions on the field. You have to account for wind direction and the goalkeeper’s movements to curl the ball into the net. As you progress, the challenges get harder with more defenders and tricky angles.\n\nThe game features a simple swipe-to-shoot mechanic that feels satisfying to master. It’s an addictive sports game that lets you live out the fantasy of scoring the winning goal in a high-pressure situation.","Play Free Kick Shooter unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Free Kick Shooter Pizza Edition, Free Kick Shooter Fullscreen, Free Kick Shooter unblocked",9,55376,[54],{"slug":175,"title":176,"image":177,"categories":178,"format":45,"url":179,"content":180,"description":181,"keywords":182,"rating":119,"votes":183,"developer":94,"platform":184,"lastUpdated":185},"getaway-shootout","Getaway Shootout","/media/getaway-shootout.webp",[32,17],"https://23azostore.github.io/s4/getaway-shootout/","Getaway Shootout is a frantic two-player game where you race to the helicopter to escape. Jump, shoot, and use power-ups to hinder your opponents in a chaotic dash for freedom.\n\nThe game features ragdoll physics and hilarious movement mechanics. Play against the computer or a friend in local multiplayer and see who can make the getaway first.","Getaway Shootout Pizza Edition: Play unblocked fullscreen. Enjoy this top shooting game without downloads.","Getaway Shootout Pizza Edition, Getaway Shootout Fullscreen, Getaway Shootout unblocked",15448,[54],"April 2024",{"slug":187,"title":188,"image":189,"categories":190,"format":45,"url":191,"content":192,"description":193,"keywords":194,"rating":195,"votes":196,"developer":67,"platform":197,"lastUpdated":136},"hammer-2-reloaded","Hammer 2 Reloaded","/media/hammer-2-reloaded.webp",[32],"https://23azostore.github.io/s4/hammer-2-reloaded/","Hammer 2 Reloaded is a third‑person action shooter set in a gritty city. You control a vigilante clearing the streets of bad guys, using guns, melee attacks, and vehicles to get the job done. The action is chaotic and open—you can hijack cars, blow up barrels, and use the environment to take cover.\n\nMoment to moment you’re constantly moving, switching targets, and looking for better weapons or a getaway car. Missions give you specific goals, but the fun often comes from the unscripted mess of a shootout going wrong and you improvising a way out. It’s a sandbox of destruction that doesn’t take itself too seriously.","Experience Hammer 2 Reloaded Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting shooting game. Start playing now!","Hammer 2 Reloaded Pizza Edition, Hammer 2 Reloaded Fullscreen, Hammer 2 Reloaded unblocked",9.4,51138,[54],{"slug":199,"title":200,"image":201,"categories":202,"format":45,"url":203,"content":204,"description":205,"keywords":206,"rating":171,"votes":207,"developer":67,"platform":208,"lastUpdated":209},"masked-forces","Masked Forces","/media/masked-forces.webp",[32,17],"https://23azostore.github.io/s8/masked-forces/","Masked Forces is a tactical first-person shooter where you fight for survival in various game modes. Join a team or go solo in intense battles against other players or AI bots.\n\nThe game features a wide arsenal of weapons, armor, and upgrades. Customize your loadout and use strategy to outsmart your enemies in this fast-paced shooter.","Play Masked Forces unblocked: Pizza Edition in full screen. A great shooting game to play free online.","Masked Forces Pizza Edition, Masked Forces Fullscreen, Masked Forces unblocked, shooting games",55493,[54],"September 2024",1766648316314]