[{"data":1,"prerenderedAt":358},["ShallowReactive",2],{"$f4fiF4G_0KCJqnOFAigCiDipzx0-krq7kE-6QXcL-1M8":3,"$fu26v6W_Cez6Lym8r-4KmC4wxX1CSVgEfFrHh6PynxVk":40,"$fBS1DaJBZodz-qQx1HaxCSvCKdHOUZyOW4sCLMMKDDSg":53},[4,7,10,13,16,19,22,25,28,31,34,37],{"slug":5,"name":6},"action","Action",{"slug":8,"name":9},"adventure","Adventure",{"slug":11,"name":12},"arcade","Arcade",{"slug":14,"name":15},"driving","Driving",{"slug":17,"name":18},"multiplayer","Multiplayer",{"slug":20,"name":21},"new","New",{"slug":23,"name":24},"originals","Originals",{"slug":26,"name":27},"popular","Popular",{"slug":29,"name":30},"puzzle","Puzzle",{"slug":32,"name":33},"shooting","Shooting",{"slug":35,"name":36},"sports","Sports",{"slug":38,"name":39},"strategy","Strategy",[41,42,43,44,45,46,47,48,49,50,51,52],{"slug":5,"name":6},{"slug":8,"name":9},{"slug":11,"name":12},{"slug":14,"name":15},{"slug":17,"name":18},{"slug":20,"name":21},{"slug":23,"name":24},{"slug":26,"name":27},{"slug":29,"name":30},{"slug":32,"name":33},{"slug":35,"name":36},{"slug":38,"name":39},[54,70,84,98,112,125,138,152,165,178,189,203,216,231,236,250,264,278,291,305,318,331,344],{"slug":55,"title":56,"image":57,"categories":58,"format":59,"url":60,"content":61,"description":62,"keywords":63,"rating":64,"votes":65,"developer":66,"platform":67,"lastUpdated":69},"burrito-bison","Burrito Bison","/media/burrito-bison.webp",[5],"html5","https://23azostore.github.io/s7/burrito-bison/","Burrito Bison is a launch‑and‑bounce game where distance comes from smart timing and messy collisions. Each run begins with a powerful throw, then you keep speed by slamming into gummy opponents and chaining hits without dropping momentum. Obstacles, gates, and brief slowdowns force you to read the road and decide when to use a heavy slam or save a boost for a cleaner section ahead.\n\nThe loop is short and satisfying: push a little farther, earn currency, and invest in upgrades that make the next attempt more stable. Moment to moment you’re watching arcs, nudging the angle to catch a high‑value target, and choosing whether to burn a special ability to rescue a sagging run. The challenge is consistency rather than perfection, and small improvements add up until long, flowing chains become normal.\n\nIt’s bright and playful, but it rewards attention. Runs feel better when you manage pacing—holding off on a slam to keep a combo alive, or spending at the right time to break through a barrier. Progression isn’t only about raw power; it’s learning to spot good lines and avoiding stalls that kill speed. That mix keeps retries engaging, turning a minute into a series of fun, measurable gains.","Play Burrito Bison unblocked: Pizza Edition in full screen. A great action game to play free online.","Burrito Bison Pizza Edition, Burrito Bison Fullscreen, Burrito Bison unblocked, action games",9,57929,"Pizza Dev Team",[68],"Desktop Web","November 2024",{"slug":71,"title":72,"image":73,"categories":74,"format":59,"url":75,"content":76,"description":77,"keywords":78,"rating":79,"votes":80,"developer":81,"platform":82,"lastUpdated":83},"dreadhead-parkour","Dreadhead Parkour","/media/dreadhead-parkour.webp",[5],"https://htmlxm.github.io/h7/dreadhead-parkour","Dreadhead Parkour is a 2D run built around simple inputs and sharp obstacles. You jump, slide, and adjust in midair to thread gaps, bounce off platforms, and avoid hazards that punish sloppy timing. Levels are short and restart instantly, which puts the focus on learning patterns and carrying clean movement from one challenge to the next.\n\nMoment to moment you’re committing early—jump now to catch the apex—or waiting a beat to let a threat pass. Progress comes from rhythm more than speed, and the satisfaction lives in a perfect section that used to look impossible. It’s approachable, quick, and tuned for those small got it moments.","Experience Dreadhead Parkour Pizza Edition unblocked! Play fullscreen on PizaGame. The best action gameplay. Start playing now!","Dreadhead Parkour Pizza Edition, Dreadhead Parkour Fullscreen, Dreadhead Parkour unblocked",8.8,36475,"Independent Developer",[68],"November 2023",{"slug":85,"title":86,"image":87,"categories":88,"format":59,"url":89,"content":90,"description":91,"keywords":92,"rating":93,"votes":94,"developer":95,"platform":96,"lastUpdated":97},"house-of-hazards","House of Hazards","/media/house-of-hazards.webp",[5,17],"https://23azostore.github.io/s/house-of-hazards/","House of Hazards is a hilarious multiplayer game where completing simple household chores becomes a chaotic challenge. Players take turns trying to finish tasks like making coffee or watering plants, while the others set off traps to stop them. Watch out for falling lamps, flying toast, and slippery floors!\n\nThe game is perfect for playing with friends, offering plenty of laughs as you sabotage each other’s efforts. With its quirky art style and unpredictable gameplay, House of Hazards turns mundane activities into a competitive and entertaining battle for survival.","Play House of Hazards unblocked: Pizza Edition in full screen. A great action game to play free online.","House of Hazards Pizza Edition, House of Hazards Fullscreen, House of Hazards unblocked",8.5,11452,"Game Studio",[68],"August 2024",{"slug":99,"title":100,"image":101,"categories":102,"format":59,"url":103,"content":104,"description":105,"keywords":106,"rating":107,"votes":108,"developer":109,"platform":110,"lastUpdated":111},"iron-snout","Iron Snout","/media/iron-snout.webp",[5,17],"https://webglmath.github.io/iron-snout/","Iron Snout is a fast-paced fighting game where you play as a ninja pig defending against waves of wolves. Using simple controls, you can punch, kick, and flip to defeat enemies attacking from all sides. You can even catch weapons thrown at you and use them against your attackers.\n\nThe combat is fluid and satisfying, with hilarious animations and brutal takedowns. As you survive longer, the waves get more intense, introducing new enemy types and hazards. It’s an addictive brawler that tests your reflexes and timing.","Play Iron Snout unblocked: Pizza Edition in full screen. A great action game to play free online.","Iron Snout Pizza Edition, Iron Snout Fullscreen, Iron Snout unblocked, action games, play Iron Snout",8.4,33471,"Pizza Edition",[68],"April 2023",{"slug":113,"title":114,"image":115,"categories":116,"format":59,"url":117,"content":118,"description":119,"keywords":120,"rating":121,"votes":122,"developer":66,"platform":123,"lastUpdated":124},"mad-day","Mad Day","/media/mad-day.webp",[5],"https://23azostore.github.io/s2/mad-day/","Mad Day is an action-packed driving game where you battle alien invaders to rescue your beloved pet octopus. Drive, shoot, and jump your way through hordes of enemies in this explosive adventure.\n\nThe game features a variety of vehicles, weapons, and upgrades. Customize your ride and unleash chaos on the alien forces in this fun and addictive game.","Play Mad Day unblocked: Pizza Edition in full screen. A great action game to play free online.","Mad Day Pizza Edition, Mad Day Fullscreen, Mad Day unblocked, action games, play Mad Day",9.7,41821,[68],"February 2023",{"slug":126,"title":127,"image":128,"categories":129,"format":59,"url":130,"content":131,"description":132,"keywords":133,"rating":134,"votes":135,"developer":109,"platform":136,"lastUpdated":137},"murder","Murder","/media/murder.webp",[5],"https://htmlxm.github.io/h5/murder/","Murder is a funny assassination game where you try to eliminate the king and take his place. Sneak up behind the monarch and strike when he's not looking, but be careful not to get caught!\n\nOnce you become the king, you must watch your own back as others will try to assassinate you. React quickly to catch potential killers and throw them into the dungeon. How long can you hold onto the throne?","Play Murder unblocked: Pizza Edition in full screen. A great action game to play free online.","Murder Pizza Edition, Murder Fullscreen, Murder unblocked, action games, play Murder",9.4,31810,[68],"October 2023",{"slug":139,"title":140,"image":141,"categories":142,"format":59,"url":143,"content":144,"description":145,"keywords":146,"rating":147,"votes":148,"developer":149,"platform":150,"lastUpdated":151},"striker-dummies","Striker Dummies","/media/striker-dummies.webp",[5,17],"https://23azostore.github.io/s3/striker-dummies/","Striker Dummies is a fighting game where you control wooden dummies battling it out with giant hammers. Swing your weapon, dodge attacks, and try to smash your opponent into pieces.\n\nThe game features simple controls but intense combat. Play against the AI or challenge a friend in two-player mode. Who will be the last dummy standing?","Experience Striker Dummies Pizza Edition unblocked! Play fullscreen on PizaGame. Enjoy this exciting action game. Start playing now!","Striker Dummies Pizza Edition, Striker Dummies Fullscreen, Striker Dummies unblocked, action games",9.1,57474,"Pizza Games Studio",[68],"March 2023",{"slug":153,"title":154,"image":155,"categories":156,"format":59,"url":157,"content":158,"description":159,"keywords":160,"rating":161,"votes":162,"developer":109,"platform":163,"lastUpdated":164},"superbattle-2","SuperBattle 2","/media/superbattle-2.webp",[5,17],"https://23azostore.github.io/s3/superbattle-2/","SuperBattle 2 is a competitive two-player game with a collection of minigames. Challenge your friend on the same device in various modes like soccer, racing, and tank battles.\n\nThe game features simple one-button controls and colorful graphics. It's perfect for quick matches and settling rivalries. Choose your favorite minigame and see who is the superior player.","Play SuperBattle 2 unblocked: Pizza Edition in full screen. A great action game to play free online.","SuperBattle 2 Pizza Edition, SuperBattle 2 Fullscreen, SuperBattle 2 unblocked, action games",9.2,12816,[68],"October 2024",{"slug":166,"title":167,"image":168,"categories":169,"format":59,"url":170,"content":171,"description":172,"keywords":173,"rating":174,"votes":175,"developer":66,"platform":176,"lastUpdated":177},"tag","Tag","/media/tag.webp",[5,17],"https://htmlxm.github.io/h3/tag/","Tag is a multiplayer game of catch! Play with friends or against the computer in various arenas. Run, jump, and slide to avoid being 'it' or chase down your opponents to pass the tag.\n\nThe game features simple controls and fast-paced action. Use the environment to your advantage, hide behind obstacles, and outsmart your friends in this classic playground game.","Play Tag unblocked: Pizza Edition in full screen. A great action game to play free online.","Tag Pizza Edition, Tag Fullscreen, Tag unblocked, action games, play Tag",8.6,43274,[68],"December 2024",{"slug":179,"title":180,"image":181,"categories":182,"format":59,"url":183,"content":184,"description":185,"keywords":186,"rating":79,"votes":187,"developer":81,"platform":188,"lastUpdated":151},"thumb-fighter-christmas","Thumb Fighter Christmas","/media/thumb-fighter-christmas.webp",[5,17],"https://23azostore.github.io/s3/thumb-fighter/","Thumb Fighter Christmas - Pizza Edition github io Unblocked Games: Play instantly in fullscreen browser, no downloads, no ads. Enjoy games now!","Play Thumb Fighter Christmas Pizza Edition unblocked in fullscreen. Master this action challenge. Free online game - no downloads required!","Thumb Fighter Christmas Pizza Edition, Thumb Fighter Christmas Fullscreen",32565,[68],{"slug":190,"title":191,"image":192,"categories":193,"format":59,"url":194,"content":195,"description":196,"keywords":197,"rating":134,"votes":198,"keybindings":199,"developer":200,"platform":201,"lastUpdated":202},"swatforce-vs-terrorists","Swatforce vs Terrorists","/media/swatforce-vs-terrorists.webp",[32,5,20],"https://htmlxm.github.io/h3/swatforce-vs-terrorists","Prepare for high-intensity tactical combat in Swatforce vs Terrorists, an action-packed shooter where you lead an elite SWAT team against global threats. The game features over 40 challenging missions that require a mix of fast reflexes and strategic planning. You can unlock and upgrade a massive arsenal of 60 different weapons, ranging from tactical pistols and assault rifles to heavy-duty flamethrowers and defensive turrets. Each level demands a different approach—whether it's holding a defensive line or clearing out enemy strongholds. It's a gritty, engaging experience for fans of military-themed action games.","Swatforce vs Terrorists : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Swatforce vs Terrorists Pizza Edition, Swatforce vs Terrorists Fullscreen, Swatforce vs Terrorists unblocked, arcade games",31503,"Aim and Shoot: Mouse Left Click\nReload: R\nSwitch Weapons: Number Keys 1-5\nSpecial Action: Space","Playtouch",[68],"April 2024",{"slug":204,"title":205,"image":206,"categories":207,"format":59,"url":208,"content":209,"description":210,"keywords":211,"rating":147,"votes":212,"developer":213,"keybindings":214,"platform":215,"lastUpdated":177},"vex-5","Vex 5","/media/vex-5.webp",[5,11,29,20],"https://htmlxm.github.io/h8/vex-5","Vex 5 takes the legendary stickman platformer series to new heights with even more challenging levels and complex traps. Test your reflexes as you run, jump, slide, and swim through various 'Acts' filled with spinning saw blades, falling spikes, and laser beams. This installment introduces the 'Challenge Room' and a leveling system that keeps the adrenaline pumping. Mastery of movement is key—timing your jumps and slides perfectly is the only way to reach the green checkpoints and finish the level.","Vex 5 : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Vex 5 Pizza Edition, Vex 5 Fullscreen, Vex 5 unblocked, arcade games",16591,"Amazing Adam","WASD or Arrow Keys: Move, Jump, and Slide\nR: Restart Level\nEnter: Confirm/Start",[68],{"slug":217,"title":218,"image":219,"categories":220,"format":59,"url":221,"content":222,"description":223,"keywords":224,"rating":225,"votes":226,"keybindings":227,"developer":228,"platform":229,"lastUpdated":230},"minecraft-188","Minecraft 1.8.8","/media/minecraft-188.webp",[8,5,20],"https://htmlxm.github.io/h7/minecraft-1.8.8","Minecraft 1.8.8, known as a definitive patch of the 'Bountiful Update,' remains a fan-favorite for its stability and refined combat mechanics. In this limitless sandbox, you can dive into 'Survival Mode' to battle Guardians in underwater monuments, or switch to 'Creative Mode' to build architectural marvels using blocks like granite, diorite, and slime blocks. This specific version is highly prized by the competitive PvP community (such as BedWars and SkyWars players) for its classic 'hit-reg' system and smooth performance on web browsers. Whether you are engineering complex redstone machines or exploring the infinite procedural terrain, Minecraft 1.8.8 offers the purest block-building adventure available without the need for a heavy installation.","Minecraft 1.8.8 : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Minecraft 1.8.8 Pizza Edition, Minecraft 1.8.8 Fullscreen, Minecraft 1.8.8 unblocked, arcade games",8.9,37468,"W/A/S/D: Move; Space: Jump; Left Click: Mine/Attack; Right Click: Place/Interact; E: Inventory; Q: Drop Item; 1-9: Hotbar Slots; Esc: Menu","Mojang Studios",[68],"February 2025",{"slug":204,"title":205,"image":206,"categories":232,"format":59,"url":208,"content":233,"description":210,"keywords":211,"rating":147,"votes":212,"keybindings":234,"developer":213,"platform":235,"lastUpdated":177},[5,11],"Vex 5 takes the legendary stickman parkour series to new heights with even more intricate level designs and punishing obstacles. As a test of pure platforming skill, you must run, jump, slide, and swim through a gauntlet of spinning saw blades, falling spikes, and high-speed zip lines. This installment introduces the 'Challenge Room,' a grueling series of 30 levels designed to push even Vex veterans to their breaking point. The game rewards momentum and precision; mastering the wall-jump and timing your slides is essential to earning those elusive gold trophies. With its clean graphics and responsive physics, Vex 5 is a 'just one more try' experience that satisfies the speedrunner in everyone.","W/A/S/D or Arrow Keys: Move/Jump/Slide; R: Restart Level",[68],{"slug":237,"title":238,"image":239,"categories":240,"format":59,"url":241,"content":242,"description":243,"keywords":244,"rating":245,"votes":246,"developer":247,"keybindings":248,"platform":249,"lastUpdated":164},"survivor-in-rainbow-monster","Survivor In Rainbow Monster","/media/survivor-in-rainbow-monster.webp",[5,8],"https://htmlxm.github.io/h3/survivor-in-rainbow-monster","Step into a thrilling hide-and-seek horror adventure in Survivor In Rainbow Monster. After being kidnapped during a school trip to an abandoned amusement park, you must survive five nights in a realm filled with colorful yet deadly creatures. Each night brings a new challenge: from collecting blocks to fixing machines, all while avoiding the iconic Blue, Green, and Orange monsters. The game masterfully combines stealth mechanics with intense chase sequences. You'll need to listen closely to footsteps and use lockers or boxes to hide, making every mission a heart-pounding test of nerves and strategy.","Survivor In Rainbow Monster : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Survivor In Rainbow Monster Pizza Edition, Survivor In Rainbow Monster Fullscreen, Survivor In Rainbow Monster unblocked, arcade games",8.7,59129,"Great Arcade Games","WASD / Arrow Keys: Move\nSpace: Action/Interact\nMouse: Look around\nF: Hide/Box",[68],{"slug":251,"title":252,"image":253,"categories":254,"format":59,"url":255,"content":256,"description":257,"keywords":258,"rating":161,"votes":259,"developer":260,"keybindings":261,"platform":262,"lastUpdated":263},"bearsus","Bearsus","/media/bearsus.webp",[5,35],"https://htmlxm.github.io/h2/bearsus","Bearsus is a high-energy, bear-themed wrestling game that proves you only need two buttons to deliver a knockout blow. In this quirky fighting title, you control a massive grizzly bear competing in the 'Bear Knuckle' championship. The gameplay is deceptively simple: one button to jump and one to attack, but mastering the timing and positioning is key to victory. Whether you're playing solo in Arcade Mode or challenging a friend in local multiplayer, Bearsus offers fast-paced rounds, satisfying impact physics, and a cast of unlockable bears with unique visual styles. It's a roar-some mix of arcade action and competitive sportsmanship.","Bearsus : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Bearsus Pizza Edition, Bearsus Fullscreen, Bearsus unblocked, arcade games",71168,"ARF Game Studio","Player 1: A (Jump), D (Attack)\nPlayer 2: Left Arrow (Jump), Right Arrow (Attack)",[68],"August 2025",{"slug":265,"title":266,"image":267,"categories":268,"format":59,"url":269,"content":270,"description":271,"keywords":272,"rating":174,"votes":273,"developer":274,"keybindings":275,"platform":276,"lastUpdated":277},"cubito-mayhem","Cubito Mayhem","/media/cubito-mayhem.webp",[5,32],"https://htmlxm.github.io/h7/cubito-mayhem","Cubito Mayhem is an intense top-down arena shooter that pits your geometric survival skills against waves of relentless cubic enemies. In this neon-soaked battlefield, you must navigate through 'bullet hell' scenarios, dodging projectiles while unleashing a variety of powerful weapons. The game features a progression system where you can upgrade your cube's abilities, speed, and firepower as the chaos intensifies. With its minimalist art style and rhythmic gameplay, Cubito Mayhem demands fast reflexes and strategic movement, offering a pure arcade experience that is both challenging and incredibly addictive.","Cubito Mayhem : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Cubito Mayhem Pizza Edition, Cubito Mayhem Fullscreen, Cubito Mayhem unblocked, arcade games",38241,"DarkPlay Games","WASD: Move\nMouse: Aim\nLeft Click: Shoot\nSpace: Dash/Special Ability",[68],"May 2025",{"slug":279,"title":280,"image":281,"categories":282,"format":59,"url":283,"content":284,"description":285,"keywords":286,"rating":225,"votes":287,"developer":288,"keybindings":289,"platform":290,"lastUpdated":202},"smash-karts","Smash Karts","/media/smash-karts.webp",[5,14,11],"https://htmlxm.github.io/h/smash-karts","Smash Karts is a high-octane 3D multiplayer kart battle arena game that trades traditional finish lines for explosive combat. Players jump into a fast-paced 3-minute round where the goal is to collect power-up boxes scattered across the map and use an arsenal of wacky weapons—ranging from rockets and machine guns to mines and explosive lobsters—to eliminate opponents. The game features a deep customization system where you can unlock various characters, karts, and hats as you level up. With its smooth physics and competitive leaderboard, it offers a perfect blend of kart racing mechanics and arena shooter intensity that keeps you coming back for 'just one more round'.","Smash Karts : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Smash Karts Pizza Edition, Smash Karts Fullscreen, Smash Karts unblocked, arcade games",54205,"Tall Team","WASD or Arrow Keys: Drive and Steer\nSpace: Use Weapon / Fire\nEnter: Chat",[68],{"slug":292,"title":293,"image":294,"categories":295,"format":59,"url":296,"content":297,"description":298,"keywords":299,"rating":64,"votes":300,"developer":301,"keybindings":302,"platform":303,"lastUpdated":304},"thumb-fighter","Thumb Fighter","/media/thumb-fighter.webp",[5,11],"https://htmlxm.github.io/h3/thumb-fighter","Thumb Fighter brings the classic playground game of 'Thumb War' to the digital world with a hilarious and competitive twist. This two-button fighting game is all about timing, baiting, and stamina management. Players choose from a massive roster of quirky characters—from zombies and superheroes to pop-culture icons—to engage in 1-on-1 duels. The objective is simple: wait for your opponent to strike, then pin their thumb down until their health bar depletes. Its simplicity makes it the ultimate local multiplayer game, providing instant fun and laughs whether you're playing against a friend on the same keyboard or testing your reflexes against the computer.","Thumb Fighter : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Thumb Fighter Pizza Edition, Thumb Fighter Fullscreen, Thumb Fighter unblocked, arcade games",45429,"AVIX Games","Player 1: A key (Attack/Pin)\nPlayer 2: L key (Attack/Pin)",[68],"July 2025",{"slug":306,"title":307,"image":308,"categories":309,"format":59,"url":310,"content":311,"description":312,"keywords":313,"rating":174,"votes":314,"developer":315,"keybindings":316,"platform":317,"lastUpdated":177},"10-minutes-till-dawn","10 Minutes Till Dawn","/media/10-minutes-till-dawn.webp",[32,5],"https://htmlxm.github.io/h7/10-minutes-till-dawn","Prepare for an intense survival experience in 10 Minutes Till Dawn, a roguelike shoot-em-up with a striking monochromatic art style. You are tasked with surviving 10 minutes against an ever-growing horde of Lovecraftian monsters. Each playthrough is unique as you select from various characters and upgrade paths—ranging from fire-infused bullets to lightning strikes. The tension builds every second as the screen fills with enemies, forcing you to find the perfect balance between offensive firepower and defensive movement. It's a condensed, high-octane version of the 'bullet heaven' genre.","10 Minutes Till Dawn : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","10 Minutes Till Dawn Pizza Edition, 10 Minutes Till Dawn Fullscreen, 10 Minutes Till Dawn unblocked, arcade games",55211,"flanne","WASD: Move\nMouse: Aim\nLeft Click: Shoot\nR: Reload",[68],{"slug":319,"title":320,"image":321,"categories":322,"format":59,"url":323,"content":324,"description":325,"keywords":326,"rating":225,"votes":327,"developer":328,"keybindings":329,"platform":330,"lastUpdated":304},"tomb-of-the-mask","Tomb Of The Mask","/media/tomb-of-the-mask.webp",[5,11],"https://htmlxm.github.io/h8/tomb-of-the-mask","Tomb of the Mask is a fast-paced arcade game that feels like a modern evolution of Pac-Man mixed with high-speed platforming. Players explore an infinite, procedurally generated vertical labyrinth. Upon finding a mysterious mask, you gain the ability to climb walls with ease and speed. However, the tomb is filled with traps, spikes, and enemies, all while a rising tide of neon energy threatens to consume you from below. Survival depends on split-second decisions and lightning-fast swipes. The retro aesthetics and pulse-pounding soundtrack create an electrifying atmosphere.","Tomb Of The Mask : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Tomb Of The Mask Pizza Edition, Tomb Of The Mask Fullscreen, Tomb Of The Mask unblocked, arcade games",67706,"Playgendary","Arrow Keys / WASD: Move in direction",[68],{"slug":332,"title":333,"image":334,"categories":335,"format":59,"url":336,"content":337,"description":338,"keywords":339,"rating":174,"votes":340,"developer":341,"keybindings":342,"platform":343,"lastUpdated":304},"leader-strike","Leader Strike","/media/leader-strike.webp",[32,5],"https://htmlxm.github.io/h7/leader-strike","Leader Strike is a satirical and action-packed first-person shooter that puts a political twist on the classic arena combat genre. Players take control of caricatures of world leaders, battling it out in various urban environments to prove who truly runs the world. The game features a variety of weapons, from assault rifles to rocket launchers, and emphasizes fast movement and quick reflexes. Whether you're playing for the humor or the competitive shooting mechanics, Leader Strike offers a unique and entertaining take on the FPS category with its stylized graphics and global stage setting.","Leader Strike : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Leader Strike Pizza Edition, Leader Strike Fullscreen, Leader Strike unblocked, arcade games",56248,"Beedo Games","WASD: Move\nMouse: Aim/Shoot\nSpace: Jump\nR: Reload\n1-3: Switch Weapons",[68],{"slug":345,"title":346,"image":347,"categories":348,"format":59,"url":349,"content":350,"description":351,"keywords":352,"rating":79,"votes":353,"developer":354,"keybindings":355,"platform":356,"lastUpdated":357},"fancy-pants-3","Fancy Pants 3","/media/fancy-pants-3.webp",[8,5],"https://htmlxm.github.io/h4/fancy-pants-3","The stickman with the iconic orange pants returns in Fancy Pants Adventures: World 3! This chapter features even more fluid, momentum-based platforming that makes running and jumping feel like a work of art. In this adventure, our hero is recruited by the King of Squiggleville to fight off a band of pirates and save the kingdom. Explore lush, hand-drawn levels filled with secrets, collectibles, and hidden rooms. The game introduces new mechanics like swimming and wall-kicking, all while maintaining the smooth, parkour-style flow that made the series a legendary part of web gaming history.","Fancy Pants 3 : on Chromebook delivers seamless, lag-free gaming with an optimized interface, ensuring an enjoyable and safe experience for players of all ages","Fancy Pants 3 Pizza Edition, Fancy Pants 3 Fullscreen, Fancy Pants 3 unblocked, arcade games",76429,"Brad Borne","Left/Right Arrows: Run\nUp Arrow: Open doors/Jump\nDown Arrow: Duck/Roll/Slide\nS: Jump",[68],"March 2025",1766850286798]